[Survived] OptionalChaining
packages/chalk/src/index.js:2:15
 const { FORCE_COLOR, NO_COLOR, TERM } = process.env;
-const isTTY = process.stdout?.isTTY;
+const isTTY = process.stdout.isTTY;
 const level =
   NO_COLOR != null

[Killed] EqualityOperator
packages/chalk/src/index.js:4:3
 const { FORCE_COLOR, NO_COLOR, TERM } = process.env;
 const isTTY = process.stdout?.isTTY;
 const level =
-  NO_COLOR != null
+  NO_COLOR == null
     ? 0
     : FORCE_COLOR != null
killedBy: All tests
statusReason: (node:64610) Warning: The 'NO_COLOR' env is ignored due to the 'FORCE_COLOR' env being set.
(Use `node --trace-warnings ...` to show where the warning was created)

✖ red (1.436042ms)

✖ bold (0.191542ms)

✖ chained styles (2.80875ms)

[Killed] ConditionalExpression
packages/chalk/src/index.js:4:3
 const { FORCE_COLOR, NO_COLOR, TERM } = process.env;
 const isTTY = process.stdout?.isTTY;
 const level =
-  NO_COLOR != null
+  true
     ? 0
     : FORCE_COLOR != null
killedBy: All tests
statusReason: ✖ red (1.726958ms)

✖ bold (0.256875ms)
✖ chained styles (2.691042ms)
✖ bgRed (0.145042ms)

✖ multiple arguments (0.126916ms)
✔ nested styles (0.127042ms)

[Killed] EqualityOperator
packages/chalk/src/index.js:6:7
 const level =
   NO_COLOR != null
     ? 0
-    : FORCE_COLOR != null
+    : FORCE_COLOR == null
       ? FORCE_COLOR === "0"
         ? 0
killedBy: All tests
statusReason: ✖ red (1.506541ms)

✖ bold (0.228167ms)
✖ chained styles (2.680708ms)

✖ bgRed (0.15675ms)
✖ multiple arguments (0.129834ms)
✔ nested styles (0.122875ms)

[Killed] ConditionalExpression
packages/chalk/src/index.js:6:7
 const level =
   NO_COLOR != null
     ? 0
-    : FORCE_COLOR != null
+    : false
       ? FORCE_COLOR === "0"
         ? 0
killedBy: All tests
statusReason: ✖ red (1.533541ms)

✖ bold (0.189208ms)
✖ chained styles (2.429375ms)

✖ bgRed (0.146708ms)

✖ multiple arguments (0.118959ms)

[Killed] EqualityOperator
packages/chalk/src/index.js:7:9
   NO_COLOR != null
     ? 0
     : FORCE_COLOR != null
-      ? FORCE_COLOR === "0"
+      ? FORCE_COLOR !== "0"
         ? 0
         : 3
killedBy: All tests
statusReason: ✖ red (1.457417ms)

✖ bold (0.19725ms)
✖ chained styles (2.543083ms)

✖ bgRed (0.159209ms)
✖ multiple arguments (0.122375ms)

[Killed] ConditionalExpression
packages/chalk/src/index.js:7:9
   NO_COLOR != null
     ? 0
     : FORCE_COLOR != null
-      ? FORCE_COLOR === "0"
+      ? true
         ? 0
         : 3
killedBy: All tests
statusReason: ✖ red (1.632ms)

✖ bold (0.217666ms)
✖ chained styles (2.664292ms)
✖ bgRed (0.16375ms)

✖ multiple arguments (0.118458ms)

[Survived] EqualityOperator
packages/chalk/src/index.js:10:9
       ? FORCE_COLOR === "0"
         ? 0
         : 3
-      : TERM === "dumb"
+      : TERM !== "dumb"
         ? 0
         : isTTY

[Survived] ConditionalExpression
packages/chalk/src/index.js:10:9
       ? FORCE_COLOR === "0"
         ? 0
         : 3
-      : TERM === "dumb"
+      : true
         ? 0
         : isTTY

[Survived] ArrayDeclaration
packages/chalk/src/index.js:17:10
           : 0;
 
 const styles = {
-  reset: [0, 0],
+  reset: [],
   bold: [1, 22],
   dim: [2, 22],

[Survived] ArrayDeclaration
packages/chalk/src/index.js:19:8
 const styles = {
   reset: [0, 0],
   bold: [1, 22],
-  dim: [2, 22],
+  dim: [],
   italic: [3, 23],
   underline: [4, 24],

[Survived] ArrayDeclaration
packages/chalk/src/index.js:27:10
   strikethrough: [9, 29],
   black: [30, 39],
   red: [31, 39],
-  green: [32, 39],
+  green: [],
   yellow: [33, 39],
   blue: [34, 39],

[Survived] ArrayDeclaration
packages/chalk/src/index.js:32:10
   blue: [34, 39],
   magenta: [35, 39],
   cyan: [36, 39],
-  white: [37, 39],
+  white: [],
   gray: [90, 39],
   grey: [90, 39],

[Killed] ArrayDeclaration
packages/chalk/src/index.js:33:9
   magenta: [35, 39],
   cyan: [36, 39],
   white: [37, 39],
-  gray: [90, 39],
+  gray: [],
   grey: [90, 39],
   bgBlack: [40, 49],
killedBy: All tests
statusReason: ✔ red (1.115208ms)

✔ bold (0.160542ms)
✔ chained styles (0.210708ms)
✔ bgRed (0.0955ms)
✔ multiple arguments (0.0825ms)

✔ nested styles (0.112709ms)

[Survived] ArrayDeclaration
packages/chalk/src/index.js:35:12
   white: [37, 39],
   gray: [90, 39],
   grey: [90, 39],
-  bgBlack: [40, 49],
+  bgBlack: [],
   bgRed: [41, 49],
   bgGreen: [42, 49],

[Survived] ArrayDeclaration
packages/chalk/src/index.js:38:13
   bgBlack: [40, 49],
   bgRed: [41, 49],
   bgGreen: [42, 49],
-  bgYellow: [43, 49],
+  bgYellow: [],
   bgBlue: [44, 49],
   bgMagenta: [45, 49],

[Survived] ArrayDeclaration
packages/chalk/src/index.js:43:16
   bgMagenta: [45, 49],
   bgCyan: [46, 49],
   bgWhite: [47, 49],
-  blackBright: [90, 39],
+  blackBright: [],
   redBright: [91, 39],
   greenBright: [92, 39],

[Survived] ArrayDeclaration
packages/chalk/src/index.js:48:18
   greenBright: [92, 39],
   yellowBright: [93, 39],
   blueBright: [94, 39],
-  magentaBright: [95, 39],
+  magentaBright: [],
   cyanBright: [96, 39],
   whiteBright: [97, 39],

[Survived] ArrayDeclaration
packages/chalk/src/index.js:50:16
   blueBright: [94, 39],
   magentaBright: [95, 39],
   cyanBright: [96, 39],
-  whiteBright: [97, 39],
+  whiteBright: [],
   bgBlackBright: [100, 49],
   bgRedBright: [101, 49],

[Survived] ArrayDeclaration
packages/chalk/src/index.js:51:18
   magentaBright: [95, 39],
   cyanBright: [96, 39],
   whiteBright: [97, 39],
-  bgBlackBright: [100, 49],
+  bgBlackBright: [],
   bgRedBright: [101, 49],
   bgGreenBright: [102, 49],

[Survived] ArrayDeclaration
packages/chalk/src/index.js:57:17
   bgYellowBright: [103, 49],
   bgBlueBright: [104, 49],
   bgMagentaBright: [105, 49],
-  bgCyanBright: [106, 49],
+  bgCyanBright: [],
   bgWhiteBright: [107, 49],
 };

[Killed] BlockStatement
packages/chalk/src/index.js:62:30
 };
 
 function createChalk(parentCodes = []) {
-  const chalk = (...args) => {
-    const str = args.join(" ");
-    if (!level || !parentCodes.length) return str;
-    let open = "";
-    let close = "";
-    for (const [o, c] of parentCodes) {
-      open += `\x1b[${o}m`;
-      close = `\x1b[${c}m${close}`;
-    }
-    return (
-      open +
-      str.replace(
-        new RegExp(
-          `\\x1b\\[(?:${parentCodes.map(([, c]) => c).join("|")})m`,
-          "g",
-        ),
-        (m) => m + open,
-      ) +
-      close
-    );
-  };
+  const chalk = (...args) => {};
 
   for (const [name, codes] of Object.entries(styles)) {
killedBy: All tests
statusReason: (node:66510) Warning: The 'NO_COLOR' env is ignored due to the 'FORCE_COLOR' env being set.
(Use `node --trace-warnings ...` to show where the warning was created)

✖ red (1.402917ms)

✖ bold (0.242292ms)
✖ chained styles (0.121375ms)

[Killed] ConditionalExpression
packages/chalk/src/index.js:64:9
 function createChalk(parentCodes = []) {
   const chalk = (...args) => {
     const str = args.join(" ");
-    if (!level || !parentCodes.length) return str;
+    if (true) return str;
     let open = "";
     let close = "";
killedBy: All tests
statusReason: ✖ red (1.562834ms)

✖ bold (0.21175ms)
✖ chained styles (2.607083ms)

✖ bgRed (0.172625ms)
✖ multiple arguments (0.120333ms)

[Killed] LogicalOperator
packages/chalk/src/index.js:64:9
 function createChalk(parentCodes = []) {
   const chalk = (...args) => {
     const str = args.join(" ");
-    if (!level || !parentCodes.length) return str;
+    if (!level && !parentCodes.length) return str;
     let open = "";
     let close = "";
killedBy: All tests
statusReason: (node:66681) Warning: The 'NO_COLOR' env is ignored due to the 'FORCE_COLOR' env being set.
(Use `node --trace-warnings ...` to show where the warning was created)

✔ red (0.9425ms)

✔ bold (0.137125ms)

✔ chained styles (0.193041ms)

[Killed] BlockStatement
packages/chalk/src/index.js:67:39
     if (!level || !parentCodes.length) return str;
     let open = "";
     let close = "";
-    for (const [o, c] of parentCodes) {
-      open += `\x1b[${o}m`;
-      close = `\x1b[${c}m${close}`;
-    }
+    for (const [o, c] of parentCodes) {}
     return (
       open +
killedBy: All tests
statusReason: ✖ red (1.519459ms)

✖ bold (0.225375ms)
✖ chained styles (2.438792ms)
✖ bgRed (0.202542ms)

✖ multiple arguments (0.133334ms)

[Killed] StringLiteral
packages/chalk/src/index.js:68:15
     let open = "";
     let close = "";
     for (const [o, c] of parentCodes) {
-      open += `\x1b[${o}m`;
+      open += ``;
       close = `\x1b[${c}m${close}`;
     }
killedBy: All tests
statusReason: ✖ red (1.595334ms)

✖ bold (0.22125ms)
✖ chained styles (2.7725ms)
✖ bgRed (0.235875ms)

✖ multiple arguments (0.130834ms)

[Killed] ArithmeticOperator
packages/chalk/src/index.js:72:7
       close = `\x1b[${c}m${close}`;
     }
     return (
-      open +
-      str.replace(
-        new RegExp(
-          `\\x1b\\[(?:${parentCodes.map(([, c]) => c).join("|")})m`,
-          "g",
-        ),
-        (m) => m + open,
-      ) +
-      close
+      open + str.replace(new RegExp(`\\x1b\\[(?:${parentCodes.map(([, c]) => c).join("|")})m`, "g"), m => m + open) - close
     );
   };
killedBy: All tests
statusReason: ✖ red (1.464ms)

✖ bold (0.287083ms)
✖ chained styles (0.15ms)
✖ bgRed (0.154042ms)

✖ multiple arguments (0.103584ms)

[Killed] ArithmeticOperator
packages/chalk/src/index.js:72:7
       close = `\x1b[${c}m${close}`;
     }
     return (
-      open +
-      str.replace(
-        new RegExp(
-          `\\x1b\\[(?:${parentCodes.map(([, c]) => c).join("|")})m`,
-          "g",
-        ),
-        (m) => m + open,
-      ) +
+      open - str.replace(new RegExp(`\\x1b\\[(?:${parentCodes.map(([, c]) => c).join("|")})m`, "g"), m => m + open) +
       close
     );
killedBy: All tests
statusReason: ✖ red (1.747833ms)

✖ bold (0.257875ms)
✖ chained styles (2.814042ms)

✖ bgRed (0.199375ms)
✖ multiple arguments (0.135084ms)

[Survived] ArrowFunction
packages/chalk/src/index.js:75:41
       open +
       str.replace(
         new RegExp(
-          `\\x1b\\[(?:${parentCodes.map(([, c]) => c).join("|")})m`,
+          `\\x1b\\[(?:${parentCodes.map(() => undefined).join("|")})m`,
           "g",
         ),

[Killed] StringLiteral
packages/chalk/src/index.js:75:11
       open +
       str.replace(
         new RegExp(
-          `\\x1b\\[(?:${parentCodes.map(([, c]) => c).join("|")})m`,
+          ``,
           "g",
         ),
killedBy: All tests
statusReason: ✖ red (1.641875ms)

✖ bold (0.340666ms)
✖ chained styles (3.506625ms)

✖ bgRed (0.249292ms)

✖ multiple arguments (0.199667ms)

[Survived] ArithmeticOperator
packages/chalk/src/index.js:78:16
           `\\x1b\\[(?:${parentCodes.map(([, c]) => c).join("|")})m`,
           "g",
         ),
-        (m) => m + open,
+        (m) => m - open,
       ) +
       close

[Survived] ArrowFunction
packages/chalk/src/index.js:78:9
           `\\x1b\\[(?:${parentCodes.map(([, c]) => c).join("|")})m`,
           "g",
         ),
-        (m) => m + open,
+        () => undefined,
       ) +
       close

[Killed] BlockStatement
packages/chalk/src/index.js:84:55
     );
   };
 
-  for (const [name, codes] of Object.entries(styles)) {
-    Object.defineProperty(chalk, name, {
-      get() {
-        return createChalk([...parentCodes, codes]);
-      },
-      enumerable: true,
-    });
-  }
+  for (const [name, codes] of Object.entries(styles)) {}
 
   chalk.rgb = (r, g, b) =>
killedBy: All tests
statusReason: ✖ red (0.471208ms)

✖ bold (0.06175ms)
✖ chained styles (0.0585ms)

✖ bgRed (0.050208ms)

✖ multiple arguments (0.049959ms)

[Killed] BlockStatement
packages/chalk/src/index.js:86:13
 
   for (const [name, codes] of Object.entries(styles)) {
     Object.defineProperty(chalk, name, {
-      get() {
-        return createChalk([...parentCodes, codes]);
-      },
+      get() {},
       enumerable: true,
     });
killedBy: All tests
statusReason: ✖ red (0.967541ms)

✖ bold (0.082083ms)
✖ chained styles (0.061583ms)

✖ bgRed (0.046875ms)

✖ multiple arguments (0.043375ms)

[Survived] BooleanLiteral
packages/chalk/src/index.js:89:19
       get() {
         return createChalk([...parentCodes, codes]);
       },
-      enumerable: true,
+      enumerable: false,
     });
   }

[Killed] ArrowFunction
packages/chalk/src/index.js:93:15
     });
   }
 
-  chalk.rgb = (r, g, b) =>
-    createChalk([...parentCodes, [`38;2;${r};${g};${b}`, 39]]);
+  chalk.rgb = () => undefined;
   chalk.bgRgb = (r, g, b) =>
     createChalk([...parentCodes, [`48;2;${r};${g};${b}`, 49]]);
killedBy: All tests
statusReason: ✔ red (0.952875ms)

✔ bold (0.138041ms)
✔ chained styles (0.21ms)
✔ bgRed (0.107667ms)
✔ multiple arguments (0.081ms)

✔ nested styles (0.110209ms)

[Killed] ArrayDeclaration
packages/chalk/src/index.js:94:34
   }
 
   chalk.rgb = (r, g, b) =>
-    createChalk([...parentCodes, [`38;2;${r};${g};${b}`, 39]]);
+    createChalk([...parentCodes, []]);
   chalk.bgRgb = (r, g, b) =>
     createChalk([...parentCodes, [`48;2;${r};${g};${b}`, 49]]);
killedBy: All tests
statusReason: ✔ red (1.144959ms)

✔ bold (0.18425ms)
✔ chained styles (0.24875ms)
✔ bgRed (0.106417ms)
✔ multiple arguments (0.084291ms)

✔ nested styles (0.128042ms)

[Killed] StringLiteral
packages/chalk/src/index.js:94:35
   }
 
   chalk.rgb = (r, g, b) =>
-    createChalk([...parentCodes, [`38;2;${r};${g};${b}`, 39]]);
+    createChalk([...parentCodes, [``, 39]]);
   chalk.bgRgb = (r, g, b) =>
     createChalk([...parentCodes, [`48;2;${r};${g};${b}`, 49]]);
killedBy: All tests
statusReason: ✔ red (0.934625ms)

✔ bold (0.132208ms)
✔ chained styles (0.196375ms)
✔ bgRed (0.086625ms)
✔ multiple arguments (0.075334ms)

✔ nested styles (0.110583ms)

[Killed] ArrowFunction
packages/chalk/src/index.js:95:17
 
   chalk.rgb = (r, g, b) =>
     createChalk([...parentCodes, [`38;2;${r};${g};${b}`, 39]]);
-  chalk.bgRgb = (r, g, b) =>
-    createChalk([...parentCodes, [`48;2;${r};${g};${b}`, 49]]);
+  chalk.bgRgb = () => undefined;
   chalk.hex = (hex) => {
     const [r, g, b] = hexToRgb(hex);
killedBy: All tests
statusReason: ✔ red (1.175084ms)

✔ bold (0.198708ms)
✔ chained styles (0.229459ms)
✔ bgRed (0.109583ms)
✔ multiple arguments (0.085459ms)

✔ nested styles (0.112375ms)

[Killed] BlockStatement
packages/chalk/src/index.js:97:24
     createChalk([...parentCodes, [`38;2;${r};${g};${b}`, 39]]);
   chalk.bgRgb = (r, g, b) =>
     createChalk([...parentCodes, [`48;2;${r};${g};${b}`, 49]]);
-  chalk.hex = (hex) => {
-    const [r, g, b] = hexToRgb(hex);
-    return chalk.rgb(r, g, b);
-  };
+  chalk.hex = (hex) => {};
   chalk.bgHex = (hex) => {
     const [r, g, b] = hexToRgb(hex);
killedBy: All tests
statusReason: ✔ red (1.031291ms)

✔ bold (0.156375ms)
✔ chained styles (0.223625ms)
✔ bgRed (0.094916ms)
✔ multiple arguments (0.078208ms)

✔ nested styles (0.119959ms)

[Killed] BlockStatement
packages/chalk/src/index.js:101:26
     const [r, g, b] = hexToRgb(hex);
     return chalk.rgb(r, g, b);
   };
-  chalk.bgHex = (hex) => {
-    const [r, g, b] = hexToRgb(hex);
-    return chalk.bgRgb(r, g, b);
-  };
+  chalk.bgHex = (hex) => {};
   chalk.visible = (...args) => (level ? chalk(...args) : "");
   chalk.level = level;
killedBy: All tests
statusReason: ✔ red (0.908667ms)

✔ bold (0.128375ms)
✔ chained styles (0.199166ms)
✔ bgRed (0.089792ms)
✔ multiple arguments (0.074375ms)

✔ nested styles (0.106ms)

[Killed] ArrowFunction
packages/chalk/src/index.js:105:19
     const [r, g, b] = hexToRgb(hex);
     return chalk.bgRgb(r, g, b);
   };
-  chalk.visible = (...args) => (level ? chalk(...args) : "");
+  chalk.visible = () => undefined;
   chalk.level = level;
 
killedBy: All tests
statusReason: ✔ red (1.155833ms)

✔ bold (0.179834ms)
✔ chained styles (0.21575ms)
✔ bgRed (0.1135ms)
✔ multiple arguments (0.087125ms)

✔ nested styles (0.128ms)

[Killed] BlockStatement
packages/chalk/src/index.js:111:24
   return chalk;
 }
 
-function hexToRgb(hex) {
-  const h = hex.replace(/^#/, "");
-  const n = Number.parseInt(h, 16);
-  return [(n >> 16) & 255, (n >> 8) & 255, n & 255];
-}
+function hexToRgb(hex) {}
 
 const chalk = createChalk();
killedBy: All tests
statusReason: ✔ red (1.022959ms)

✔ bold (0.139875ms)
✔ chained styles (0.205958ms)
✔ bgRed (0.090125ms)
✔ multiple arguments (0.075334ms)

✔ nested styles (0.108083ms)

[Survived] Regex
packages/chalk/src/index.js:112:25
 }
 
 function hexToRgb(hex) {
-  const h = hex.replace(/^#/, "");
+  const h = hex.replace(/#/, "");
   const n = Number.parseInt(h, 16);
   return [(n >> 16) & 255, (n >> 8) & 255, n & 255];

[Survived] ConditionalExpression
packages/chalk/src/index.js:120:13
 const chalk = createChalk();
 chalk.supportsColor = {
   level,
-  hasBasic: level >= 1,
+  hasBasic: true,
   has256: level >= 2,
   has16m: level >= 3,

[Survived] EqualityOperator
packages/chalk/src/index.js:120:13
 const chalk = createChalk();
 chalk.supportsColor = {
   level,
-  hasBasic: level >= 1,
+  hasBasic: level < 1,
   has256: level >= 2,
   has16m: level >= 3,

[Survived] ConditionalExpression
packages/chalk/src/index.js:121:11
 chalk.supportsColor = {
   level,
   hasBasic: level >= 1,
-  has256: level >= 2,
+  has256: false,
   has16m: level >= 3,
 };

[Survived] EqualityOperator
packages/chalk/src/index.js:121:11
 chalk.supportsColor = {
   level,
   hasBasic: level >= 1,
-  has256: level >= 2,
+  has256: level < 2,
   has16m: level >= 3,
 };
