[Killed] BlockStatement
packages/semver/src/index.js:1:19
-function parse(v) {
-  const m = String(v).match(/^(\d+)\.(\d+)\.(\d+)(?:-(.+))?$/);
-  if (!m) return null;
-  return {
-    major: +m[1],
-    minor: +m[2],
-    patch: +m[3],
-    prerelease: m[4] || "",
-    version: v,
-  };
-}
+function parse(v) {}
 function compare(a, b) {
   const pa = parse(a);
killedBy: All tests
statusReason: ✖ parses version (1.191333ms)

✖ parses prerelease (0.062208ms)
✖ compares versions (0.198542ms)

✖ satisfies range (0.14375ms)

✖ parse returns null for invalid (0.256708ms)

[Killed] Regex
packages/semver/src/index.js:2:29
 function parse(v) {
-  const m = String(v).match(/^(\d+)\.(\d+)\.(\d+)(?:-(.+))?$/);
+  const m = String(v).match(/^(\d+)\.(\D+)\.(\d+)(?:-(.+))?$/);
   if (!m) return null;
   return {
killedBy: All tests
statusReason: ✖ parses version (1.133625ms)

✖ parses prerelease (0.088667ms)
✖ compares versions (0.187458ms)

✖ satisfies range (0.129584ms)
✔ parse returns null for invalid (0.086667ms)

[Killed] Regex
packages/semver/src/index.js:2:29
 function parse(v) {
-  const m = String(v).match(/^(\d+)\.(\d+)\.(\d+)(?:-(.+))?$/);
+  const m = String(v).match(/^(\d+)\.(\d)\.(\d+)(?:-(.+))?$/);
   if (!m) return null;
   return {
killedBy: All tests
statusReason: ✔ parses version (0.982833ms)

✔ parses prerelease (0.133667ms)

✔ compares versions (0.156625ms)

✔ satisfies range (0.168708ms)

[Killed] ConditionalExpression
packages/semver/src/index.js:3:7
 function parse(v) {
   const m = String(v).match(/^(\d+)\.(\d+)\.(\d+)(?:-(.+))?$/);
-  if (!m) return null;
+  if (false) return null;
   return {
     major: +m[1],
killedBy: All tests
statusReason: ✔ parses version (0.806083ms)

✔ parses prerelease (0.115042ms)

✔ compares versions (0.150792ms)

✔ satisfies range (0.162334ms)

[Killed] ConditionalExpression
packages/semver/src/index.js:3:7
 function parse(v) {
   const m = String(v).match(/^(\d+)\.(\d+)\.(\d+)(?:-(.+))?$/);
-  if (!m) return null;
+  if (true) return null;
   return {
     major: +m[1],
killedBy: All tests
statusReason: ✖ parses version (1.167541ms)

✖ parses prerelease (0.09475ms)
✖ compares versions (0.185208ms)

✖ satisfies range (0.13675ms)

✔ parse returns null for invalid (0.182833ms)

[Killed] UnaryOperator
packages/semver/src/index.js:5:12
   const m = String(v).match(/^(\d+)\.(\d+)\.(\d+)(?:-(.+))?$/);
   if (!m) return null;
   return {
-    major: +m[1],
+    major: -m[1],
     minor: +m[2],
     patch: +m[3],
killedBy: All tests
statusReason: ✖ parses version (1.508667ms)
✔ parses prerelease (0.156334ms)

✖ compares versions (0.215083ms)
✖ satisfies range (0.607791ms)
✔ parse returns null for invalid (0.089542ms)

✖ parse extracts major/minor/patch correctly (0.094959ms)

[Killed] UnaryOperator
packages/semver/src/index.js:6:12
   if (!m) return null;
   return {
     major: +m[1],
-    minor: +m[2],
+    minor: -m[2],
     patch: +m[3],
     prerelease: m[4] || "",
killedBy: All tests
statusReason: ✖ parses version (1.326834ms)
✔ parses prerelease (0.127667ms)

✔ compares versions (0.159125ms)
✖ satisfies range (0.6885ms)
✔ parse returns null for invalid (0.088083ms)

✖ parse extracts major/minor/patch correctly (0.099333ms)

[Killed] UnaryOperator
packages/semver/src/index.js:7:12
   return {
     major: +m[1],
     minor: +m[2],
-    patch: +m[3],
+    patch: -m[3],
     prerelease: m[4] || "",
     version: v,
killedBy: All tests
statusReason: ✖ parses version (1.288291ms)
✔ parses prerelease (0.124166ms)

✔ compares versions (0.160333ms)
✖ satisfies range (0.576667ms)
✔ parse returns null for invalid (0.068375ms)

✖ parse extracts major/minor/patch correctly (0.089709ms)

[Killed] ConditionalExpression
packages/semver/src/index.js:8:17
     major: +m[1],
     minor: +m[2],
     patch: +m[3],
-    prerelease: m[4] || "",
+    prerelease: true,
     version: v,
   };
killedBy: All tests
statusReason: ✖ parses version (1.388ms)

✖ parses prerelease (0.171916ms)
✔ compares versions (0.187708ms)
✔ satisfies range (0.604125ms)
✔ parse returns null for invalid (0.068833ms)

✔ parse extracts major/minor/patch correctly (0.058084ms)

[Killed] LogicalOperator
packages/semver/src/index.js:8:17
     major: +m[1],
     minor: +m[2],
     patch: +m[3],
-    prerelease: m[4] || "",
+    prerelease: m[4] && "",
     version: v,
   };
killedBy: All tests
statusReason: ✖ parses version (1.402416ms)
✖ parses prerelease (0.180542ms)

✔ compares versions (0.192041ms)
✔ satisfies range (1.261666ms)
✔ parse returns null for invalid (0.212834ms)
✔ parse extracts major/minor/patch correctly (0.239958ms)
✔ compare returns positive when a > b (0.506792ms)

[Killed] BlockStatement
packages/semver/src/index.js:12:24
     version: v,
   };
 }
-function compare(a, b) {
-  const pa = parse(a);
-  const pb = parse(b);
-  if (!pa || !pb) return Number.NaN;
-  if (pa.major !== pb.major) return pa.major - pb.major;
-  if (pa.minor !== pb.minor) return pa.minor - pb.minor;
-  if (pa.patch !== pb.patch) return pa.patch - pb.patch;
-  if (pa.prerelease && !pb.prerelease) return -1;
-  if (!pa.prerelease && pb.prerelease) return 1;
-  return 0;
-}
+function compare(a, b) {}
 function gt(a, b) {
   return compare(a, b) > 0;
killedBy: All tests
statusReason: ✔ parses version (0.83975ms)

✔ parses prerelease (0.12575ms)

✖ compares versions (0.477292ms)
✔ satisfies range (0.167375ms)

✔ parse returns null for invalid (0.159291ms)

[Killed] ConditionalExpression
packages/semver/src/index.js:15:7
 function compare(a, b) {
   const pa = parse(a);
   const pb = parse(b);
-  if (!pa || !pb) return Number.NaN;
+  if (false) return Number.NaN;
   if (pa.major !== pb.major) return pa.major - pb.major;
   if (pa.minor !== pb.minor) return pa.minor - pb.minor;
killedBy: All tests
statusReason: ✔ parses version (0.830792ms)

✔ parses prerelease (0.113084ms)

✔ compares versions (0.160708ms)

✔ satisfies range (0.163208ms)

[Killed] LogicalOperator
packages/semver/src/index.js:15:7
 function compare(a, b) {
   const pa = parse(a);
   const pb = parse(b);
-  if (!pa || !pb) return Number.NaN;
+  if (!pa && !pb) return Number.NaN;
   if (pa.major !== pb.major) return pa.major - pb.major;
   if (pa.minor !== pb.minor) return pa.minor - pb.minor;
killedBy: All tests
statusReason: ✔ parses version (0.786375ms)

✔ parses prerelease (0.112ms)

✔ compares versions (0.155708ms)

✔ satisfies range (0.171333ms)

[Killed] ConditionalExpression
packages/semver/src/index.js:16:7
   const pa = parse(a);
   const pb = parse(b);
   if (!pa || !pb) return Number.NaN;
-  if (pa.major !== pb.major) return pa.major - pb.major;
+  if (true) return pa.major - pb.major;
   if (pa.minor !== pb.minor) return pa.minor - pb.minor;
   if (pa.patch !== pb.patch) return pa.patch - pb.patch;
killedBy: All tests
statusReason: ✔ parses version (0.781792ms)

✔ parses prerelease (0.115333ms)
✔ compares versions (0.1575ms)
✔ satisfies range (0.163ms)
✔ parse returns null for invalid (0.0635ms)

✔ parse extracts major/minor/patch correctly (0.0535ms)

[Killed] ArithmeticOperator
packages/semver/src/index.js:16:37
   const pa = parse(a);
   const pb = parse(b);
   if (!pa || !pb) return Number.NaN;
-  if (pa.major !== pb.major) return pa.major - pb.major;
+  if (pa.major !== pb.major) return pa.major + pb.major;
   if (pa.minor !== pb.minor) return pa.minor - pb.minor;
   if (pa.patch !== pb.patch) return pa.patch - pb.patch;
killedBy: All tests
statusReason: ✔ parses version (0.837208ms)

✔ parses prerelease (0.257125ms)

✖ compares versions (0.578834ms)
✔ satisfies range (0.571792ms)

✔ parse returns null for invalid (0.077542ms)

[Killed] ArithmeticOperator
packages/semver/src/index.js:17:37
   const pb = parse(b);
   if (!pa || !pb) return Number.NaN;
   if (pa.major !== pb.major) return pa.major - pb.major;
-  if (pa.minor !== pb.minor) return pa.minor - pb.minor;
+  if (pa.minor !== pb.minor) return pa.minor + pb.minor;
   if (pa.patch !== pb.patch) return pa.patch - pb.patch;
   if (pa.prerelease && !pb.prerelease) return -1;
killedBy: All tests
statusReason: ✔ parses version (0.820708ms)

✔ parses prerelease (0.118042ms)
✔ compares versions (0.166333ms)
✔ satisfies range (0.166708ms)
✔ parse returns null for invalid (0.098667ms)

✔ parse extracts major/minor/patch correctly (0.06775ms)

[Killed] EqualityOperator
packages/semver/src/index.js:17:7
   const pb = parse(b);
   if (!pa || !pb) return Number.NaN;
   if (pa.major !== pb.major) return pa.major - pb.major;
-  if (pa.minor !== pb.minor) return pa.minor - pb.minor;
+  if (pa.minor === pb.minor) return pa.minor - pb.minor;
   if (pa.patch !== pb.patch) return pa.patch - pb.patch;
   if (pa.prerelease && !pb.prerelease) return -1;
killedBy: All tests
statusReason: ✔ parses version (0.806875ms)

✔ parses prerelease (0.121417ms)
✔ compares versions (0.168542ms)
✔ satisfies range (0.161959ms)
✔ parse returns null for invalid (0.124292ms)

✔ parse extracts major/minor/patch correctly (0.072042ms)

[Killed] ArithmeticOperator
packages/semver/src/index.js:18:37
   if (!pa || !pb) return Number.NaN;
   if (pa.major !== pb.major) return pa.major - pb.major;
   if (pa.minor !== pb.minor) return pa.minor - pb.minor;
-  if (pa.patch !== pb.patch) return pa.patch - pb.patch;
+  if (pa.patch !== pb.patch) return pa.patch + pb.patch;
   if (pa.prerelease && !pb.prerelease) return -1;
   if (!pa.prerelease && pb.prerelease) return 1;
killedBy: All tests
statusReason: ✔ parses version (0.85125ms)
✔ parses prerelease (0.127042ms)

✔ compares versions (0.164833ms)

✔ satisfies range (0.170292ms)

✔ parse returns null for invalid (0.101958ms)

[Killed] ConditionalExpression
packages/semver/src/index.js:18:7
   if (!pa || !pb) return Number.NaN;
   if (pa.major !== pb.major) return pa.major - pb.major;
   if (pa.minor !== pb.minor) return pa.minor - pb.minor;
-  if (pa.patch !== pb.patch) return pa.patch - pb.patch;
+  if (true) return pa.patch - pb.patch;
   if (pa.prerelease && !pb.prerelease) return -1;
   if (!pa.prerelease && pb.prerelease) return 1;
killedBy: All tests
statusReason: ✔ parses version (0.974375ms)

✔ parses prerelease (0.136417ms)
✔ compares versions (0.161416ms)
✔ satisfies range (0.173125ms)
✔ parse returns null for invalid (0.104208ms)

✔ parse extracts major/minor/patch correctly (0.068042ms)

[Killed] BooleanLiteral
packages/semver/src/index.js:19:24
   if (pa.major !== pb.major) return pa.major - pb.major;
   if (pa.minor !== pb.minor) return pa.minor - pb.minor;
   if (pa.patch !== pb.patch) return pa.patch - pb.patch;
-  if (pa.prerelease && !pb.prerelease) return -1;
+  if (pa.prerelease && pb.prerelease) return -1;
   if (!pa.prerelease && pb.prerelease) return 1;
   return 0;
killedBy: All tests
statusReason: ✔ parses version (0.831625ms)

✔ parses prerelease (0.127875ms)
✔ compares versions (0.163125ms)
✔ satisfies range (0.164917ms)

✔ parse returns null for invalid (0.1415ms)

[Killed] ConditionalExpression
packages/semver/src/index.js:19:7
   if (pa.major !== pb.major) return pa.major - pb.major;
   if (pa.minor !== pb.minor) return pa.minor - pb.minor;
   if (pa.patch !== pb.patch) return pa.patch - pb.patch;
-  if (pa.prerelease && !pb.prerelease) return -1;
+  if (false) return -1;
   if (!pa.prerelease && pb.prerelease) return 1;
   return 0;
killedBy: All tests
statusReason: ✔ parses version (0.878208ms)

✔ parses prerelease (0.127292ms)
✔ compares versions (0.167333ms)
✔ satisfies range (0.173ms)
✔ parse returns null for invalid (0.068292ms)

✔ parse extracts major/minor/patch correctly (0.060125ms)

[Killed] BooleanLiteral
packages/semver/src/index.js:20:7
   if (pa.minor !== pb.minor) return pa.minor - pb.minor;
   if (pa.patch !== pb.patch) return pa.patch - pb.patch;
   if (pa.prerelease && !pb.prerelease) return -1;
-  if (!pa.prerelease && pb.prerelease) return 1;
+  if (pa.prerelease && pb.prerelease) return 1;
   return 0;
 }
killedBy: All tests
statusReason: ✔ parses version (0.917334ms)

✔ parses prerelease (0.124209ms)
✔ compares versions (0.160792ms)
✔ satisfies range (0.176ms)
✔ parse returns null for invalid (0.11725ms)

✔ parse extracts major/minor/patch correctly (0.069875ms)

[Killed] ConditionalExpression
packages/semver/src/index.js:20:7
   if (pa.minor !== pb.minor) return pa.minor - pb.minor;
   if (pa.patch !== pb.patch) return pa.patch - pb.patch;
   if (pa.prerelease && !pb.prerelease) return -1;
-  if (!pa.prerelease && pb.prerelease) return 1;
+  if (false) return 1;
   return 0;
 }
killedBy: All tests
statusReason: ✔ parses version (0.805875ms)

✔ parses prerelease (0.118208ms)
✔ compares versions (0.156042ms)
✔ satisfies range (0.161417ms)
✔ parse returns null for invalid (0.067375ms)

✔ parse extracts major/minor/patch correctly (0.056333ms)

[Killed] BlockStatement
packages/semver/src/index.js:23:19
   if (!pa.prerelease && pb.prerelease) return 1;
   return 0;
 }
-function gt(a, b) {
-  return compare(a, b) > 0;
-}
+function gt(a, b) {}
 function lt(a, b) {
   return compare(a, b) < 0;
killedBy: All tests
statusReason: ✔ parses version (0.866875ms)

✔ parses prerelease (0.123125ms)

✖ compares versions (0.456916ms)

✔ satisfies range (0.171542ms)
✔ parse returns null for invalid (0.066167ms)

[Killed] EqualityOperator
packages/semver/src/index.js:24:10
   return 0;
 }
 function gt(a, b) {
-  return compare(a, b) > 0;
+  return compare(a, b) <= 0;
 }
 function lt(a, b) {
killedBy: All tests
statusReason: ✔ parses version (0.863ms)

✔ parses prerelease (0.131417ms)

✖ compares versions (0.483458ms)

✔ satisfies range (0.557125ms)

[Killed] ConditionalExpression
packages/semver/src/index.js:24:10
   return 0;
 }
 function gt(a, b) {
-  return compare(a, b) > 0;
+  return false;
 }
 function lt(a, b) {
killedBy: All tests
statusReason: ✔ parses version (0.816709ms)

✔ parses prerelease (0.116417ms)

✖ compares versions (0.414708ms)

✔ satisfies range (0.164083ms)
✔ parse returns null for invalid (0.1445ms)

[Killed] BlockStatement
packages/semver/src/index.js:26:19
 function gt(a, b) {
   return compare(a, b) > 0;
 }
-function lt(a, b) {
-  return compare(a, b) < 0;
-}
+function lt(a, b) {}
 function eq(a, b) {
   return compare(a, b) === 0;
killedBy: All tests
statusReason: ✔ parses version (0.897542ms)

✔ parses prerelease (0.165833ms)

✖ compares versions (0.574292ms)

✔ satisfies range (0.608209ms)

[Killed] EqualityOperator
packages/semver/src/index.js:27:10
   return compare(a, b) > 0;
 }
 function lt(a, b) {
-  return compare(a, b) < 0;
+  return compare(a, b) >= 0;
 }
 function eq(a, b) {
killedBy: All tests
statusReason: ✔ parses version (0.8195ms)

✔ parses prerelease (0.116416ms)

✖ compares versions (0.477084ms)

✔ satisfies range (0.575125ms)
✔ parse returns null for invalid (0.098125ms)

[Killed] ConditionalExpression
packages/semver/src/index.js:27:10
   return compare(a, b) > 0;
 }
 function lt(a, b) {
-  return compare(a, b) < 0;
+  return false;
 }
 function eq(a, b) {
killedBy: All tests
statusReason: ✔ parses version (0.777708ms)

✔ parses prerelease (0.114667ms)

✖ compares versions (0.465083ms)

✔ satisfies range (0.543125ms)

[Killed] BlockStatement
packages/semver/src/index.js:29:19
 function lt(a, b) {
   return compare(a, b) < 0;
 }
-function eq(a, b) {
-  return compare(a, b) === 0;
-}
+function eq(a, b) {}
 function satisfies(v, r) {
   const p = parse(v);
killedBy: All tests
statusReason: ✔ parses version (0.832541ms)
✔ parses prerelease (0.123083ms)

✖ compares versions (0.528125ms)
✔ satisfies range (0.631167ms)
✔ parse returns null for invalid (0.137916ms)
✔ parse extracts major/minor/patch correctly (0.0805ms)

[Killed] EqualityOperator
packages/semver/src/index.js:30:10
   return compare(a, b) < 0;
 }
 function eq(a, b) {
-  return compare(a, b) === 0;
+  return compare(a, b) !== 0;
 }
 function satisfies(v, r) {
killedBy: All tests
statusReason: ✔ parses version (1.041917ms)

✔ parses prerelease (0.142875ms)

✖ compares versions (0.543333ms)
✔ satisfies range (0.563667ms)

✔ parse returns null for invalid (0.108959ms)

[Killed] ConditionalExpression
packages/semver/src/index.js:30:10
   return compare(a, b) < 0;
 }
 function eq(a, b) {
-  return compare(a, b) === 0;
+  return true;
 }
 function satisfies(v, r) {
killedBy: All tests
statusReason: ✔ parses version (0.867334ms)

✔ parses prerelease (0.122209ms)

✔ compares versions (0.158542ms)

✔ satisfies range (0.155166ms)

[Killed] BlockStatement
packages/semver/src/index.js:32:26
 function eq(a, b) {
   return compare(a, b) === 0;
 }
-function satisfies(v, r) {
-  const p = parse(v);
-  if (!p) return false;
-  const m = r.match(/^(\d+)\.(\d+)\.(\d+)$/);
-  if (!m) return false;
-  const rm = { major: +m[1], minor: +m[2], patch: +m[3] };
-  return p.major === rm.major && p.minor === rm.minor && p.patch === rm.patch;
-}
+function satisfies(v, r) {}
 module.exports = { parse, compare, gt, lt, eq, satisfies };
 
killedBy: All tests
statusReason: ✔ parses version (0.882666ms)

✔ parses prerelease (0.129666ms)
✔ compares versions (0.171834ms)

✖ satisfies range (0.890958ms)
✔ parse returns null for invalid (0.095792ms)

[Killed] BooleanLiteral
packages/semver/src/index.js:34:7
 }
 function satisfies(v, r) {
   const p = parse(v);
-  if (!p) return false;
+  if (p) return false;
   const m = r.match(/^(\d+)\.(\d+)\.(\d+)$/);
   if (!m) return false;
killedBy: All tests
statusReason: ✔ parses version (0.859375ms)

✔ parses prerelease (0.120583ms)

✔ compares versions (0.156375ms)

✖ satisfies range (0.811083ms)
✔ parse returns null for invalid (0.0645ms)

[Killed] ConditionalExpression
packages/semver/src/index.js:34:7
 }
 function satisfies(v, r) {
   const p = parse(v);
-  if (!p) return false;
+  if (true) return false;
   const m = r.match(/^(\d+)\.(\d+)\.(\d+)$/);
   if (!m) return false;
killedBy: All tests
statusReason: ✔ parses version (0.78825ms)

✔ parses prerelease (0.118583ms)

✔ compares versions (0.161917ms)

✖ satisfies range (0.775959ms)

[Killed] Regex
packages/semver/src/index.js:35:21
 function satisfies(v, r) {
   const p = parse(v);
   if (!p) return false;
-  const m = r.match(/^(\d+)\.(\d+)\.(\d+)$/);
+  const m = r.match(/^(\d+)\.(\D+)\.(\d+)$/);
   if (!m) return false;
   const rm = { major: +m[1], minor: +m[2], patch: +m[3] };
killedBy: All tests
statusReason: ✔ parses version (0.817084ms)

✔ parses prerelease (0.120959ms)

✔ compares versions (0.158041ms)

✖ satisfies range (0.914917ms)
✔ parse returns null for invalid (0.094458ms)

[Survived] Regex
packages/semver/src/index.js:35:21
 function satisfies(v, r) {
   const p = parse(v);
   if (!p) return false;
-  const m = r.match(/^(\d+)\.(\d+)\.(\d+)$/);
+  const m = r.match(/^(\d+)\.(\d+)\.(\d+)/);
   if (!m) return false;
   const rm = { major: +m[1], minor: +m[2], patch: +m[3] };

[Killed] BooleanLiteral
packages/semver/src/index.js:36:7
   const p = parse(v);
   if (!p) return false;
   const m = r.match(/^(\d+)\.(\d+)\.(\d+)$/);
-  if (!m) return false;
+  if (m) return false;
   const rm = { major: +m[1], minor: +m[2], patch: +m[3] };
   return p.major === rm.major && p.minor === rm.minor && p.patch === rm.patch;
killedBy: All tests
statusReason: ✔ parses version (0.824833ms)

✔ parses prerelease (0.120959ms)

✔ compares versions (0.160959ms)

✖ satisfies range (0.904208ms)
✔ parse returns null for invalid (0.089542ms)

[Killed] ConditionalExpression
packages/semver/src/index.js:36:7
   const p = parse(v);
   if (!p) return false;
   const m = r.match(/^(\d+)\.(\d+)\.(\d+)$/);
-  if (!m) return false;
+  if (true) return false;
   const rm = { major: +m[1], minor: +m[2], patch: +m[3] };
   return p.major === rm.major && p.minor === rm.minor && p.patch === rm.patch;
killedBy: All tests
statusReason: ✔ parses version (0.952416ms)

✔ parses prerelease (0.138208ms)

✔ compares versions (0.16525ms)

✖ satisfies range (0.943583ms)

[Killed] UnaryOperator
packages/semver/src/index.js:37:51
   if (!p) return false;
   const m = r.match(/^(\d+)\.(\d+)\.(\d+)$/);
   if (!m) return false;
-  const rm = { major: +m[1], minor: +m[2], patch: +m[3] };
+  const rm = { major: +m[1], minor: +m[2], patch: -m[3] };
   return p.major === rm.major && p.minor === rm.minor && p.patch === rm.patch;
 }
killedBy: All tests
statusReason: ✔ parses version (0.861708ms)
✔ parses prerelease (0.123084ms)

✔ compares versions (0.157625ms)

✖ satisfies range (0.938583ms)
✔ parse returns null for invalid (0.121417ms)

[Killed] UnaryOperator
packages/semver/src/index.js:37:37
   if (!p) return false;
   const m = r.match(/^(\d+)\.(\d+)\.(\d+)$/);
   if (!m) return false;
-  const rm = { major: +m[1], minor: +m[2], patch: +m[3] };
+  const rm = { major: +m[1], minor: -m[2], patch: +m[3] };
   return p.major === rm.major && p.minor === rm.minor && p.patch === rm.patch;
 }
killedBy: All tests
statusReason: ✔ parses version (0.831917ms)

✔ parses prerelease (0.12225ms)
✔ compares versions (0.160666ms)

✖ satisfies range (0.995292ms)

✔ parse returns null for invalid (0.084709ms)

[Killed] LogicalOperator
packages/semver/src/index.js:38:10
   const m = r.match(/^(\d+)\.(\d+)\.(\d+)$/);
   if (!m) return false;
   const rm = { major: +m[1], minor: +m[2], patch: +m[3] };
-  return p.major === rm.major && p.minor === rm.minor && p.patch === rm.patch;
+  return p.major === rm.major && p.minor === rm.minor || p.patch === rm.patch;
 }
 module.exports = { parse, compare, gt, lt, eq, satisfies };
killedBy: All tests
statusReason: ✔ parses version (0.770958ms)

✔ parses prerelease (0.112209ms)

✔ compares versions (0.154291ms)

✖ satisfies range (0.864542ms)
✔ parse returns null for invalid (0.063542ms)

[Killed] EqualityOperator
packages/semver/src/index.js:38:34
   const m = r.match(/^(\d+)\.(\d+)\.(\d+)$/);
   if (!m) return false;
   const rm = { major: +m[1], minor: +m[2], patch: +m[3] };
-  return p.major === rm.major && p.minor === rm.minor && p.patch === rm.patch;
+  return p.major === rm.major && p.minor !== rm.minor && p.patch === rm.patch;
 }
 module.exports = { parse, compare, gt, lt, eq, satisfies };
killedBy: All tests
statusReason: ✔ parses version (0.804084ms)

✔ parses prerelease (0.107875ms)

✔ compares versions (0.160208ms)

✖ satisfies range (0.876084ms)
✔ parse returns null for invalid (0.071959ms)
