[Killed] BlockStatement
packages/braces/src/index.js:1:35
-function braces(pattern, options) {
-  const opts = options || {};
-  if (opts.expand) return expand(pattern);
-  return [compile(pattern)];
-}
+function braces(pattern, options) {}
 
 function expand(pattern) {
killedBy: All tests
statusReason: ✖ expand comma-separated (1.135875ms)

✖ expand numeric range (0.146166ms)

✖ expand alpha range (0.106167ms)

✖ expand with step (0.106167ms)

[Killed] LogicalOperator
packages/braces/src/index.js:2:16
 function braces(pattern, options) {
-  const opts = options || {};
+  const opts = options && {};
   if (opts.expand) return expand(pattern);
   return [compile(pattern)];
killedBy: All tests
statusReason: ✖ expand comma-separated (1.32375ms)

✖ expand numeric range (0.263ms)

✖ expand alpha range (0.134292ms)

✖ expand with step (0.613916ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:2:16
 function braces(pattern, options) {
-  const opts = options || {};
+  const opts = false;
   if (opts.expand) return expand(pattern);
   return [compile(pattern)];
killedBy: All tests
statusReason: ✖ expand comma-separated (1.298958ms)

✖ expand numeric range (0.240208ms)

✖ expand alpha range (0.189084ms)

✖ expand with step (0.586416ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:3:7
 function braces(pattern, options) {
   const opts = options || {};
-  if (opts.expand) return expand(pattern);
+  if (true) return expand(pattern);
   return [compile(pattern)];
 }
killedBy: All tests
statusReason: ✔ expand comma-separated (1.048459ms)

✔ expand numeric range (0.236583ms)
✔ expand alpha range (0.205ms)

✔ expand with step (0.559084ms)

✔ expand descending (0.083833ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:3:7
 function braces(pattern, options) {
   const opts = options || {};
-  if (opts.expand) return expand(pattern);
+  if (false) return expand(pattern);
   return [compile(pattern)];
 }
killedBy: All tests
statusReason: ✖ expand comma-separated (1.252417ms)

✖ expand numeric range (0.154416ms)

✖ expand alpha range (0.118375ms)

✖ expand with step (0.481042ms)

[Killed] EqualityOperator
packages/braces/src/index.js:12:10
   const stack = [results];
   let i = 0;
 
-  while (i < pattern.length) {
+  while (i >= pattern.length) {
     if (pattern[i] === "{") {
       const range = tryRange(pattern, i);
killedBy: All tests
statusReason: ✖ expand comma-separated (1.281584ms)

✖ expand numeric range (0.149791ms)

✖ expand alpha range (0.129792ms)

✖ expand with step (0.549416ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:13:9
   let i = 0;
 
   while (i < pattern.length) {
-    if (pattern[i] === "{") {
+    if (false) {
       const range = tryRange(pattern, i);
       if (range) {
killedBy: All tests
statusReason: ✖ expand comma-separated (1.309875ms)

✖ expand numeric range (0.167917ms)

✖ expand alpha range (0.135291ms)

✖ expand with step (0.498584ms)

[Killed] EqualityOperator
packages/braces/src/index.js:13:9
   let i = 0;
 
   while (i < pattern.length) {
-    if (pattern[i] === "{") {
+    if (pattern[i] !== "{") {
       const range = tryRange(pattern, i);
       if (range) {
killedBy: All tests
statusReason: ✖ expand comma-separated (1.733875ms)

✖ expand numeric range (0.189125ms)
✖ expand alpha range (0.212958ms)

✖ expand with step (0.176ms)

✖ expand descending (0.134917ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:15:11
   while (i < pattern.length) {
     if (pattern[i] === "{") {
       const range = tryRange(pattern, i);
-      if (range) {
+      if (true) {
         const current = stack[stack.length - 1];
         const expanded = expandRange(range.body);
killedBy: All tests
statusReason: ✖ expand comma-separated (0.732916ms)

✔ expand numeric range (0.528084ms)
✔ expand alpha range (0.114625ms)

✔ expand with step (0.1175ms)

✔ expand descending (0.176834ms)

[Killed] BlockStatement
packages/braces/src/index.js:15:18
   while (i < pattern.length) {
     if (pattern[i] === "{") {
       const range = tryRange(pattern, i);
-      if (range) {
-        const current = stack[stack.length - 1];
-        const expanded = expandRange(range.body);
-        const newResults = [];
-        for (const prefix of current) {
-          for (const item of expanded) newResults.push(prefix + item);
-        }
-        stack[stack.length - 1] = newResults;
-        i = range.end + 1;
-        continue;
-      }
+      if (range) {}
       const items = parseBraces(pattern, i);
       if (items) {
killedBy: All tests
statusReason: ✔ expand comma-separated (1.101958ms)

✖ expand numeric range (0.726ms)

✖ expand alpha range (0.648042ms)

✖ expand with step (0.225417ms)

[Killed] ArithmeticOperator
packages/braces/src/index.js:16:31
     if (pattern[i] === "{") {
       const range = tryRange(pattern, i);
       if (range) {
-        const current = stack[stack.length - 1];
+        const current = stack[stack.length + 1];
         const expanded = expandRange(range.body);
         const newResults = [];
killedBy: All tests
statusReason: ✔ expand comma-separated (1.076542ms)

✖ expand numeric range (0.3825ms)

✖ expand alpha range (0.334833ms)

✖ expand with step (0.217834ms)

[Killed] BlockStatement
packages/braces/src/index.js:19:39
         const current = stack[stack.length - 1];
         const expanded = expandRange(range.body);
         const newResults = [];
-        for (const prefix of current) {
-          for (const item of expanded) newResults.push(prefix + item);
-        }
+        for (const prefix of current) {}
         stack[stack.length - 1] = newResults;
         i = range.end + 1;
killedBy: All tests
statusReason: ✔ expand comma-separated (1.05375ms)

✖ expand numeric range (0.735875ms)

✖ expand alpha range (0.208625ms)

✖ expand with step (0.325042ms)
✖ expand descending (0.170416ms)

[Killed] ArithmeticOperator
packages/braces/src/index.js:20:56
         const expanded = expandRange(range.body);
         const newResults = [];
         for (const prefix of current) {
-          for (const item of expanded) newResults.push(prefix + item);
+          for (const item of expanded) newResults.push(prefix - item);
         }
         stack[stack.length - 1] = newResults;
killedBy: All tests
statusReason: ✔ expand comma-separated (1.025833ms)

✖ expand numeric range (0.750791ms)

✖ expand alpha range (0.629833ms)

✖ expand with step (0.280209ms)

[Survived] ArithmeticOperator
packages/braces/src/index.js:22:15
         for (const prefix of current) {
           for (const item of expanded) newResults.push(prefix + item);
         }
-        stack[stack.length - 1] = newResults;
+        stack[stack.length + 1] = newResults;
         i = range.end + 1;
         continue;

[Killed] ArithmeticOperator
packages/braces/src/index.js:23:13
           for (const item of expanded) newResults.push(prefix + item);
         }
         stack[stack.length - 1] = newResults;
-        i = range.end + 1;
+        i = range.end - 1;
         continue;
       }
killedBy: All tests
statusReason: ✔ expand comma-separated (1.184791ms)

✖ expand numeric range (0.845917ms)

✖ expand alpha range (0.739875ms)

✖ expand with step (0.260042ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:27:11
         continue;
       }
       const items = parseBraces(pattern, i);
-      if (items) {
+      if (false) {
         const current = stack[stack.length - 1];
         const newResults = [];
killedBy: All tests
statusReason: ✖ expand comma-separated (1.583833ms)

✔ expand numeric range (0.359583ms)

✔ expand alpha range (0.128625ms)

✔ expand with step (0.594583ms)

[Killed] BlockStatement
packages/braces/src/index.js:27:18
         continue;
       }
       const items = parseBraces(pattern, i);
-      if (items) {
-        const current = stack[stack.length - 1];
-        const newResults = [];
-        for (const prefix of current) {
-          for (const item of items.parts) newResults.push(prefix + item);
-        }
-        stack[stack.length - 1] = newResults;
-        i = items.end + 1;
-        continue;
-      }
+      if (items) {}
     }
     const current = stack[stack.length - 1];
killedBy: All tests
statusReason: ✖ expand comma-separated (1.695542ms)

✔ expand numeric range (0.376041ms)

✔ expand alpha range (0.130792ms)

✔ expand with step (0.49425ms)

[Killed] ArithmeticOperator
packages/braces/src/index.js:28:31
       }
       const items = parseBraces(pattern, i);
       if (items) {
-        const current = stack[stack.length - 1];
+        const current = stack[stack.length + 1];
         const newResults = [];
         for (const prefix of current) {
killedBy: All tests
statusReason: ✖ expand comma-separated (1.051416ms)

✔ expand numeric range (0.56725ms)
✔ expand alpha range (0.138458ms)

✔ expand with step (0.494791ms)

✔ expand descending (0.092958ms)

[Killed] ArrayDeclaration
packages/braces/src/index.js:29:28
       const items = parseBraces(pattern, i);
       if (items) {
         const current = stack[stack.length - 1];
-        const newResults = [];
+        const newResults = ["Stryker was here"];
         for (const prefix of current) {
           for (const item of items.parts) newResults.push(prefix + item);
killedBy: All tests
statusReason: ✖ expand comma-separated (1.599709ms)

✔ expand numeric range (0.332708ms)

✔ expand alpha range (0.135083ms)

✔ expand with step (0.597ms)

[Killed] BlockStatement
packages/braces/src/index.js:30:39
       if (items) {
         const current = stack[stack.length - 1];
         const newResults = [];
-        for (const prefix of current) {
-          for (const item of items.parts) newResults.push(prefix + item);
-        }
+        for (const prefix of current) {}
         stack[stack.length - 1] = newResults;
         i = items.end + 1;
killedBy: All tests
statusReason: ✖ expand comma-separated (1.453958ms)

✔ expand numeric range (0.322708ms)

✔ expand alpha range (0.128916ms)

✔ expand with step (0.521167ms)

[Killed] ArithmeticOperator
packages/braces/src/index.js:31:59
         const current = stack[stack.length - 1];
         const newResults = [];
         for (const prefix of current) {
-          for (const item of items.parts) newResults.push(prefix + item);
+          for (const item of items.parts) newResults.push(prefix - item);
         }
         stack[stack.length - 1] = newResults;
killedBy: All tests
statusReason: ✖ expand comma-separated (1.636792ms)

✔ expand numeric range (0.2815ms)

✔ expand alpha range (0.127958ms)

✔ expand with step (0.612667ms)
✔ expand descending (0.091792ms)

[Killed] ArithmeticOperator
packages/braces/src/index.js:34:13
           for (const item of items.parts) newResults.push(prefix + item);
         }
         stack[stack.length - 1] = newResults;
-        i = items.end + 1;
+        i = items.end - 1;
         continue;
       }
killedBy: All tests
statusReason: ✖ expand comma-separated (1.545625ms)

✔ expand numeric range (0.273458ms)

✔ expand alpha range (0.137125ms)

✔ expand with step (0.453292ms)

[Killed] ArithmeticOperator
packages/braces/src/index.js:38:27
         continue;
       }
     }
-    const current = stack[stack.length - 1];
+    const current = stack[stack.length + 1];
     for (let j = 0; j < current.length; j++) current[j] += pattern[i];
     i++;
killedBy: All tests
statusReason: ✖ expand comma-separated (0.646334ms)
✔ expand numeric range (0.620417ms)

✔ expand alpha range (0.151208ms)
✔ expand with step (0.145708ms)

✔ expand descending (0.597125ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:39:21
       }
     }
     const current = stack[stack.length - 1];
-    for (let j = 0; j < current.length; j++) current[j] += pattern[i];
+    for (let j = 0; false; j++) current[j] += pattern[i];
     i++;
   }
killedBy: All tests
statusReason: ✖ expand comma-separated (1.635667ms)

✔ expand numeric range (0.314292ms)

✔ expand alpha range (0.171667ms)

✔ expand with step (0.607ms)

[Killed] AssignmentOperator
packages/braces/src/index.js:39:46
       }
     }
     const current = stack[stack.length - 1];
-    for (let j = 0; j < current.length; j++) current[j] += pattern[i];
+    for (let j = 0; j < current.length; j++) current[j] -= pattern[i];
     i++;
   }
killedBy: All tests
statusReason: ✖ expand comma-separated (1.743583ms)

✔ expand numeric range (0.286083ms)
✔ expand alpha range (0.139416ms)

✔ expand with step (0.704958ms)

✔ expand descending (0.102833ms)

[Timeout] UpdateOperator
packages/braces/src/index.js:40:5
     }
     const current = stack[stack.length - 1];
     for (let j = 0; j < current.length; j++) current[j] += pattern[i];
-    i++;
+    i--;
   }
 

[Killed] ArithmeticOperator
packages/braces/src/index.js:43:16
     i++;
   }
 
-  return stack[stack.length - 1];
+  return stack[stack.length + 1];
 }
 
killedBy: All tests
statusReason: ✖ expand comma-separated (1.431625ms)

✖ expand numeric range (0.312625ms)

✖ expand alpha range (0.596333ms)

✖ expand with step (0.219875ms)

[Killed] BlockStatement
packages/braces/src/index.js:46:35
   return stack[stack.length - 1];
 }
 
-function tryRange(pattern, start) {
-  let depth = 0;
-  let i = start;
-  for (; i < pattern.length; i++) {
-    if (pattern[i] === "{") depth++;
-    else if (pattern[i] === "}") {
-      depth--;
-      if (depth === 0) break;
-    }
-  }
-  if (depth !== 0) return null;
-  const body = pattern.slice(start + 1, i);
-  if (/^-?\w+\.\.-?\w+(\.\.\d+)?$/.test(body)) return { body, end: i };
-  return null;
-}
+function tryRange(pattern, start) {}
 
 function expandRange(body) {
killedBy: All tests
statusReason: ✔ expand comma-separated (1.084291ms)

✖ expand numeric range (0.738041ms)

✖ expand alpha range (0.215416ms)

✖ expand with step (0.185334ms)

[Killed] BlockStatement
packages/braces/src/index.js:49:35
 function tryRange(pattern, start) {
   let depth = 0;
   let i = start;
-  for (; i < pattern.length; i++) {
-    if (pattern[i] === "{") depth++;
-    else if (pattern[i] === "}") {
-      depth--;
-      if (depth === 0) break;
-    }
-  }
+  for (; i < pattern.length; i++) {}
   if (depth !== 0) return null;
   const body = pattern.slice(start + 1, i);
killedBy: All tests
statusReason: ✔ expand comma-separated (1.156833ms)

✖ expand numeric range (0.839ms)
✖ expand alpha range (0.794625ms)
✖ expand with step (0.328708ms)
✖ expand descending (0.152167ms)
✔ nested braces (0.126417ms)
✔ compile mode (default) (0.341334ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:49:10
 function tryRange(pattern, start) {
   let depth = 0;
   let i = start;
-  for (; i < pattern.length; i++) {
+  for (; false; i++) {
     if (pattern[i] === "{") depth++;
     else if (pattern[i] === "}") {
killedBy: All tests
statusReason: ✔ expand comma-separated (1.089208ms)

✖ expand numeric range (0.892125ms)

✖ expand alpha range (0.261417ms)

✖ expand with step (0.2245ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:50:9
   let depth = 0;
   let i = start;
   for (; i < pattern.length; i++) {
-    if (pattern[i] === "{") depth++;
+    if (false) depth++;
     else if (pattern[i] === "}") {
       depth--;
killedBy: All tests
statusReason: ✔ expand comma-separated (1.165333ms)

✖ expand numeric range (0.749666ms)

✖ expand alpha range (0.56425ms)
✖ expand with step (0.212542ms)

✖ expand descending (0.129ms)

[Killed] EqualityOperator
packages/braces/src/index.js:50:9
   let depth = 0;
   let i = start;
   for (; i < pattern.length; i++) {
-    if (pattern[i] === "{") depth++;
+    if (pattern[i] !== "{") depth++;
     else if (pattern[i] === "}") {
       depth--;
killedBy: All tests
statusReason: ✔ expand comma-separated (1.064917ms)

✖ expand numeric range (0.669667ms)

✖ expand alpha range (0.677875ms)

✖ expand with step (0.243375ms)

[Killed] EqualityOperator
packages/braces/src/index.js:51:14
   let i = start;
   for (; i < pattern.length; i++) {
     if (pattern[i] === "{") depth++;
-    else if (pattern[i] === "}") {
+    else if (pattern[i] !== "}") {
       depth--;
       if (depth === 0) break;
killedBy: All tests
statusReason: ✔ expand comma-separated (1.072542ms)

✖ expand numeric range (0.66975ms)

✖ expand alpha range (0.621416ms)

✖ expand with step (0.205084ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:51:14
   let i = start;
   for (; i < pattern.length; i++) {
     if (pattern[i] === "{") depth++;
-    else if (pattern[i] === "}") {
+    else if (true) {
       depth--;
       if (depth === 0) break;
killedBy: All tests
statusReason: ✔ expand comma-separated (1.0575ms)

✖ expand numeric range (0.67275ms)

✖ expand alpha range (0.597792ms)

✖ expand with step (0.172541ms)

[Killed] UpdateOperator
packages/braces/src/index.js:52:7
   for (; i < pattern.length; i++) {
     if (pattern[i] === "{") depth++;
     else if (pattern[i] === "}") {
-      depth--;
+      depth++;
       if (depth === 0) break;
     }
killedBy: All tests
statusReason: ✔ expand comma-separated (1.044917ms)

✖ expand numeric range (0.699958ms)

✖ expand alpha range (0.535666ms)

✖ expand with step (0.193292ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:53:11
     if (pattern[i] === "{") depth++;
     else if (pattern[i] === "}") {
       depth--;
-      if (depth === 0) break;
+      if (false) break;
     }
   }
killedBy: All tests
statusReason: ✔ expand comma-separated (1.086708ms)

✖ expand numeric range (0.740167ms)

✖ expand alpha range (0.602291ms)

✖ expand with step (0.238333ms)

[Killed] EqualityOperator
packages/braces/src/index.js:53:11
     if (pattern[i] === "{") depth++;
     else if (pattern[i] === "}") {
       depth--;
-      if (depth === 0) break;
+      if (depth !== 0) break;
     }
   }
killedBy: All tests
statusReason: ✔ expand comma-separated (1.219667ms)

✖ expand numeric range (0.784ms)

✖ expand alpha range (0.613041ms)

✖ expand with step (0.227375ms)

[Killed] EqualityOperator
packages/braces/src/index.js:56:7
       if (depth === 0) break;
     }
   }
-  if (depth !== 0) return null;
+  if (depth === 0) return null;
   const body = pattern.slice(start + 1, i);
   if (/^-?\w+\.\.-?\w+(\.\.\d+)?$/.test(body)) return { body, end: i };
killedBy: All tests
statusReason: ✔ expand comma-separated (1.031208ms)

✖ expand numeric range (0.6615ms)

✖ expand alpha range (0.643584ms)

✖ expand with step (0.167542ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:56:7
       if (depth === 0) break;
     }
   }
-  if (depth !== 0) return null;
+  if (true) return null;
   const body = pattern.slice(start + 1, i);
   if (/^-?\w+\.\.-?\w+(\.\.\d+)?$/.test(body)) return { body, end: i };
killedBy: All tests
statusReason: ✔ expand comma-separated (1.234084ms)

✖ expand numeric range (0.7135ms)

✖ expand alpha range (0.577791ms)

✖ expand with step (0.161792ms)

[Killed] MethodExpression
packages/braces/src/index.js:57:16
     }
   }
   if (depth !== 0) return null;
-  const body = pattern.slice(start + 1, i);
+  const body = pattern;
   if (/^-?\w+\.\.-?\w+(\.\.\d+)?$/.test(body)) return { body, end: i };
   return null;
killedBy: All tests
statusReason: ✔ expand comma-separated (1.12125ms)

✖ expand numeric range (0.797042ms)

✖ expand alpha range (0.636167ms)

✖ expand with step (0.20975ms)

[Killed] ArithmeticOperator
packages/braces/src/index.js:57:30
     }
   }
   if (depth !== 0) return null;
-  const body = pattern.slice(start + 1, i);
+  const body = pattern.slice(start - 1, i);
   if (/^-?\w+\.\.-?\w+(\.\.\d+)?$/.test(body)) return { body, end: i };
   return null;
killedBy: All tests
statusReason: ✔ expand comma-separated (1.041292ms)

✖ expand numeric range (0.813625ms)

✖ expand alpha range (0.534708ms)

✖ expand with step (0.183583ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:58:7
   }
   if (depth !== 0) return null;
   const body = pattern.slice(start + 1, i);
-  if (/^-?\w+\.\.-?\w+(\.\.\d+)?$/.test(body)) return { body, end: i };
+  if (false) return { body, end: i };
   return null;
 }
killedBy: All tests
statusReason: ✔ expand comma-separated (1.072958ms)

✖ expand numeric range (0.690875ms)

✖ expand alpha range (0.592458ms)

✖ expand with step (0.185625ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:58:7
   }
   if (depth !== 0) return null;
   const body = pattern.slice(start + 1, i);
-  if (/^-?\w+\.\.-?\w+(\.\.\d+)?$/.test(body)) return { body, end: i };
+  if (true) return { body, end: i };
   return null;
 }
killedBy: All tests
statusReason: ✖ expand comma-separated (0.851791ms)
✔ expand numeric range (0.458ms)

✔ expand alpha range (0.123792ms)
✔ expand with step (0.147875ms)

✔ expand descending (0.144125ms)

[Killed] StringLiteral
packages/braces/src/index.js:63:28
 }
 
 function expandRange(body) {
-  const parts = body.split("..");
+  const parts = body.split("");
   const start = parts[0];
   const end = parts[1];
killedBy: All tests
statusReason: ✔ expand comma-separated (1.066291ms)

✖ expand numeric range (0.761958ms)

✖ expand alpha range (0.2115ms)

✖ expand with step (0.236041ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:67:7
   const start = parts[0];
   const end = parts[1];
   const step = parts[2] ? Number(parts[2]) : 1;
-  if (/^\d+$/.test(start) || /^-\d+$/.test(start)) {
+  if (true) {
     const a = Number(start);
     const b = Number(end);
killedBy: All tests
statusReason: ✔ expand comma-separated (1.127916ms)

✔ expand numeric range (0.257625ms)

✖ expand alpha range (0.811292ms)

✔ expand with step (0.479625ms)

[Survived] BlockStatement
packages/braces/src/index.js:67:52
   const start = parts[0];
   const end = parts[1];
   const step = parts[2] ? Number(parts[2]) : 1;
-  if (/^\d+$/.test(start) || /^-\d+$/.test(start)) {
-    const a = Number(start);
-    const b = Number(end);
-    const results = [];
-    const pad = /^0\d/.test(start) ? Math.max(start.length, end.length) : 0;
-    if (a <= b) {
-      for (let i = a; i <= b; i += step) results.push(padN(i, pad));
-    } else {
-      for (let i = a; i >= b; i -= step) results.push(padN(i, pad));
-    }
-    return results;
-  }
+  if (/^\d+$/.test(start) || /^-\d+$/.test(start)) {}
   const a = start.charCodeAt(0);
   const b = end.charCodeAt(0);

[Killed] ArrayDeclaration
packages/braces/src/index.js:70:21
   if (/^\d+$/.test(start) || /^-\d+$/.test(start)) {
     const a = Number(start);
     const b = Number(end);
-    const results = [];
+    const results = ["Stryker was here"];
     const pad = /^0\d/.test(start) ? Math.max(start.length, end.length) : 0;
     if (a <= b) {
killedBy: All tests
statusReason: ✔ expand comma-separated (1.073959ms)

✖ expand numeric range (0.739958ms)

✔ expand alpha range (0.138791ms)

✖ expand with step (0.684709ms)

[Survived] MethodExpression
packages/braces/src/index.js:71:38
     const a = Number(start);
     const b = Number(end);
     const results = [];
-    const pad = /^0\d/.test(start) ? Math.max(start.length, end.length) : 0;
+    const pad = /^0\d/.test(start) ? Math.min(start.length, end.length) : 0;
     if (a <= b) {
       for (let i = a; i <= b; i += step) results.push(padN(i, pad));

[Survived] Regex
packages/braces/src/index.js:71:17
     const a = Number(start);
     const b = Number(end);
     const results = [];
-    const pad = /^0\d/.test(start) ? Math.max(start.length, end.length) : 0;
+    const pad = /0\d/.test(start) ? Math.max(start.length, end.length) : 0;
     if (a <= b) {
       for (let i = a; i <= b; i += step) results.push(padN(i, pad));

[Killed] ConditionalExpression
packages/braces/src/index.js:72:9
     const b = Number(end);
     const results = [];
     const pad = /^0\d/.test(start) ? Math.max(start.length, end.length) : 0;
-    if (a <= b) {
+    if (false) {
       for (let i = a; i <= b; i += step) results.push(padN(i, pad));
     } else {
killedBy: All tests
statusReason: ✔ expand comma-separated (1.109542ms)

✖ expand numeric range (0.730875ms)

✔ expand alpha range (0.150416ms)

✖ expand with step (0.688791ms)

[Killed] BlockStatement
packages/braces/src/index.js:72:17
     const b = Number(end);
     const results = [];
     const pad = /^0\d/.test(start) ? Math.max(start.length, end.length) : 0;
-    if (a <= b) {
-      for (let i = a; i <= b; i += step) results.push(padN(i, pad));
-    } else {
+    if (a <= b) {} else {
       for (let i = a; i >= b; i -= step) results.push(padN(i, pad));
     }
killedBy: All tests
statusReason: ✔ expand comma-separated (1.132167ms)

✖ expand numeric range (0.719ms)
✔ expand alpha range (0.147041ms)

✖ expand with step (0.748791ms)

✔ expand descending (0.144666ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:73:23
     const results = [];
     const pad = /^0\d/.test(start) ? Math.max(start.length, end.length) : 0;
     if (a <= b) {
-      for (let i = a; i <= b; i += step) results.push(padN(i, pad));
+      for (let i = a; false; i += step) results.push(padN(i, pad));
     } else {
       for (let i = a; i >= b; i -= step) results.push(padN(i, pad));
killedBy: All tests
statusReason: ✔ expand comma-separated (1.111917ms)

✖ expand numeric range (0.943584ms)

✔ expand alpha range (0.175916ms)

✖ expand with step (0.688084ms)

[Killed] EqualityOperator
packages/braces/src/index.js:73:23
     const results = [];
     const pad = /^0\d/.test(start) ? Math.max(start.length, end.length) : 0;
     if (a <= b) {
-      for (let i = a; i <= b; i += step) results.push(padN(i, pad));
+      for (let i = a; i < b; i += step) results.push(padN(i, pad));
     } else {
       for (let i = a; i >= b; i -= step) results.push(padN(i, pad));
killedBy: All tests
statusReason: ✔ expand comma-separated (1.052ms)

✖ expand numeric range (0.743375ms)

✔ expand alpha range (0.131709ms)

✖ expand with step (0.764708ms)

[Killed] BlockStatement
packages/braces/src/index.js:74:12
     const pad = /^0\d/.test(start) ? Math.max(start.length, end.length) : 0;
     if (a <= b) {
       for (let i = a; i <= b; i += step) results.push(padN(i, pad));
-    } else {
-      for (let i = a; i >= b; i -= step) results.push(padN(i, pad));
-    }
+    } else {}
     return results;
   }
killedBy: All tests
statusReason: ✔ expand comma-separated (1.048166ms)

✔ expand numeric range (0.234666ms)
✔ expand alpha range (0.133208ms)

✔ expand with step (0.516375ms)

✖ expand descending (0.65625ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:75:23
     if (a <= b) {
       for (let i = a; i <= b; i += step) results.push(padN(i, pad));
     } else {
-      for (let i = a; i >= b; i -= step) results.push(padN(i, pad));
+      for (let i = a; false; i -= step) results.push(padN(i, pad));
     }
     return results;
killedBy: All tests
statusReason: ✔ expand comma-separated (1.066583ms)

✔ expand numeric range (0.245708ms)
✔ expand alpha range (0.14925ms)

✔ expand with step (0.572417ms)

✖ expand descending (0.591334ms)

[Killed] EqualityOperator
packages/braces/src/index.js:75:23
     if (a <= b) {
       for (let i = a; i <= b; i += step) results.push(padN(i, pad));
     } else {
-      for (let i = a; i >= b; i -= step) results.push(padN(i, pad));
+      for (let i = a; i > b; i -= step) results.push(padN(i, pad));
     }
     return results;
killedBy: All tests
statusReason: ✔ expand comma-separated (1.13125ms)

✔ expand numeric range (0.287833ms)
✔ expand alpha range (0.150375ms)

✔ expand with step (0.616208ms)

✖ expand descending (0.74275ms)

[Killed] ArrayDeclaration
packages/braces/src/index.js:81:19
   }
   const a = start.charCodeAt(0);
   const b = end.charCodeAt(0);
-  const results = [];
+  const results = ["Stryker was here"];
   if (a <= b) {
     for (let i = a; i <= b; i += step) results.push(String.fromCharCode(i));
killedBy: All tests
statusReason: ✔ expand comma-separated (1.160125ms)
✔ expand numeric range (0.271667ms)

✖ expand alpha range (0.745459ms)
✔ expand with step (0.4685ms)
✔ expand descending (0.07425ms)
✔ nested braces (0.115333ms)
✔ compile mode (default) (0.188209ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:82:7
   const a = start.charCodeAt(0);
   const b = end.charCodeAt(0);
   const results = [];
-  if (a <= b) {
+  if (false) {
     for (let i = a; i <= b; i += step) results.push(String.fromCharCode(i));
   } else {
killedBy: All tests
statusReason: ✔ expand comma-separated (1.08425ms)
✔ expand numeric range (0.252916ms)

✖ expand alpha range (0.694333ms)
✔ expand with step (0.529625ms)

✔ expand descending (0.084875ms)

[Killed] EqualityOperator
packages/braces/src/index.js:82:7
   const a = start.charCodeAt(0);
   const b = end.charCodeAt(0);
   const results = [];
-  if (a <= b) {
+  if (a > b) {
     for (let i = a; i <= b; i += step) results.push(String.fromCharCode(i));
   } else {
killedBy: All tests
statusReason: ✔ expand comma-separated (1.115583ms)

✔ expand numeric range (0.248583ms)

✖ expand alpha range (0.670833ms)

✔ expand with step (0.494875ms)
✔ expand descending (0.081792ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:83:21
   const b = end.charCodeAt(0);
   const results = [];
   if (a <= b) {
-    for (let i = a; i <= b; i += step) results.push(String.fromCharCode(i));
+    for (let i = a; false; i += step) results.push(String.fromCharCode(i));
   } else {
     for (let i = a; i >= b; i -= step) results.push(String.fromCharCode(i));
killedBy: All tests
statusReason: ✔ expand comma-separated (1.101208ms)
✔ expand numeric range (0.254542ms)

✖ expand alpha range (0.692208ms)

✔ expand with step (0.6395ms)
✔ expand descending (0.114542ms)
✔ nested braces (0.125792ms)
