[Killed] EqualityOperator
packages/braces/src/index.js:83:21
   const b = end.charCodeAt(0);
   const results = [];
   if (a <= b) {
-    for (let i = a; i <= b; i += step) results.push(String.fromCharCode(i));
+    for (let i = a; i > b; i += step) results.push(String.fromCharCode(i));
   } else {
     for (let i = a; i >= b; i -= step) results.push(String.fromCharCode(i));
killedBy: All tests
statusReason: ✔ expand comma-separated (1.285625ms)

✔ expand numeric range (0.276458ms)

✖ expand alpha range (0.72ms)
✔ expand with step (0.686667ms)

✔ expand descending (0.101667ms)

[Survived] BlockStatement
packages/braces/src/index.js:84:10
   const results = [];
   if (a <= b) {
     for (let i = a; i <= b; i += step) results.push(String.fromCharCode(i));
-  } else {
-    for (let i = a; i >= b; i -= step) results.push(String.fromCharCode(i));
-  }
+  } else {}
   return results;
 }

[Survived] AssignmentOperator
packages/braces/src/index.js:85:29
   if (a <= b) {
     for (let i = a; i <= b; i += step) results.push(String.fromCharCode(i));
   } else {
-    for (let i = a; i >= b; i -= step) results.push(String.fromCharCode(i));
+    for (let i = a; i >= b; i += step) results.push(String.fromCharCode(i));
   }
   return results;

[Survived] ConditionalExpression
packages/braces/src/index.js:85:21
   if (a <= b) {
     for (let i = a; i <= b; i += step) results.push(String.fromCharCode(i));
   } else {
-    for (let i = a; i >= b; i -= step) results.push(String.fromCharCode(i));
+    for (let i = a; false; i -= step) results.push(String.fromCharCode(i));
   }
   return results;

[Killed] BlockStatement
packages/braces/src/index.js:90:25
   return results;
 }
 
-function padN(n, width) {
-  if (!width) return String(n);
-  return String(n).padStart(width, "0");
-}
+function padN(n, width) {}
 
 function parseBraces(pattern, start) {
killedBy: All tests
statusReason: ✔ expand comma-separated (1.138292ms)

✖ expand numeric range (0.978583ms)

✔ expand alpha range (0.151583ms)

✖ expand with step (0.804125ms)

[Survived] ConditionalExpression
packages/braces/src/index.js:91:7
 }
 
 function padN(n, width) {
-  if (!width) return String(n);
+  if (false) return String(n);
   return String(n).padStart(width, "0");
 }

[Survived] ConditionalExpression
packages/braces/src/index.js:91:7
 }
 
 function padN(n, width) {
-  if (!width) return String(n);
+  if (true) return String(n);
   return String(n).padStart(width, "0");
 }

[Survived] StringLiteral
packages/braces/src/index.js:92:36
 
 function padN(n, width) {
   if (!width) return String(n);
-  return String(n).padStart(width, "0");
+  return String(n).padStart(width, "");
 }
 

[Killed] BlockStatement
packages/braces/src/index.js:95:38
   return String(n).padStart(width, "0");
 }
 
-function parseBraces(pattern, start) {
-  let depth = 0;
-  let i = start;
-  for (; i < pattern.length; i++) {
-    if (pattern[i] === "{") depth++;
-    else if (pattern[i] === "}") {
-      depth--;
-      if (depth === 0) break;
-    }
-  }
-  if (depth !== 0) return null;
-  const body = pattern.slice(start + 1, i);
-  if (!body.includes(",")) return null;
-  return { parts: splitTop(body), end: i };
-}
+function parseBraces(pattern, start) {}
 
 function splitTop(str) {
killedBy: All tests
statusReason: ✖ expand comma-separated (1.458708ms)
✔ expand numeric range (0.34325ms)

✔ expand alpha range (0.132667ms)
✔ expand with step (0.606375ms)
✔ expand descending (0.129166ms)
✖ nested braces (0.271875ms)

[Killed] EqualityOperator
packages/braces/src/index.js:98:10
 function parseBraces(pattern, start) {
   let depth = 0;
   let i = start;
-  for (; i < pattern.length; i++) {
+  for (; i >= pattern.length; i++) {
     if (pattern[i] === "{") depth++;
     else if (pattern[i] === "}") {
killedBy: All tests
statusReason: ✖ expand comma-separated (1.43725ms)

✔ expand numeric range (0.350458ms)

✔ expand alpha range (0.125042ms)

✔ expand with step (0.543375ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:99:9
   let depth = 0;
   let i = start;
   for (; i < pattern.length; i++) {
-    if (pattern[i] === "{") depth++;
+    if (true) depth++;
     else if (pattern[i] === "}") {
       depth--;
killedBy: All tests
statusReason: ✖ expand comma-separated (1.440958ms)
✔ expand numeric range (0.351542ms)

✔ expand alpha range (0.139042ms)

✔ expand with step (0.603042ms)

✔ expand descending (0.096416ms)

[Killed] BlockStatement
packages/braces/src/index.js:100:34
   let i = start;
   for (; i < pattern.length; i++) {
     if (pattern[i] === "{") depth++;
-    else if (pattern[i] === "}") {
-      depth--;
-      if (depth === 0) break;
-    }
+    else if (pattern[i] === "}") {}
   }
   if (depth !== 0) return null;
killedBy: All tests
statusReason: ✖ expand comma-separated (1.519167ms)

✔ expand numeric range (0.360208ms)

✔ expand alpha range (0.1285ms)

✔ expand with step (0.514667ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:100:14
   let i = start;
   for (; i < pattern.length; i++) {
     if (pattern[i] === "{") depth++;
-    else if (pattern[i] === "}") {
+    else if (false) {
       depth--;
       if (depth === 0) break;
killedBy: All tests
statusReason: ✖ expand comma-separated (1.439042ms)

✔ expand numeric range (0.352ms)

✔ expand alpha range (0.138375ms)

✔ expand with step (0.455625ms)

[Killed] BooleanLiteral
packages/braces/src/index.js:107:7
   }
   if (depth !== 0) return null;
   const body = pattern.slice(start + 1, i);
-  if (!body.includes(",")) return null;
+  if (body.includes(",")) return null;
   return { parts: splitTop(body), end: i };
 }
killedBy: All tests
statusReason: ✖ expand comma-separated (1.538458ms)

✔ expand numeric range (0.371625ms)

✔ expand alpha range (0.125583ms)

✔ expand with step (0.491875ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:107:7
   }
   if (depth !== 0) return null;
   const body = pattern.slice(start + 1, i);
-  if (!body.includes(",")) return null;
+  if (true) return null;
   return { parts: splitTop(body), end: i };
 }
killedBy: All tests
statusReason: ✖ expand comma-separated (1.443542ms)
✔ expand numeric range (0.338875ms)

✔ expand alpha range (0.121959ms)

✔ expand with step (0.490167ms)

✔ expand descending (0.083459ms)

[Killed] BlockStatement
packages/braces/src/index.js:111:24
   return { parts: splitTop(body), end: i };
 }
 
-function splitTop(str) {
-  const parts = [];
-  let depth = 0;
-  let current = "";
-  for (const ch of str) {
-    if (ch === "{") depth++;
-    else if (ch === "}") depth--;
-    if (ch === "," && depth === 0) {
-      parts.push(current);
-      current = "";
-    } else current += ch;
-  }
-  parts.push(current);
-  // Recursively expand nested braces
-  const results = [];
-  for (const part of parts) {
-    if (part.includes("{")) results.push(...expand(part));
-    else results.push(part);
-  }
-  return results;
-}
+function splitTop(str) {}
 
 function compile(pattern) {
killedBy: All tests
statusReason: ✖ expand comma-separated (0.903459ms)

✔ expand numeric range (0.536292ms)
✔ expand alpha range (0.125208ms)

✔ expand with step (0.527333ms)

✔ expand descending (0.137333ms)

[Killed] ArrayDeclaration
packages/braces/src/index.js:112:17
 }
 
 function splitTop(str) {
-  const parts = [];
+  const parts = ["Stryker was here"];
   let depth = 0;
   let current = "";
killedBy: All tests
statusReason: ✖ expand comma-separated (1.496667ms)

✔ expand numeric range (0.333916ms)

✔ expand alpha range (0.292375ms)

✔ expand with step (0.590792ms)

[Killed] BlockStatement
packages/braces/src/index.js:115:25
   const parts = [];
   let depth = 0;
   let current = "";
-  for (const ch of str) {
-    if (ch === "{") depth++;
-    else if (ch === "}") depth--;
-    if (ch === "," && depth === 0) {
-      parts.push(current);
-      current = "";
-    } else current += ch;
-  }
+  for (const ch of str) {}
   parts.push(current);
   // Recursively expand nested braces
killedBy: All tests
statusReason: ✖ expand comma-separated (1.571459ms)

✔ expand numeric range (0.390084ms)

✔ expand alpha range (0.137375ms)

✔ expand with step (0.669042ms)

[Killed] EqualityOperator
packages/braces/src/index.js:116:9
   let depth = 0;
   let current = "";
   for (const ch of str) {
-    if (ch === "{") depth++;
+    if (ch !== "{") depth++;
     else if (ch === "}") depth--;
     if (ch === "," && depth === 0) {
killedBy: All tests
statusReason: ✖ expand comma-separated (1.4755ms)

✔ expand numeric range (0.338625ms)

✔ expand alpha range (0.14375ms)

✔ expand with step (0.579959ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:116:9
   let depth = 0;
   let current = "";
   for (const ch of str) {
-    if (ch === "{") depth++;
+    if (true) depth++;
     else if (ch === "}") depth--;
     if (ch === "," && depth === 0) {
killedBy: All tests
statusReason: ✖ expand comma-separated (1.9805ms)

✔ expand numeric range (0.385292ms)
✔ expand alpha range (0.145375ms)

✔ expand with step (0.801791ms)
✔ expand descending (0.176417ms)

[Killed] EqualityOperator
packages/braces/src/index.js:117:14
   let current = "";
   for (const ch of str) {
     if (ch === "{") depth++;
-    else if (ch === "}") depth--;
+    else if (ch !== "}") depth--;
     if (ch === "," && depth === 0) {
       parts.push(current);
killedBy: All tests
statusReason: ✖ expand comma-separated (1.421834ms)

✔ expand numeric range (0.321458ms)

✔ expand alpha range (0.1265ms)

✔ expand with step (0.689291ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:117:14
   let current = "";
   for (const ch of str) {
     if (ch === "{") depth++;
-    else if (ch === "}") depth--;
+    else if (true) depth--;
     if (ch === "," && depth === 0) {
       parts.push(current);
killedBy: All tests
statusReason: ✖ expand comma-separated (1.529417ms)

✔ expand numeric range (0.359417ms)

✔ expand alpha range (0.136625ms)

✔ expand with step (0.64375ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:118:9
   for (const ch of str) {
     if (ch === "{") depth++;
     else if (ch === "}") depth--;
-    if (ch === "," && depth === 0) {
+    if (false) {
       parts.push(current);
       current = "";
killedBy: All tests
statusReason: ✖ expand comma-separated (1.527375ms)
✔ expand numeric range (0.337ms)

✔ expand alpha range (0.132917ms)

✔ expand with step (0.712583ms)

✔ expand descending (0.113917ms)

[Killed] EqualityOperator
packages/braces/src/index.js:118:9
   for (const ch of str) {
     if (ch === "{") depth++;
     else if (ch === "}") depth--;
-    if (ch === "," && depth === 0) {
+    if (ch !== "," && depth === 0) {
       parts.push(current);
       current = "";
killedBy: All tests
statusReason: ✖ expand comma-separated (1.508375ms)

✔ expand numeric range (0.338167ms)

✔ expand alpha range (0.12525ms)

✔ expand with step (0.59975ms)

[Killed] AssignmentOperator
packages/braces/src/index.js:121:12
     if (ch === "," && depth === 0) {
       parts.push(current);
       current = "";
-    } else current += ch;
+    } else current -= ch;
   }
   parts.push(current);
killedBy: All tests
statusReason: ✖ expand comma-separated (0.887375ms)

✔ expand numeric range (0.588666ms)
✔ expand alpha range (0.138625ms)

✔ expand with step (0.665666ms)

✔ expand descending (0.1865ms)

[Killed] ArrayDeclaration
packages/braces/src/index.js:125:19
   }
   parts.push(current);
   // Recursively expand nested braces
-  const results = [];
+  const results = ["Stryker was here"];
   for (const part of parts) {
     if (part.includes("{")) results.push(...expand(part));
killedBy: All tests
statusReason: ✖ expand comma-separated (1.483333ms)

✔ expand numeric range (0.332166ms)

✔ expand alpha range (0.143209ms)

✔ expand with step (0.677917ms)

[Killed] BlockStatement
packages/braces/src/index.js:126:29
   parts.push(current);
   // Recursively expand nested braces
   const results = [];
-  for (const part of parts) {
-    if (part.includes("{")) results.push(...expand(part));
-    else results.push(part);
-  }
+  for (const part of parts) {}
   return results;
 }
killedBy: All tests
statusReason: ✖ expand comma-separated (1.59ms)
✔ expand numeric range (0.361792ms)

✔ expand alpha range (0.142791ms)

✔ expand with step (0.600833ms)

✔ expand descending (0.099667ms)

[Killed] ConditionalExpression
packages/braces/src/index.js:127:9
   // Recursively expand nested braces
   const results = [];
   for (const part of parts) {
-    if (part.includes("{")) results.push(...expand(part));
+    if (false) results.push(...expand(part));
     else results.push(part);
   }
killedBy: All tests
statusReason: ✔ expand comma-separated (1.067166ms)

✔ expand numeric range (0.237125ms)
✔ expand alpha range (0.128667ms)

✔ expand with step (0.612792ms)

✔ expand descending (0.119916ms)

[Survived] ConditionalExpression
packages/braces/src/index.js:127:9
   // Recursively expand nested braces
   const results = [];
   for (const part of parts) {
-    if (part.includes("{")) results.push(...expand(part));
+    if (true) results.push(...expand(part));
     else results.push(part);
   }

[Killed] BlockStatement
packages/braces/src/index.js:133:27
   return results;
 }
 
-function compile(pattern) {
-  // Return regex-optimized form (non-expanded)
-  return pattern
-    .replace(/\{(-?\w+)\.\.(-?\w+)\}/g, (_, a, b) => `(${a}|${b})`)
-    .replace(/\{([^}]+)\}/g, (_, body) => `(${body.split(",").join("|")})`);
-}
+function compile(pattern) {}
 
 braces.expand = expand;
killedBy: All tests
statusReason: ✔ expand comma-separated (1.050208ms)

✔ expand numeric range (0.236209ms)
✔ expand alpha range (0.13725ms)
✔ expand with step (0.527792ms)

✔ expand descending (0.10275ms)

[Survived] ArrowFunction
packages/braces/src/index.js:136:41
 function compile(pattern) {
   // Return regex-optimized form (non-expanded)
   return pattern
-    .replace(/\{(-?\w+)\.\.(-?\w+)\}/g, (_, a, b) => `(${a}|${b})`)
+    .replace(/\{(-?\w+)\.\.(-?\w+)\}/g, () => undefined)
     .replace(/\{([^}]+)\}/g, (_, body) => `(${body.split(",").join("|")})`);
 }

[Survived] Regex
packages/braces/src/index.js:136:14
 function compile(pattern) {
   // Return regex-optimized form (non-expanded)
   return pattern
-    .replace(/\{(-?\w+)\.\.(-?\w+)\}/g, (_, a, b) => `(${a}|${b})`)
+    .replace(/\{(-?\w+)\.\.(-?\W+)\}/g, (_, a, b) => `(${a}|${b})`)
     .replace(/\{([^}]+)\}/g, (_, body) => `(${body.split(",").join("|")})`);
 }

[Killed] ArrowFunction
packages/braces/src/index.js:137:30
   // Return regex-optimized form (non-expanded)
   return pattern
     .replace(/\{(-?\w+)\.\.(-?\w+)\}/g, (_, a, b) => `(${a}|${b})`)
-    .replace(/\{([^}]+)\}/g, (_, body) => `(${body.split(",").join("|")})`);
+    .replace(/\{([^}]+)\}/g, () => undefined);
 }
 
killedBy: All tests
statusReason: ✔ expand comma-separated (1.157292ms)

✔ expand numeric range (0.248584ms)
✔ expand alpha range (0.135708ms)
✔ expand with step (0.560875ms)
✔ expand descending (0.080375ms)
✔ nested braces (0.1135ms)

[Killed] StringLiteral
packages/braces/src/index.js:137:58
   // Return regex-optimized form (non-expanded)
   return pattern
     .replace(/\{(-?\w+)\.\.(-?\w+)\}/g, (_, a, b) => `(${a}|${b})`)
-    .replace(/\{([^}]+)\}/g, (_, body) => `(${body.split(",").join("|")})`);
+    .replace(/\{([^}]+)\}/g, (_, body) => `(${body.split("").join("|")})`);
 }
 
killedBy: All tests
statusReason: ✔ expand comma-separated (1.096ms)

✔ expand numeric range (0.250458ms)
✔ expand alpha range (0.196166ms)
✔ expand with step (0.557208ms)

✔ expand descending (0.086958ms)
