[Killed] StringLiteral
packages/escape-html/src/index.js:5:13
 const MATCH = /["'&<>]/;
 // Public API
 module.exports = function escapeHtml(str) {
-  const s = `${str}`;
+  const s = ``;
   const match = MATCH.exec(s);
   if (!match) return s;
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.363875ms)

✖ escapes & (0.799792ms)

✖ escapes <> (0.126916ms)

✖ escapes quotes (0.224958ms)

[Killed] BooleanLiteral
packages/escape-html/src/index.js:7:7
 module.exports = function escapeHtml(str) {
   const s = `${str}`;
   const match = MATCH.exec(s);
-  if (!match) return s;
+  if (match) return s;
   let html = "";
   let last = 0;
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.360917ms)

✖ escapes & (0.840333ms)

✖ escapes <> (0.278417ms)

✖ escapes quotes (0.113292ms)

[Killed] ConditionalExpression
packages/escape-html/src/index.js:7:7
 module.exports = function escapeHtml(str) {
   const s = `${str}`;
   const match = MATCH.exec(s);
-  if (!match) return s;
+  if (false) return s;
   let html = "";
   let last = 0;
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.318958ms)

✔ escapes & (0.549125ms)
✔ escapes <> (0.107833ms)
✔ escapes quotes (0.064708ms)
✔ escapes single quotes (0.0595ms)
✖ no-op for safe strings (0.133583ms)
✖ handles empty string (0.453708ms)

[Killed] BlockStatement
packages/escape-html/src/index.js:10:48
   if (!match) return s;
   let html = "";
   let last = 0;
-  for (let i = match.index; i < s.length; i++) {
-    let ch;
-    switch (s.charCodeAt(i)) {
-      case 34:
-        ch = "&quot;";
-        break;
-      case 38:
-        ch = "&amp;";
-        break;
-      case 39:
-        ch = "&#39;";
-        break;
-      case 60:
-        ch = "&lt;";
-        break;
-      case 62:
-        ch = "&gt;";
-        break;
-      default:
-        continue;
-    }
-    if (last !== i) html += s.substring(last, i);
-    html += ch;
-    last = i + 1;
-  }
+  for (let i = match.index; i < s.length; i++) {}
   return last !== s.length ? html + s.substring(last) : html;
 };
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.358584ms)

✖ escapes & (0.900916ms)

✖ escapes <> (0.281291ms)

✖ escapes quotes (0.130417ms)

[Killed] EqualityOperator
packages/escape-html/src/index.js:10:29
   if (!match) return s;
   let html = "";
   let last = 0;
-  for (let i = match.index; i < s.length; i++) {
+  for (let i = match.index; i >= s.length; i++) {
     let ch;
     switch (s.charCodeAt(i)) {
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.334792ms)

✖ escapes & (0.803208ms)

✖ escapes <> (0.267167ms)

✖ escapes quotes (0.105708ms)

[Killed] ConditionalExpression
packages/escape-html/src/index.js:13:7
   for (let i = match.index; i < s.length; i++) {
     let ch;
     switch (s.charCodeAt(i)) {
-      case 34:
-        ch = "&quot;";
-        break;
+      case 34:
       case 38:
         ch = "&amp;";
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.323ms)

✔ escapes & (0.559208ms)

✔ escapes <> (0.117083ms)

✖ escapes quotes (0.643042ms)

[Killed] StringLiteral
packages/escape-html/src/index.js:14:14
     let ch;
     switch (s.charCodeAt(i)) {
       case 34:
-        ch = "&quot;";
+        ch = "";
         break;
       case 38:
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.505416ms)

✔ escapes & (0.509417ms)

✔ escapes <> (0.104791ms)

✖ escapes quotes (0.591708ms)

[Killed] ConditionalExpression
packages/escape-html/src/index.js:16:7
       case 34:
         ch = "&quot;";
         break;
-      case 38:
-        ch = "&amp;";
-        break;
+      case 38:
       case 39:
         ch = "&#39;";
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.32825ms)

✖ escapes & (0.9835ms)

✔ escapes <> (0.112208ms)

✔ escapes quotes (0.068208ms)

[Killed] ConditionalExpression
packages/escape-html/src/index.js:19:7
       case 38:
         ch = "&amp;";
         break;
-      case 39:
-        ch = "&#39;";
-        break;
+      case 39:
       case 60:
         ch = "&lt;";
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.323958ms)

✔ escapes & (0.470209ms)

✔ escapes <> (0.099458ms)

✔ escapes quotes (0.061208ms)

[Killed] StringLiteral
packages/escape-html/src/index.js:20:14
         ch = "&amp;";
         break;
       case 39:
-        ch = "&#39;";
+        ch = "";
         break;
       case 60:
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.366958ms)

✔ escapes & (0.5285ms)

✔ escapes <> (0.111458ms)

✔ escapes quotes (0.070834ms)

[Killed] ConditionalExpression
packages/escape-html/src/index.js:22:7
       case 39:
         ch = "&#39;";
         break;
-      case 60:
-        ch = "&lt;";
-        break;
+      case 60:
       case 62:
         ch = "&gt;";
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.3165ms)

✔ escapes & (0.4605ms)

✖ escapes <> (0.587167ms)

✔ escapes quotes (0.074792ms)

[Killed] StringLiteral
packages/escape-html/src/index.js:23:14
         ch = "&#39;";
         break;
       case 60:
-        ch = "&lt;";
+        ch = "";
         break;
       case 62:
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.316333ms)

✔ escapes & (0.494917ms)

✖ escapes <> (0.623334ms)
✔ escapes quotes (0.071583ms)
✔ escapes single quotes (0.056375ms)

[Killed] ConditionalExpression
packages/escape-html/src/index.js:25:7
       case 60:
         ch = "&lt;";
         break;
-      case 62:
-        ch = "&gt;";
-        break;
+      case 62:
       default:
         continue;
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.338ms)

✔ escapes & (0.458125ms)

✖ escapes <> (0.597875ms)

✔ escapes quotes (0.079375ms)
✔ escapes single quotes (0.054625ms)

[Killed] StringLiteral
packages/escape-html/src/index.js:26:14
         ch = "&lt;";
         break;
       case 62:
-        ch = "&gt;";
+        ch = "";
         break;
       default:
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.339375ms)

✔ escapes & (0.577959ms)

✖ escapes <> (0.667833ms)
✔ escapes quotes (0.077625ms)

✔ escapes single quotes (0.059083ms)

[Killed] MethodExpression
packages/escape-html/src/index.js:31:29
       default:
         continue;
     }
-    if (last !== i) html += s.substring(last, i);
+    if (last !== i) html += s;
     html += ch;
     last = i + 1;
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.311417ms)

✖ escapes & (1.020209ms)

✖ escapes <> (0.172584ms)

✖ escapes quotes (0.111459ms)

[Killed] ConditionalExpression
packages/escape-html/src/index.js:31:9
       default:
         continue;
     }
-    if (last !== i) html += s.substring(last, i);
+    if (false) html += s.substring(last, i);
     html += ch;
     last = i + 1;
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.358041ms)

✖ escapes & (0.941375ms)

✖ escapes <> (0.156917ms)

✖ escapes quotes (0.103ms)

[Killed] AssignmentOperator
packages/escape-html/src/index.js:32:5
         continue;
     }
     if (last !== i) html += s.substring(last, i);
-    html += ch;
+    html -= ch;
     last = i + 1;
   }
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.329042ms)

✖ escapes & (0.845208ms)

✖ escapes <> (0.163ms)

✖ escapes quotes (0.094833ms)

[Killed] ArithmeticOperator
packages/escape-html/src/index.js:33:12
     }
     if (last !== i) html += s.substring(last, i);
     html += ch;
-    last = i + 1;
+    last = i - 1;
   }
   return last !== s.length ? html + s.substring(last) : html;
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.311875ms)

✖ escapes & (1.007417ms)
✖ escapes <> (0.175916ms)

✖ escapes quotes (0.118583ms)

✖ escapes single quotes (0.101708ms)

[Killed] EqualityOperator
packages/escape-html/src/index.js:35:10
     html += ch;
     last = i + 1;
   }
-  return last !== s.length ? html + s.substring(last) : html;
+  return last === s.length ? html + s.substring(last) : html;
 };
 
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.331917ms)

✖ escapes & (0.938917ms)

✔ escapes <> (0.12575ms)

✔ escapes quotes (0.064708ms)

[Killed] MethodExpression
packages/escape-html/src/index.js:35:37
     html += ch;
     last = i + 1;
   }
-  return last !== s.length ? html + s.substring(last) : html;
+  return last !== s.length ? html + s : html;
 };
 
killedBy: All tests
statusReason: ✔ contract: escape-html() called as: escape-html(expr) (express/lib/response.js:845) (0.341875ms)

✖ escapes & (0.96925ms)

✔ escapes <> (0.126792ms)

✔ escapes quotes (0.064209ms)
