[Killed] ArithmeticOperator
packages/ms/src/index.js:7:11
  */
 // Time unit constants in milliseconds
 const S = 1000;
-const M = S * 60;
+const M = S / 60;
 const H = M * 60;
 const D = H * 24;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.371625ms)

✔ parse: seconds (0.112417ms)

✖ parse: minutes (0.496167ms)

✖ parse: hours (0.118375ms)

[Killed] ArithmeticOperator
packages/ms/src/index.js:8:11
 // Time unit constants in milliseconds
 const S = 1000;
 const M = S * 60;
-const H = M * 60;
+const H = M / 60;
 const D = H * 24;
 const W = D * 7;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.183167ms)

✔ parse: seconds (0.089166ms)
✔ parse: minutes (0.073208ms)

✖ parse: hours (0.421459ms)

✖ parse: days (0.144875ms)

[Killed] ArithmeticOperator
packages/ms/src/index.js:9:11
 const S = 1000;
 const M = S * 60;
 const H = M * 60;
-const D = H * 24;
+const D = H / 24;
 const W = D * 7;
 const Y = D * 365.25;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.208208ms)

✔ parse: seconds (0.089917ms)
✔ parse: minutes (0.071042ms)
✔ parse: hours (0.063875ms)

✖ parse: days (0.445333ms)

[Killed] ArithmeticOperator
packages/ms/src/index.js:10:11
 const M = S * 60;
 const H = M * 60;
 const D = H * 24;
-const W = D * 7;
+const W = D / 7;
 const Y = D * 365.25;
 
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.171917ms)

✔ parse: seconds (0.093375ms)
✔ parse: minutes (0.077042ms)
✔ parse: hours (0.069917ms)
✔ parse: days (0.108542ms)

✖ parse: weeks (0.524291ms)

[Killed] ArithmeticOperator
packages/ms/src/index.js:11:11
 const H = M * 60;
 const D = H * 24;
 const W = D * 7;
-const Y = D * 365.25;
+const Y = D / 365.25;
 
 // Regex matching time strings like "2 days", "1h", "500ms"
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.347708ms)

✔ parse: seconds (0.103542ms)
✔ parse: minutes (0.072917ms)
✔ parse: hours (0.066417ms)
✔ parse: days (0.092958ms)
✔ parse: weeks (0.076083ms)

[Killed] Regex
packages/ms/src/index.js:16:3
 // Regex matching time strings like "2 days", "1h", "500ms"
 // Safe: input length capped at 100 chars to prevent ReDoS
 const PARSE_RE =
-  /^(-?(?:\d+)?\.?\d+)\s*(ms|milliseconds?|s|sec|seconds?|m|min|minutes?|h|hrs?|hours?|d|days?|w|weeks?|y|years?)?$/i;
+  /^(-?(?:\d+)?\.?\d+)\s*(ms|milliseconds?|s|sec|seconds?|m|min|minutes?|h|hrs|hours?|d|days?|w|weeks?|y|years?)?$/i;
 
 /** @param {string|number} val @param {{ long?: boolean }} [options] @returns {string|number|undefined} */
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.282625ms)

✔ parse: seconds (0.1005ms)
✔ parse: minutes (0.072458ms)
✔ parse: hours (0.069041ms)
✔ parse: days (0.099083ms)
✔ parse: weeks (0.070542ms)

[Killed] Regex
packages/ms/src/index.js:16:3
 // Regex matching time strings like "2 days", "1h", "500ms"
 // Safe: input length capped at 100 chars to prevent ReDoS
 const PARSE_RE =
-  /^(-?(?:\d+)?\.?\d+)\s*(ms|milliseconds?|s|sec|seconds?|m|min|minutes?|h|hrs?|hours?|d|days?|w|weeks?|y|years?)?$/i;
+  /^(-?(?:\D+)?\.?\d+)\s*(ms|milliseconds?|s|sec|seconds?|m|min|minutes?|h|hrs?|hours?|d|days?|w|weeks?|y|years?)?$/i;
 
 /** @param {string|number} val @param {{ long?: boolean }} [options] @returns {string|number|undefined} */
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.429791ms)

✖ parse: seconds (0.447541ms)
✔ parse: minutes (0.07475ms)
✔ parse: hours (0.073833ms)

✔ parse: days (0.080584ms)

[Killed] BlockStatement
packages/ms/src/index.js:20:44
 
 /** @param {string|number} val @param {{ long?: boolean }} [options] @returns {string|number|undefined} */
 // Public API
-module.exports = function ms(val, options) {
-  const type = typeof val;
-  if (type === "string" && val.length > 0) return parse(val);
-  if (type === "number" && Number.isFinite(val))
-    return options?.long ? fmtLong(val) : fmtShort(val);
-  throw new Error(
-    `val is not a non-empty string or a valid number: ${JSON.stringify(val)}`,
-  );
-};
+module.exports = function ms(val, options) {};
 
 /** @param {string} str */
killedBy: All tests
statusReason: ✖ parse: milliseconds (1.39075ms)

✖ parse: seconds (0.190917ms)
✖ parse: minutes (0.152583ms)
✖ parse: hours (0.11425ms)

✖ parse: days (0.0965ms)
✖ parse: weeks (0.069291ms)

[Killed] EqualityOperator
packages/ms/src/index.js:22:7
 // Public API
 module.exports = function ms(val, options) {
   const type = typeof val;
-  if (type === "string" && val.length > 0) return parse(val);
+  if (type !== "string" && val.length > 0) return parse(val);
   if (type === "number" && Number.isFinite(val))
     return options?.long ? fmtLong(val) : fmtShort(val);
killedBy: All tests
statusReason: ✖ parse: milliseconds (0.858959ms)

✖ parse: seconds (0.063625ms)
✖ parse: minutes (0.0475ms)

✖ parse: hours (0.045875ms)

✖ parse: days (0.041791ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:22:28
 // Public API
 module.exports = function ms(val, options) {
   const type = typeof val;
-  if (type === "string" && val.length > 0) return parse(val);
+  if (type === "string" && true) return parse(val);
   if (type === "number" && Number.isFinite(val))
     return options?.long ? fmtLong(val) : fmtShort(val);
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.10925ms)

✔ parse: seconds (0.090416ms)
✔ parse: minutes (0.068625ms)
✔ parse: hours (0.062791ms)
✔ parse: days (0.090167ms)

✔ parse: weeks (0.073625ms)

[Killed] LogicalOperator
packages/ms/src/index.js:23:7
 module.exports = function ms(val, options) {
   const type = typeof val;
   if (type === "string" && val.length > 0) return parse(val);
-  if (type === "number" && Number.isFinite(val))
+  if (type === "number" || Number.isFinite(val))
     return options?.long ? fmtLong(val) : fmtShort(val);
   throw new Error(
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.278375ms)

✔ parse: seconds (0.099292ms)
✔ parse: minutes (0.075375ms)
✔ parse: hours (0.064708ms)
✔ parse: days (0.093875ms)

✔ parse: weeks (0.080417ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:23:7
 module.exports = function ms(val, options) {
   const type = typeof val;
   if (type === "string" && val.length > 0) return parse(val);
-  if (type === "number" && Number.isFinite(val))
+  if (true)
     return options?.long ? fmtLong(val) : fmtShort(val);
   throw new Error(
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.192541ms)

✔ parse: seconds (0.085584ms)
✔ parse: minutes (0.067084ms)
✔ parse: hours (0.066708ms)
✔ parse: days (0.097ms)
✔ parse: weeks (0.066542ms)
✔ parse: negative (0.050709ms)

[Killed] OptionalChaining
packages/ms/src/index.js:24:12
   const type = typeof val;
   if (type === "string" && val.length > 0) return parse(val);
   if (type === "number" && Number.isFinite(val))
-    return options?.long ? fmtLong(val) : fmtShort(val);
+    return options.long ? fmtLong(val) : fmtShort(val);
   throw new Error(
     `val is not a non-empty string or a valid number: ${JSON.stringify(val)}`,
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.136333ms)

✔ parse: seconds (0.081083ms)
✔ parse: minutes (0.063583ms)
✔ parse: hours (0.062667ms)
✔ parse: days (0.088ms)

✔ parse: weeks (0.075916ms)

[Survived] StringLiteral
packages/ms/src/index.js:26:5
   if (type === "number" && Number.isFinite(val))
     return options?.long ? fmtLong(val) : fmtShort(val);
   throw new Error(
-    `val is not a non-empty string or a valid number: ${JSON.stringify(val)}`,
+    ``,
   );
 };

[Killed] BlockStatement
packages/ms/src/index.js:32:21
 
 /** @param {string} str */
 // Parse a time string to milliseconds
-function parse(str) {
-  const s = str.trim();
-  if (s.length > 100) return undefined;
-  const match = PARSE_RE.exec(s);
-  if (!match) return undefined;
-  const n = Number.parseFloat(match[1]);
-  const unit = (match[2] || "ms").toLowerCase();
-  if (unit === "ms" || unit.startsWith("millisecond")) return n;
-  if (unit === "s" || unit.startsWith("sec")) return n * S;
-  if (unit === "m" || unit.startsWith("min")) return n * M;
-  if (unit === "h" || unit.startsWith("hr") || unit.startsWith("hour"))
-    return n * H;
-  if (unit === "d" || unit.startsWith("day")) return n * D;
-  if (unit === "w" || unit.startsWith("week")) return n * W;
-  if (unit === "y" || unit.startsWith("year")) return n * Y;
-  return undefined;
-}
+function parse(str) {}
 
 /** @param {number} ms */
killedBy: All tests
statusReason: ✖ parse: milliseconds (1.27725ms)
✖ parse: seconds (0.135375ms)

✖ parse: minutes (0.081042ms)
✖ parse: hours (0.075166ms)

✖ parse: days (0.073416ms)

[Killed] MethodExpression
packages/ms/src/index.js:33:13
 /** @param {string} str */
 // Parse a time string to milliseconds
 function parse(str) {
-  const s = str.trim();
+  const s = str;
   if (s.length > 100) return undefined;
   const match = PARSE_RE.exec(s);
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.306333ms)

✔ parse: seconds (0.110792ms)
✔ parse: minutes (0.07375ms)
✔ parse: hours (0.070208ms)
✔ parse: days (0.101709ms)

✔ parse: weeks (0.076167ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:34:7
 // Parse a time string to milliseconds
 function parse(str) {
   const s = str.trim();
-  if (s.length > 100) return undefined;
+  if (false) return undefined;
   const match = PARSE_RE.exec(s);
   if (!match) return undefined;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.253917ms)

✔ parse: seconds (0.101625ms)
✔ parse: minutes (0.074459ms)
✔ parse: hours (0.077291ms)
✔ parse: days (0.085459ms)

✔ parse: weeks (0.075917ms)

[Killed] EqualityOperator
packages/ms/src/index.js:34:7
 // Parse a time string to milliseconds
 function parse(str) {
   const s = str.trim();
-  if (s.length > 100) return undefined;
+  if (s.length <= 100) return undefined;
   const match = PARSE_RE.exec(s);
   if (!match) return undefined;
killedBy: All tests
statusReason: ✖ parse: milliseconds (1.5125ms)

✖ parse: seconds (0.177958ms)
✖ parse: minutes (0.10425ms)
✖ parse: hours (0.093333ms)

✖ parse: days (0.08825ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:36:7
   const s = str.trim();
   if (s.length > 100) return undefined;
   const match = PARSE_RE.exec(s);
-  if (!match) return undefined;
+  if (false) return undefined;
   const n = Number.parseFloat(match[1]);
   const unit = (match[2] || "ms").toLowerCase();
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.13925ms)

✔ parse: seconds (0.081375ms)
✔ parse: minutes (0.067417ms)
✔ parse: hours (0.069959ms)
✔ parse: days (0.079875ms)

✔ parse: weeks (0.080125ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:36:7
   const s = str.trim();
   if (s.length > 100) return undefined;
   const match = PARSE_RE.exec(s);
-  if (!match) return undefined;
+  if (true) return undefined;
   const n = Number.parseFloat(match[1]);
   const unit = (match[2] || "ms").toLowerCase();
killedBy: All tests
statusReason: ✖ parse: milliseconds (1.710834ms)

✖ parse: seconds (0.2665ms)
✖ parse: minutes (0.093625ms)
✖ parse: hours (0.078834ms)

✖ parse: days (0.134125ms)
✖ parse: weeks (0.081916ms)

[Killed] LogicalOperator
packages/ms/src/index.js:38:17
   const match = PARSE_RE.exec(s);
   if (!match) return undefined;
   const n = Number.parseFloat(match[1]);
-  const unit = (match[2] || "ms").toLowerCase();
+  const unit = (match[2] && "ms").toLowerCase();
   if (unit === "ms" || unit.startsWith("millisecond")) return n;
   if (unit === "s" || unit.startsWith("sec")) return n * S;
killedBy: All tests
statusReason: ✖ parse: milliseconds (1.435041ms)

✖ parse: seconds (0.44775ms)
✖ parse: minutes (0.136583ms)

✖ parse: hours (0.102375ms)

✖ parse: days (0.081666ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:38:17
   const match = PARSE_RE.exec(s);
   if (!match) return undefined;
   const n = Number.parseFloat(match[1]);
-  const unit = (match[2] || "ms").toLowerCase();
+  const unit = (false).toLowerCase();
   if (unit === "ms" || unit.startsWith("millisecond")) return n;
   if (unit === "s" || unit.startsWith("sec")) return n * S;
killedBy: All tests
statusReason: ✖ parse: milliseconds (1.244583ms)

✖ parse: seconds (0.211542ms)
✖ parse: minutes (0.112792ms)
✖ parse: hours (0.100875ms)

✖ parse: days (0.096416ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:39:7
   if (!match) return undefined;
   const n = Number.parseFloat(match[1]);
   const unit = (match[2] || "ms").toLowerCase();
-  if (unit === "ms" || unit.startsWith("millisecond")) return n;
+  if (false) return n;
   if (unit === "s" || unit.startsWith("sec")) return n * S;
   if (unit === "m" || unit.startsWith("min")) return n * M;
killedBy: All tests
statusReason: ✖ parse: milliseconds (1.518292ms)
✔ parse: seconds (0.225417ms)

✔ parse: minutes (0.068833ms)
✔ parse: hours (0.067625ms)
✔ parse: days (0.062416ms)
✔ parse: weeks (0.1055ms)
✔ parse: negative (0.089709ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:39:7
   if (!match) return undefined;
   const n = Number.parseFloat(match[1]);
   const unit = (match[2] || "ms").toLowerCase();
-  if (unit === "ms" || unit.startsWith("millisecond")) return n;
+  if (false || unit.startsWith("millisecond")) return n;
   if (unit === "s" || unit.startsWith("sec")) return n * S;
   if (unit === "m" || unit.startsWith("min")) return n * M;
killedBy: All tests
statusReason: ✖ parse: milliseconds (1.509208ms)
✔ parse: seconds (0.21525ms)
✔ parse: minutes (0.072583ms)

✔ parse: hours (0.070584ms)
✔ parse: days (0.080791ms)
✔ parse: weeks (0.075708ms)
✔ parse: negative (0.059958ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:40:7
   const n = Number.parseFloat(match[1]);
   const unit = (match[2] || "ms").toLowerCase();
   if (unit === "ms" || unit.startsWith("millisecond")) return n;
-  if (unit === "s" || unit.startsWith("sec")) return n * S;
+  if (true) return n * S;
   if (unit === "m" || unit.startsWith("min")) return n * M;
   if (unit === "h" || unit.startsWith("hr") || unit.startsWith("hour"))
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.2825ms)

✔ parse: seconds (0.09375ms)

✖ parse: minutes (0.46375ms)
✖ parse: hours (0.107625ms)

✖ parse: days (0.08725ms)

[Killed] ArithmeticOperator
packages/ms/src/index.js:40:54
   const n = Number.parseFloat(match[1]);
   const unit = (match[2] || "ms").toLowerCase();
   if (unit === "ms" || unit.startsWith("millisecond")) return n;
-  if (unit === "s" || unit.startsWith("sec")) return n * S;
+  if (unit === "s" || unit.startsWith("sec")) return n / S;
   if (unit === "m" || unit.startsWith("min")) return n * M;
   if (unit === "h" || unit.startsWith("hr") || unit.startsWith("hour"))
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.27175ms)

✖ parse: seconds (0.467084ms)

✔ parse: minutes (0.075833ms)
✔ parse: hours (0.0675ms)
✔ parse: days (0.071167ms)

[Killed] MethodExpression
packages/ms/src/index.js:41:23
   const unit = (match[2] || "ms").toLowerCase();
   if (unit === "ms" || unit.startsWith("millisecond")) return n;
   if (unit === "s" || unit.startsWith("sec")) return n * S;
-  if (unit === "m" || unit.startsWith("min")) return n * M;
+  if (unit === "m" || unit.endsWith("min")) return n * M;
   if (unit === "h" || unit.startsWith("hr") || unit.startsWith("hour"))
     return n * H;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.4385ms)

✔ parse: seconds (0.0975ms)
✔ parse: minutes (0.083875ms)
✔ parse: hours (0.071042ms)
✔ parse: days (0.0835ms)

✔ parse: weeks (0.069792ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:41:7
   const unit = (match[2] || "ms").toLowerCase();
   if (unit === "ms" || unit.startsWith("millisecond")) return n;
   if (unit === "s" || unit.startsWith("sec")) return n * S;
-  if (unit === "m" || unit.startsWith("min")) return n * M;
+  if (false) return n * M;
   if (unit === "h" || unit.startsWith("hr") || unit.startsWith("hour"))
     return n * H;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.293291ms)

✔ parse: seconds (0.098417ms)

✖ parse: minutes (0.478792ms)
✔ parse: hours (0.07075ms)
✔ parse: days (0.065875ms)

[Killed] MethodExpression
packages/ms/src/index.js:42:23
   if (unit === "ms" || unit.startsWith("millisecond")) return n;
   if (unit === "s" || unit.startsWith("sec")) return n * S;
   if (unit === "m" || unit.startsWith("min")) return n * M;
-  if (unit === "h" || unit.startsWith("hr") || unit.startsWith("hour"))
+  if (unit === "h" || unit.endsWith("hr") || unit.startsWith("hour"))
     return n * H;
   if (unit === "d" || unit.startsWith("day")) return n * D;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.166ms)

✔ parse: seconds (0.084833ms)
✔ parse: minutes (0.068917ms)

✖ parse: hours (0.458917ms)
✔ parse: days (0.08ms)

[Killed] EqualityOperator
packages/ms/src/index.js:42:7
   if (unit === "ms" || unit.startsWith("millisecond")) return n;
   if (unit === "s" || unit.startsWith("sec")) return n * S;
   if (unit === "m" || unit.startsWith("min")) return n * M;
-  if (unit === "h" || unit.startsWith("hr") || unit.startsWith("hour"))
+  if (unit !== "h" || unit.startsWith("hr") || unit.startsWith("hour"))
     return n * H;
   if (unit === "d" || unit.startsWith("day")) return n * D;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.258ms)

✔ parse: seconds (0.09725ms)
✔ parse: minutes (0.072834ms)

✖ parse: hours (0.474ms)

✖ parse: days (0.109208ms)

[Killed] ArithmeticOperator
packages/ms/src/index.js:43:12
   if (unit === "s" || unit.startsWith("sec")) return n * S;
   if (unit === "m" || unit.startsWith("min")) return n * M;
   if (unit === "h" || unit.startsWith("hr") || unit.startsWith("hour"))
-    return n * H;
+    return n / H;
   if (unit === "d" || unit.startsWith("day")) return n * D;
   if (unit === "w" || unit.startsWith("week")) return n * W;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.349584ms)

✔ parse: seconds (0.109958ms)
✔ parse: minutes (0.086666ms)

✖ parse: hours (0.505625ms)

✔ parse: days (0.087708ms)

[Killed] EqualityOperator
packages/ms/src/index.js:44:7
   if (unit === "m" || unit.startsWith("min")) return n * M;
   if (unit === "h" || unit.startsWith("hr") || unit.startsWith("hour"))
     return n * H;
-  if (unit === "d" || unit.startsWith("day")) return n * D;
+  if (unit !== "d" || unit.startsWith("day")) return n * D;
   if (unit === "w" || unit.startsWith("week")) return n * W;
   if (unit === "y" || unit.startsWith("year")) return n * Y;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.24425ms)

✔ parse: seconds (0.094459ms)
✔ parse: minutes (0.067584ms)
✔ parse: hours (0.066375ms)

✖ parse: days (0.460708ms)

[Killed] MethodExpression
packages/ms/src/index.js:44:23
   if (unit === "m" || unit.startsWith("min")) return n * M;
   if (unit === "h" || unit.startsWith("hr") || unit.startsWith("hour"))
     return n * H;
-  if (unit === "d" || unit.startsWith("day")) return n * D;
+  if (unit === "d" || unit.endsWith("day")) return n * D;
   if (unit === "w" || unit.startsWith("week")) return n * W;
   if (unit === "y" || unit.startsWith("year")) return n * Y;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.339625ms)

✔ parse: seconds (0.092458ms)
✔ parse: minutes (0.069959ms)
✔ parse: hours (0.071166ms)

✖ parse: days (0.622917ms)

[Killed] ArithmeticOperator
packages/ms/src/index.js:45:55
   if (unit === "h" || unit.startsWith("hr") || unit.startsWith("hour"))
     return n * H;
   if (unit === "d" || unit.startsWith("day")) return n * D;
-  if (unit === "w" || unit.startsWith("week")) return n * W;
+  if (unit === "w" || unit.startsWith("week")) return n / W;
   if (unit === "y" || unit.startsWith("year")) return n * Y;
   return undefined;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.4365ms)

✔ parse: seconds (0.125375ms)
✔ parse: minutes (0.079917ms)
✔ parse: hours (0.074291ms)
✔ parse: days (0.097834ms)

✖ parse: weeks (0.574542ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:45:7
   if (unit === "h" || unit.startsWith("hr") || unit.startsWith("hour"))
     return n * H;
   if (unit === "d" || unit.startsWith("day")) return n * D;
-  if (unit === "w" || unit.startsWith("week")) return n * W;
+  if (true) return n * W;
   if (unit === "y" || unit.startsWith("year")) return n * Y;
   return undefined;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.344917ms)

✔ parse: seconds (0.095792ms)
✔ parse: minutes (0.074042ms)
✔ parse: hours (0.065416ms)
✔ parse: days (0.099208ms)
✔ parse: weeks (0.099459ms)
✔ parse: negative (0.051167ms)

[Killed] ArithmeticOperator
packages/ms/src/index.js:46:55
     return n * H;
   if (unit === "d" || unit.startsWith("day")) return n * D;
   if (unit === "w" || unit.startsWith("week")) return n * W;
-  if (unit === "y" || unit.startsWith("year")) return n * Y;
+  if (unit === "y" || unit.startsWith("year")) return n / Y;
   return undefined;
 }
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.222583ms)

✔ parse: seconds (0.088ms)
✔ parse: minutes (0.069041ms)
✔ parse: hours (0.061416ms)
✔ parse: days (0.088333ms)
✔ parse: weeks (0.077583ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:46:7
     return n * H;
   if (unit === "d" || unit.startsWith("day")) return n * D;
   if (unit === "w" || unit.startsWith("week")) return n * W;
-  if (unit === "y" || unit.startsWith("year")) return n * Y;
+  if (false) return n * Y;
   return undefined;
 }
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.318875ms)

✔ parse: seconds (0.101417ms)
✔ parse: minutes (0.074042ms)
✔ parse: hours (0.062334ms)
✔ parse: days (0.091541ms)

✔ parse: weeks (0.077291ms)

[Killed] BlockStatement
packages/ms/src/index.js:52:23
 
 /** @param {number} ms */
 // Format milliseconds to short string (1d, 2h, 3m)
-function fmtShort(ms) {
-  const abs = Math.abs(ms);
-  if (abs >= D) return `${Math.round(ms / D)}d`;
-  if (abs >= H) return `${Math.round(ms / H)}h`;
-  if (abs >= M) return `${Math.round(ms / M)}m`;
-  if (abs >= S) return `${Math.round(ms / S)}s`;
-  return `${ms}ms`;
-}
+function fmtShort(ms) {}
 
 /** @param {number} ms */
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.222333ms)

✔ parse: seconds (0.098417ms)
✔ parse: minutes (0.069541ms)
✔ parse: hours (0.064958ms)
✔ parse: days (0.097ms)
✔ parse: weeks (0.075958ms)

[Killed] EqualityOperator
packages/ms/src/index.js:54:7
 // Format milliseconds to short string (1d, 2h, 3m)
 function fmtShort(ms) {
   const abs = Math.abs(ms);
-  if (abs >= D) return `${Math.round(ms / D)}d`;
+  if (abs > D) return `${Math.round(ms / D)}d`;
   if (abs >= H) return `${Math.round(ms / H)}h`;
   if (abs >= M) return `${Math.round(ms / M)}m`;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.367167ms)
✔ parse: seconds (0.106125ms)
✔ parse: minutes (0.071459ms)
✔ parse: hours (0.066792ms)
✔ parse: days (0.09825ms)

✔ parse: weeks (0.068625ms)
✔ parse: negative (0.053917ms)

[Killed] ArithmeticOperator
packages/ms/src/index.js:54:38
 // Format milliseconds to short string (1d, 2h, 3m)
 function fmtShort(ms) {
   const abs = Math.abs(ms);
-  if (abs >= D) return `${Math.round(ms / D)}d`;
+  if (abs >= D) return `${Math.round(ms * D)}d`;
   if (abs >= H) return `${Math.round(ms / H)}h`;
   if (abs >= M) return `${Math.round(ms / M)}m`;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.375541ms)

✔ parse: seconds (0.103125ms)
✔ parse: minutes (0.073708ms)
✔ parse: hours (0.065417ms)
✔ parse: days (0.094917ms)
✔ parse: weeks (0.085ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:55:7
 function fmtShort(ms) {
   const abs = Math.abs(ms);
   if (abs >= D) return `${Math.round(ms / D)}d`;
-  if (abs >= H) return `${Math.round(ms / H)}h`;
+  if (false) return `${Math.round(ms / H)}h`;
   if (abs >= M) return `${Math.round(ms / M)}m`;
   if (abs >= S) return `${Math.round(ms / S)}s`;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.223208ms)

✔ parse: seconds (0.087208ms)
✔ parse: minutes (0.068333ms)
✔ parse: hours (0.061833ms)
✔ parse: days (0.093875ms)

✔ parse: weeks (0.06425ms)

[Killed] EqualityOperator
packages/ms/src/index.js:55:7
 function fmtShort(ms) {
   const abs = Math.abs(ms);
   if (abs >= D) return `${Math.round(ms / D)}d`;
-  if (abs >= H) return `${Math.round(ms / H)}h`;
+  if (abs > H) return `${Math.round(ms / H)}h`;
   if (abs >= M) return `${Math.round(ms / M)}m`;
   if (abs >= S) return `${Math.round(ms / S)}s`;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.086542ms)

✔ parse: seconds (0.080625ms)
✔ parse: minutes (0.068708ms)
✔ parse: hours (0.062083ms)
✔ parse: days (0.091167ms)
✔ parse: weeks (0.077458ms)

[Killed] ArithmeticOperator
packages/ms/src/index.js:56:38
   const abs = Math.abs(ms);
   if (abs >= D) return `${Math.round(ms / D)}d`;
   if (abs >= H) return `${Math.round(ms / H)}h`;
-  if (abs >= M) return `${Math.round(ms / M)}m`;
+  if (abs >= M) return `${Math.round(ms * M)}m`;
   if (abs >= S) return `${Math.round(ms / S)}s`;
   return `${ms}ms`;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.297709ms)

✔ parse: seconds (0.120625ms)
✔ parse: minutes (0.078334ms)
✔ parse: hours (0.075459ms)
✔ parse: days (0.091459ms)
✔ parse: weeks (0.073625ms)
✔ parse: negative (0.059875ms)

[Killed] EqualityOperator
packages/ms/src/index.js:56:7
   const abs = Math.abs(ms);
   if (abs >= D) return `${Math.round(ms / D)}d`;
   if (abs >= H) return `${Math.round(ms / H)}h`;
-  if (abs >= M) return `${Math.round(ms / M)}m`;
+  if (abs > M) return `${Math.round(ms / M)}m`;
   if (abs >= S) return `${Math.round(ms / S)}s`;
   return `${ms}ms`;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.132208ms)

✔ parse: seconds (0.082583ms)
✔ parse: minutes (0.06775ms)
✔ parse: hours (0.067792ms)
✔ parse: days (0.093667ms)

✔ parse: weeks (0.0745ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:57:7
   if (abs >= D) return `${Math.round(ms / D)}d`;
   if (abs >= H) return `${Math.round(ms / H)}h`;
   if (abs >= M) return `${Math.round(ms / M)}m`;
-  if (abs >= S) return `${Math.round(ms / S)}s`;
+  if (true) return `${Math.round(ms / S)}s`;
   return `${ms}ms`;
 }
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.312208ms)

✔ parse: seconds (0.115916ms)
✔ parse: minutes (0.077542ms)
✔ parse: hours (0.068625ms)
✔ parse: days (0.093583ms)

✔ parse: weeks (0.081458ms)

[Killed] ArithmeticOperator
packages/ms/src/index.js:57:38
   if (abs >= D) return `${Math.round(ms / D)}d`;
   if (abs >= H) return `${Math.round(ms / H)}h`;
   if (abs >= M) return `${Math.round(ms / M)}m`;
-  if (abs >= S) return `${Math.round(ms / S)}s`;
+  if (abs >= S) return `${Math.round(ms * S)}s`;
   return `${ms}ms`;
 }
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.253916ms)

✔ parse: seconds (0.108708ms)
✔ parse: minutes (0.074083ms)
✔ parse: hours (0.064708ms)
✔ parse: days (0.092625ms)
✔ parse: weeks (0.126958ms)

[Killed] BlockStatement
packages/ms/src/index.js:63:22
 
 /** @param {number} ms */
 // Format milliseconds to long string (1 day, 2 hours)
-function fmtLong(ms) {
-  const abs = Math.abs(ms);
-  if (abs >= D) return plural(ms, abs, D, "day");
-  if (abs >= H) return plural(ms, abs, H, "hour");
-  if (abs >= M) return plural(ms, abs, M, "minute");
-  if (abs >= S) return plural(ms, abs, S, "second");
-  return `${ms} ms`;
-}
+function fmtLong(ms) {}
 
 function plural(ms, abs, unit, name) {
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.35275ms)

✔ parse: seconds (0.114084ms)
✔ parse: minutes (0.07275ms)
✔ parse: hours (0.072542ms)
✔ parse: days (0.0965ms)

✔ parse: weeks (0.073875ms)

[Killed] EqualityOperator
packages/ms/src/index.js:65:7
 // Format milliseconds to long string (1 day, 2 hours)
 function fmtLong(ms) {
   const abs = Math.abs(ms);
-  if (abs >= D) return plural(ms, abs, D, "day");
+  if (abs > D) return plural(ms, abs, D, "day");
   if (abs >= H) return plural(ms, abs, H, "hour");
   if (abs >= M) return plural(ms, abs, M, "minute");
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.142125ms)

✔ parse: seconds (0.086542ms)
✔ parse: minutes (0.067625ms)
✔ parse: hours (0.066084ms)
✔ parse: days (0.092292ms)

✔ parse: weeks (0.070958ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:65:7
 // Format milliseconds to long string (1 day, 2 hours)
 function fmtLong(ms) {
   const abs = Math.abs(ms);
-  if (abs >= D) return plural(ms, abs, D, "day");
+  if (false) return plural(ms, abs, D, "day");
   if (abs >= H) return plural(ms, abs, H, "hour");
   if (abs >= M) return plural(ms, abs, M, "minute");
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.098458ms)

✔ parse: seconds (0.082417ms)
✔ parse: minutes (0.065959ms)
✔ parse: hours (0.060833ms)
✔ parse: days (0.092791ms)

✔ parse: weeks (0.064375ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:66:7
 function fmtLong(ms) {
   const abs = Math.abs(ms);
   if (abs >= D) return plural(ms, abs, D, "day");
-  if (abs >= H) return plural(ms, abs, H, "hour");
+  if (true) return plural(ms, abs, H, "hour");
   if (abs >= M) return plural(ms, abs, M, "minute");
   if (abs >= S) return plural(ms, abs, S, "second");
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.397834ms)

✔ parse: seconds (0.110375ms)
✔ parse: minutes (0.083709ms)
✔ parse: hours (0.06925ms)
✔ parse: days (0.0995ms)

✔ parse: weeks (0.071166ms)

[Killed] EqualityOperator
packages/ms/src/index.js:66:7
 function fmtLong(ms) {
   const abs = Math.abs(ms);
   if (abs >= D) return plural(ms, abs, D, "day");
-  if (abs >= H) return plural(ms, abs, H, "hour");
+  if (abs > H) return plural(ms, abs, H, "hour");
   if (abs >= M) return plural(ms, abs, M, "minute");
   if (abs >= S) return plural(ms, abs, S, "second");
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.261542ms)

✔ parse: seconds (0.109084ms)
✔ parse: minutes (0.075375ms)
✔ parse: hours (0.064084ms)
✔ parse: days (0.098375ms)
✔ parse: weeks (0.074791ms)
