[Killed] EqualityOperator
packages/ms/src/index.js:67:7
   const abs = Math.abs(ms);
   if (abs >= D) return plural(ms, abs, D, "day");
   if (abs >= H) return plural(ms, abs, H, "hour");
-  if (abs >= M) return plural(ms, abs, M, "minute");
+  if (abs > M) return plural(ms, abs, M, "minute");
   if (abs >= S) return plural(ms, abs, S, "second");
   return `${ms} ms`;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.2885ms)

✔ parse: seconds (0.092208ms)
✔ parse: minutes (0.069875ms)
✔ parse: hours (0.06175ms)
✔ parse: days (0.092708ms)

✔ parse: weeks (0.070417ms)

[Killed] EqualityOperator
packages/ms/src/index.js:67:7
   const abs = Math.abs(ms);
   if (abs >= D) return plural(ms, abs, D, "day");
   if (abs >= H) return plural(ms, abs, H, "hour");
-  if (abs >= M) return plural(ms, abs, M, "minute");
+  if (abs < M) return plural(ms, abs, M, "minute");
   if (abs >= S) return plural(ms, abs, S, "second");
   return `${ms} ms`;
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.169875ms)

✔ parse: seconds (0.086625ms)
✔ parse: minutes (0.070333ms)
✔ parse: hours (0.063083ms)
✔ parse: days (0.0915ms)
✔ parse: weeks (0.0785ms)
✔ parse: negative (0.048ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:68:7
   if (abs >= D) return plural(ms, abs, D, "day");
   if (abs >= H) return plural(ms, abs, H, "hour");
   if (abs >= M) return plural(ms, abs, M, "minute");
-  if (abs >= S) return plural(ms, abs, S, "second");
+  if (true) return plural(ms, abs, S, "second");
   return `${ms} ms`;
 }
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.437083ms)

✔ parse: seconds (0.087792ms)
✔ parse: minutes (0.068834ms)
✔ parse: hours (0.062209ms)
✔ parse: days (0.093458ms)
✔ parse: weeks (0.071083ms)

[Killed] EqualityOperator
packages/ms/src/index.js:68:7
   if (abs >= D) return plural(ms, abs, D, "day");
   if (abs >= H) return plural(ms, abs, H, "hour");
   if (abs >= M) return plural(ms, abs, M, "minute");
-  if (abs >= S) return plural(ms, abs, S, "second");
+  if (abs < S) return plural(ms, abs, S, "second");
   return `${ms} ms`;
 }
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.191625ms)

✔ parse: seconds (0.0915ms)
✔ parse: minutes (0.066709ms)
✔ parse: hours (0.061167ms)
✔ parse: days (0.093625ms)

✔ parse: weeks (0.071375ms)

[Killed] StringLiteral
packages/ms/src/index.js:69:10
   if (abs >= H) return plural(ms, abs, H, "hour");
   if (abs >= M) return plural(ms, abs, M, "minute");
   if (abs >= S) return plural(ms, abs, S, "second");
-  return `${ms} ms`;
+  return ``;
 }
 
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.215167ms)

✔ parse: seconds (0.094ms)
✔ parse: minutes (0.07325ms)
✔ parse: hours (0.068542ms)
✔ parse: days (0.097417ms)

✔ parse: weeks (0.079125ms)

[Killed] BlockStatement
packages/ms/src/index.js:72:38
   return `${ms} ms`;
 }
 
-function plural(ms, abs, unit, name) {
-  const isPlural = abs >= unit * 1.5;
-  return `${Math.round(ms / unit)} ${name}${isPlural ? "s" : ""}`;
-}
+function plural(ms, abs, unit, name) {}
 
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.303666ms)

✔ parse: seconds (0.121416ms)
✔ parse: minutes (0.075667ms)
✔ parse: hours (0.066875ms)
✔ parse: days (0.094667ms)
✔ parse: weeks (0.081459ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:73:20
 }
 
 function plural(ms, abs, unit, name) {
-  const isPlural = abs >= unit * 1.5;
+  const isPlural = true;
   return `${Math.round(ms / unit)} ${name}${isPlural ? "s" : ""}`;
 }
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.233ms)

✔ parse: seconds (0.088833ms)
✔ parse: minutes (0.071167ms)
✔ parse: hours (0.0715ms)
✔ parse: days (0.096959ms)

✔ parse: weeks (0.081583ms)

[Killed] EqualityOperator
packages/ms/src/index.js:73:20
 }
 
 function plural(ms, abs, unit, name) {
-  const isPlural = abs >= unit * 1.5;
+  const isPlural = abs > unit * 1.5;
   return `${Math.round(ms / unit)} ${name}${isPlural ? "s" : ""}`;
 }
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.293667ms)

✔ parse: seconds (0.100292ms)
✔ parse: minutes (0.072084ms)
✔ parse: hours (0.06575ms)
✔ parse: days (0.10725ms)
✔ parse: weeks (0.069209ms)

[Killed] ArithmeticOperator
packages/ms/src/index.js:74:24
 
 function plural(ms, abs, unit, name) {
   const isPlural = abs >= unit * 1.5;
-  return `${Math.round(ms / unit)} ${name}${isPlural ? "s" : ""}`;
+  return `${Math.round(ms * unit)} ${name}${isPlural ? "s" : ""}`;
 }
 
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.308125ms)

✔ parse: seconds (0.100542ms)
✔ parse: minutes (0.07125ms)
✔ parse: hours (0.065792ms)
✔ parse: days (0.099167ms)
✔ parse: weeks (0.080958ms)
✔ parse: negative (0.0525ms)

[Killed] StringLiteral
packages/ms/src/index.js:74:56
 
 function plural(ms, abs, unit, name) {
   const isPlural = abs >= unit * 1.5;
-  return `${Math.round(ms / unit)} ${name}${isPlural ? "s" : ""}`;
+  return `${Math.round(ms / unit)} ${name}${isPlural ? "" : ""}`;
 }
 
killedBy: All tests
statusReason: ✔ parse: milliseconds (1.172833ms)

✔ parse: seconds (0.086125ms)
✔ parse: minutes (0.064625ms)
✔ parse: hours (0.061833ms)
✔ parse: days (0.100667ms)

✔ parse: weeks (0.075166ms)
