[Killed] StringLiteral
packages/uuid/src/index.js:4:13
 // Implementation: native-first, zero dependencies
 const crypto = require("node:crypto");
 
-const NIL = "00000000-0000-0000-0000-000000000000";
+const NIL = "";
 const MAX = "ffffffff-ffff-ffff-ffff-ffffffffffff";
 
killedBy: All tests
statusReason: ✔ v4 returns valid uuid (0.7505ms)
✔ v4 is version 4 (0.153125ms)
✔ v7 returns valid uuid (0.531333ms)

✔ v7 is version 7 (0.076583ms)
✔ validate rejects invalid (0.063ms)
✔ v7 has correct version nibble (0x7) (0.06275ms)
✔ validate accepts valid (0.059416ms)

[Killed] BlockStatement
packages/uuid/src/index.js:8:15
 const MAX = "ffffffff-ffff-ffff-ffff-ffffffffffff";
 
 /** Generate a random UUID v4 using crypto.randomUUID */
-function v4() {
-  return crypto.randomUUID();
-}
+function v4() {}
 
 /** Generate a time-ordered UUID v7 */
killedBy: All tests
statusReason: ✖ v4 returns valid uuid (3.874416ms)
✖ v4 is version 4 (0.309333ms)

✔ v7 returns valid uuid (0.623542ms)
✔ v7 is version 7 (0.083ms)
✔ validate rejects invalid (0.054083ms)
✔ v7 has correct version nibble (0x7) (0.064417ms)
✔ validate accepts valid (0.050333ms)

[Killed] BlockStatement
packages/uuid/src/index.js:13:15
 }
 
 /** Generate a time-ordered UUID v7 */
-function v7() {
-  const bytes = crypto.getRandomValues(new Uint8Array(16));
-  const ts = Date.now();
-  bytes[0] = (ts / 2 ** 40) & 0xff;
-  bytes[1] = (ts / 2 ** 32) & 0xff;
-  bytes[2] = (ts / 2 ** 24) & 0xff;
-  bytes[3] = (ts / 2 ** 16) & 0xff;
-  bytes[4] = (ts / 2 ** 8) & 0xff;
-  bytes[5] = ts & 0xff;
-  bytes[6] = (bytes[6] & 0x0f) | 0x70;
-  bytes[8] = (bytes[8] & 0x3f) | 0x80;
-  return stringify(bytes);
-}
+function v7() {}
 
 function stringify(bytes) {
killedBy: All tests
statusReason: ✔ v4 returns valid uuid (0.762167ms)

✔ v4 is version 4 (0.157167ms)

✖ v7 returns valid uuid (2.587166ms)
✖ v7 is version 7 (0.220416ms)

✔ validate rejects invalid (0.058542ms)

[Killed] ArithmeticOperator
packages/uuid/src/index.js:16:15
 function v7() {
   const bytes = crypto.getRandomValues(new Uint8Array(16));
   const ts = Date.now();
-  bytes[0] = (ts / 2 ** 40) & 0xff;
+  bytes[0] = (ts * 2 ** 40) & 0xff;
   bytes[1] = (ts / 2 ** 32) & 0xff;
   bytes[2] = (ts / 2 ** 24) & 0xff;
killedBy: All tests
statusReason: ✔ v4 returns valid uuid (0.674792ms)

✔ v4 is version 4 (0.133208ms)
✔ v7 returns valid uuid (0.473708ms)
✔ v7 is version 7 (0.077334ms)
✔ validate rejects invalid (0.053959ms)

✔ v7 has correct version nibble (0x7) (0.05725ms)

[Killed] ArithmeticOperator
packages/uuid/src/index.js:17:15
   const bytes = crypto.getRandomValues(new Uint8Array(16));
   const ts = Date.now();
   bytes[0] = (ts / 2 ** 40) & 0xff;
-  bytes[1] = (ts / 2 ** 32) & 0xff;
+  bytes[1] = (ts * 2 ** 32) & 0xff;
   bytes[2] = (ts / 2 ** 24) & 0xff;
   bytes[3] = (ts / 2 ** 16) & 0xff;
killedBy: All tests
statusReason: ✔ v4 returns valid uuid (0.670334ms)

✔ v4 is version 4 (0.14475ms)
✔ v7 returns valid uuid (0.483042ms)
✔ v7 is version 7 (0.078208ms)
✔ validate rejects invalid (0.055875ms)
✔ v7 has correct version nibble (0x7) (0.058333ms)

[Killed] ArithmeticOperator
packages/uuid/src/index.js:18:15
   const ts = Date.now();
   bytes[0] = (ts / 2 ** 40) & 0xff;
   bytes[1] = (ts / 2 ** 32) & 0xff;
-  bytes[2] = (ts / 2 ** 24) & 0xff;
+  bytes[2] = (ts * 2 ** 24) & 0xff;
   bytes[3] = (ts / 2 ** 16) & 0xff;
   bytes[4] = (ts / 2 ** 8) & 0xff;
killedBy: All tests
statusReason: ✔ v4 returns valid uuid (0.664041ms)

✔ v4 is version 4 (0.134542ms)
✔ v7 returns valid uuid (0.464875ms)
✔ v7 is version 7 (0.075166ms)
✔ validate rejects invalid (0.054ms)

✔ v7 has correct version nibble (0x7) (0.055834ms)

[Killed] ArithmeticOperator
packages/uuid/src/index.js:19:15
   bytes[0] = (ts / 2 ** 40) & 0xff;
   bytes[1] = (ts / 2 ** 32) & 0xff;
   bytes[2] = (ts / 2 ** 24) & 0xff;
-  bytes[3] = (ts / 2 ** 16) & 0xff;
+  bytes[3] = (ts * 2 ** 16) & 0xff;
   bytes[4] = (ts / 2 ** 8) & 0xff;
   bytes[5] = ts & 0xff;
killedBy: All tests
statusReason: ✔ v4 returns valid uuid (0.697584ms)

✔ v4 is version 4 (0.1395ms)
✔ v7 returns valid uuid (0.505458ms)
✔ v7 is version 7 (0.076ms)
✔ validate rejects invalid (0.055625ms)

✔ v7 has correct version nibble (0x7) (0.058542ms)

[Killed] ArithmeticOperator
packages/uuid/src/index.js:20:15
   bytes[1] = (ts / 2 ** 32) & 0xff;
   bytes[2] = (ts / 2 ** 24) & 0xff;
   bytes[3] = (ts / 2 ** 16) & 0xff;
-  bytes[4] = (ts / 2 ** 8) & 0xff;
+  bytes[4] = (ts * 2 ** 8) & 0xff;
   bytes[5] = ts & 0xff;
   bytes[6] = (bytes[6] & 0x0f) | 0x70;
killedBy: All tests
statusReason: ✔ v4 returns valid uuid (0.674833ms)

✔ v4 is version 4 (0.142084ms)
✔ v7 returns valid uuid (0.478291ms)
✔ v7 is version 7 (0.076417ms)
✔ validate rejects invalid (0.053334ms)

✔ v7 has correct version nibble (0x7) (0.105584ms)

[Killed] BlockStatement
packages/uuid/src/index.js:27:27
   return stringify(bytes);
 }
 
-function stringify(bytes) {
-  const hex = Buffer.from(bytes).toString("hex");
-  return `${hex.slice(0, 8)}-${hex.slice(8, 12)}-${hex.slice(12, 16)}-${hex.slice(16, 20)}-${hex.slice(20)}`;
-}
+function stringify(bytes) {}
 
 function parse(str) {
killedBy: All tests
statusReason: ✔ v4 returns valid uuid (0.731875ms)

✔ v4 is version 4 (0.150875ms)
✖ v7 returns valid uuid (3.145209ms)

✖ v7 is version 7 (0.250959ms)
✔ validate rejects invalid (0.059083ms)
✖ v7 has correct version nibble (0x7) (0.07125ms)

[Killed] MethodExpression
packages/uuid/src/index.js:29:13
 
 function stringify(bytes) {
   const hex = Buffer.from(bytes).toString("hex");
-  return `${hex.slice(0, 8)}-${hex.slice(8, 12)}-${hex.slice(12, 16)}-${hex.slice(16, 20)}-${hex.slice(20)}`;
+  return `${hex}-${hex.slice(8, 12)}-${hex.slice(12, 16)}-${hex.slice(16, 20)}-${hex.slice(20)}`;
 }
 
killedBy: All tests
statusReason: ✔ v4 returns valid uuid (0.683083ms)

✔ v4 is version 4 (0.137583ms)

✖ v7 returns valid uuid (3.018ms)

✖ v7 is version 7 (0.251542ms)

[Killed] MethodExpression
packages/uuid/src/index.js:29:94
 
 function stringify(bytes) {
   const hex = Buffer.from(bytes).toString("hex");
-  return `${hex.slice(0, 8)}-${hex.slice(8, 12)}-${hex.slice(12, 16)}-${hex.slice(16, 20)}-${hex.slice(20)}`;
+  return `${hex.slice(0, 8)}-${hex.slice(8, 12)}-${hex.slice(12, 16)}-${hex.slice(16, 20)}-${hex}`;
 }
 
killedBy: All tests
statusReason: ✔ v4 returns valid uuid (0.6905ms)

✔ v4 is version 4 (0.13925ms)
✖ v7 returns valid uuid (3.038958ms)

✖ v7 is version 7 (0.255ms)
✔ validate rejects invalid (0.061542ms)

[Killed] BlockStatement
packages/uuid/src/index.js:32:21
   return `${hex.slice(0, 8)}-${hex.slice(8, 12)}-${hex.slice(12, 16)}-${hex.slice(16, 20)}-${hex.slice(20)}`;
 }
 
-function parse(str) {
-  const hex = str.replaceAll("-", "");
-  return Uint8Array.from(Buffer.from(hex, "hex"));
-}
+function parse(str) {}
 
 /** Validate a UUID string */
killedBy: All tests
statusReason: ✔ v4 returns valid uuid (0.736541ms)

✔ v4 is version 4 (0.1605ms)
✔ v7 returns valid uuid (0.531334ms)
✔ v7 is version 7 (0.075292ms)
✔ validate rejects invalid (0.058292ms)

✔ v7 has correct version nibble (0x7) (0.059542ms)

[Killed] BlockStatement
packages/uuid/src/index.js:38:24
 }
 
 /** Validate a UUID string */
-function validate(str) {
-  return /^[0-9a-f]{8}-[0-9a-f]{4}-[1-7][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i.test(
-    str,
-  );
-}
+function validate(str) {}
 
 function version(str) {
killedBy: All tests
statusReason: ✖ v4 returns valid uuid (3.257458ms)

✖ v4 is version 4 (0.351875ms)
✖ v7 returns valid uuid (0.873375ms)
✖ v7 is version 7 (0.124166ms)

✖ validate rejects invalid (0.123292ms)

[Killed] Regex
packages/uuid/src/index.js:39:10
 
 /** Validate a UUID string */
 function validate(str) {
-  return /^[0-9a-f]{8}-[0-9a-f]{4}-[1-7][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i.test(
+  return /^[0-9a-f]{8}-[^0-9a-f]{4}-[1-7][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i.test(
     str,
   );
killedBy: All tests
statusReason: ✖ v4 returns valid uuid (3.043458ms)

✖ v4 is version 4 (0.321292ms)
✖ v7 returns valid uuid (0.586166ms)
✖ v7 is version 7 (0.113875ms)

✔ validate rejects invalid (0.081208ms)
✔ v7 has correct version nibble (0x7) (0.060542ms)

[Killed] Regex
packages/uuid/src/index.js:39:10
 
 /** Validate a UUID string */
 function validate(str) {
-  return /^[0-9a-f]{8}-[0-9a-f]{4}-[1-7][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i.test(
+  return /^[0-9a-f]{8}-[0-9a-f]{4}-[1-7][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]$/i.test(
     str,
   );
killedBy: All tests
statusReason: ✖ v4 returns valid uuid (3.275416ms)

✖ v4 is version 4 (0.359167ms)
✖ v7 returns valid uuid (0.636583ms)

✖ v7 is version 7 (0.114583ms)
✔ validate rejects invalid (0.08725ms)

[Killed] BlockStatement
packages/uuid/src/index.js:44:23
   );
 }
 
-function version(str) {
-  if (!validate(str)) return undefined;
-  return Number.parseInt(str[14], 16);
-}
+function version(str) {}
 
 module.exports = { NIL, MAX, v4, v7, parse, stringify, validate, version };
killedBy: All tests
statusReason: ✔ v4 returns valid uuid (0.671583ms)

✖ v4 is version 4 (0.444542ms)
✔ v7 returns valid uuid (0.526375ms)

✖ v7 is version 7 (0.11175ms)
✔ validate rejects invalid (0.054875ms)
✔ v7 has correct version nibble (0x7) (0.064083ms)

[Killed] BooleanLiteral
packages/uuid/src/index.js:45:7
 }
 
 function version(str) {
-  if (!validate(str)) return undefined;
+  if (validate(str)) return undefined;
   return Number.parseInt(str[14], 16);
 }
killedBy: All tests
statusReason: ✔ v4 returns valid uuid (0.685ms)

✖ v4 is version 4 (0.489166ms)

✔ v7 returns valid uuid (0.475042ms)
✖ v7 is version 7 (0.115958ms)

✔ validate rejects invalid (0.05325ms)

[Killed] ConditionalExpression
packages/uuid/src/index.js:45:7
 }
 
 function version(str) {
-  if (!validate(str)) return undefined;
+  if (true) return undefined;
   return Number.parseInt(str[14], 16);
 }
killedBy: All tests
statusReason: ✔ v4 returns valid uuid (0.668583ms)

✖ v4 is version 4 (0.449333ms)

✔ v7 returns valid uuid (0.535291ms)
✖ v7 is version 7 (0.114791ms)

✔ validate rejects invalid (0.055041ms)

[Killed] ObjectLiteral
packages/uuid/src/index.js:49:18
   return Number.parseInt(str[14], 16);
 }
 
-module.exports = { NIL, MAX, v4, v7, parse, stringify, validate, version };
+module.exports = {};
 
killedBy: All tests
statusReason: ✖ v4 returns valid uuid (0.478791ms)

✖ v4 is version 4 (0.059333ms)
✖ v7 returns valid uuid (0.046584ms)
✖ v7 is version 7 (0.044542ms)

✖ validate rejects invalid (0.042792ms)
