[Killed] LogicalOperator
packages/etag/src/index.js:11:7
  * @returns {string} The ETag string
  */
 function etag(entity, options) {
-  if (entity === null || entity === undefined) {
+  if (entity === null && entity === undefined) {
     throw new TypeError("argument entity must not be null or undefined");
   }
killedBy: All tests
statusReason: ▶ etag
  ✔ should generate strong etag for string (0.754333ms)

  ✔ should generate weak etag when weak option is true (0.121542ms)
  ✔ should generate etag for Buffer (0.077834ms)
  ✔ should generate consistent etag for same input (0.077458ms)
  ✔ should generate different etag for different input (0.071292ms)

[Killed] ConditionalExpression
packages/etag/src/index.js:11:7
  * @returns {string} The ETag string
  */
 function etag(entity, options) {
-  if (entity === null || entity === undefined) {
+  if (false) {
     throw new TypeError("argument entity must not be null or undefined");
   }
killedBy: All tests
statusReason: ▶ etag
  ✔ should generate strong etag for string (0.637042ms)

  ✔ should generate weak etag when weak option is true (0.074292ms)
  ✔ should generate etag for Buffer (0.069792ms)
  ✔ should generate consistent etag for same input (0.072625ms)
  ✔ should generate different etag for different input (0.066ms)

[Killed] OptionalChaining
packages/etag/src/index.js:15:16
     throw new TypeError("argument entity must not be null or undefined");
   }
 
-  const weak = options?.weak;
+  const weak = options.weak;
 
   // Handle Stats object
killedBy: All tests
statusReason: ▶ etag
  ✖ should generate strong etag for string (0.518208ms)

  ✔ should generate weak etag when weak option is true (0.3035ms)
  ✖ should generate etag for Buffer (0.101416ms)
  ✖ should generate consistent etag for same input (0.080625ms)

  ✖ should generate different etag for different input (0.074708ms)

[Killed] LogicalOperator
packages/etag/src/index.js:18:7
   const weak = options?.weak;
 
   // Handle Stats object
-  if (typeof entity === "object" && "mtime" in entity && "ino" in entity) {
+  if (typeof entity === "object" || "mtime" in entity && "ino" in entity) {
     const stat = entity;
     const tag = crypto
killedBy: All tests
statusReason: ▶ etag
  ✖ should generate strong etag for string (0.465333ms)

  ✖ should generate weak etag when weak option is true (0.058166ms)
  ✔ should generate etag for Buffer (0.313833ms)

  ✖ should generate consistent etag for same input (0.049334ms)

[Killed] LogicalOperator
packages/etag/src/index.js:18:7
   const weak = options?.weak;
 
   // Handle Stats object
-  if (typeof entity === "object" && "mtime" in entity && "ino" in entity) {
+  if (typeof entity === "object" && "mtime" in entity || "ino" in entity) {
     const stat = entity;
     const tag = crypto
killedBy: All tests
statusReason: ▶ etag
  ✖ should generate strong etag for string (0.4845ms)

  ✖ should generate weak etag when weak option is true (0.066875ms)
  ✔ should generate etag for Buffer (0.3175ms)
  ✖ should generate consistent etag for same input (0.051833ms)

  ✖ should generate different etag for different input (0.045375ms)

[Survived] StringLiteral
packages/etag/src/index.js:25:15
       .update(String(stat.ino))
       .update(String(stat.size))
       .update(String(stat.mtime.getTime()))
-      .digest("base64");
+      .digest("");
     return weak ? `W/"${tag}"` : `"${tag}"`;
   }

[Killed] StringLiteral
packages/etag/src/index.js:26:34
       .update(String(stat.size))
       .update(String(stat.mtime.getTime()))
       .digest("base64");
-    return weak ? `W/"${tag}"` : `"${tag}"`;
+    return weak ? `W/"${tag}"` : ``;
   }
 
killedBy: All tests
statusReason: ▶ etag
  ✔ should generate strong etag for string (0.670708ms)

  ✔ should generate weak etag when weak option is true (0.076ms)
  ✔ should generate etag for Buffer (0.072541ms)
  ✔ should generate consistent etag for same input (0.076791ms)

  ✔ should generate different etag for different input (0.069291ms)

[Killed] StringLiteral
packages/etag/src/index.js:26:19
       .update(String(stat.size))
       .update(String(stat.mtime.getTime()))
       .digest("base64");
-    return weak ? `W/"${tag}"` : `"${tag}"`;
+    return weak ? `` : `"${tag}"`;
   }
 
killedBy: All tests
statusReason: ▶ etag
  ✔ should generate strong etag for string (0.68375ms)

  ✔ should generate weak etag when weak option is true (0.077041ms)
  ✔ should generate etag for Buffer (0.073958ms)
  ✔ should generate consistent etag for same input (0.076625ms)
  ✔ should generate different etag for different input (0.068917ms)

[Killed] ConditionalExpression
packages/etag/src/index.js:30:7
   }
 
   // Handle Buffer
-  if (Buffer.isBuffer(entity)) {
+  if (false) {
     const tag = crypto.createHash("sha1").update(entity).digest("base64");
     return weak ? `W/"${tag}"` : `"${tag}"`;
killedBy: All tests
statusReason: ▶ etag
  ✔ should generate strong etag for string (0.646792ms)

  ✔ should generate weak etag when weak option is true (0.093625ms)

  ✖ should generate etag for Buffer (0.103083ms)
  ✔ should generate consistent etag for same input (0.084125ms)
  ✔ should generate different etag for different input (0.0745ms)

[Killed] BlockStatement
packages/etag/src/index.js:30:32
   }
 
   // Handle Buffer
-  if (Buffer.isBuffer(entity)) {
-    const tag = crypto.createHash("sha1").update(entity).digest("base64");
-    return weak ? `W/"${tag}"` : `"${tag}"`;
-  }
+  if (Buffer.isBuffer(entity)) {}
 
   // Handle string
killedBy: All tests
statusReason: ▶ etag
  ✔ should generate strong etag for string (0.687417ms)

  ✔ should generate weak etag when weak option is true (0.136875ms)

  ✖ should generate etag for Buffer (0.128459ms)
  ✔ should generate consistent etag for same input (0.095292ms)

[Survived] StringLiteral
packages/etag/src/index.js:31:65
 
   // Handle Buffer
   if (Buffer.isBuffer(entity)) {
-    const tag = crypto.createHash("sha1").update(entity).digest("base64");
+    const tag = crypto.createHash("sha1").update(entity).digest("");
     return weak ? `W/"${tag}"` : `"${tag}"`;
   }

[Killed] StringLiteral
packages/etag/src/index.js:32:34
   // Handle Buffer
   if (Buffer.isBuffer(entity)) {
     const tag = crypto.createHash("sha1").update(entity).digest("base64");
-    return weak ? `W/"${tag}"` : `"${tag}"`;
+    return weak ? `W/"${tag}"` : ``;
   }
 
killedBy: All tests
statusReason: ▶ etag
  ✔ should generate strong etag for string (0.687167ms)
  ✔ should generate weak etag when weak option is true (0.076541ms)
  ✖ should generate etag for Buffer (2.755541ms)
  ✔ should generate consistent etag for same input (0.091667ms)
  ✔ should generate different etag for different input (0.075417ms)
  ✔ should throw on null input (0.184083ms)

[Killed] BlockStatement
packages/etag/src/index.js:36:35
   }
 
   // Handle string
-  if (typeof entity === "string") {
-    const tag = crypto
-      .createHash("sha1")
-      .update(entity, "utf8")
-      .digest("base64");
-    return weak ? `W/"${tag}"` : `"${tag}"`;
-  }
+  if (typeof entity === "string") {}
 
   throw new TypeError(
killedBy: All tests
statusReason: ▶ etag
  ✖ should generate strong etag for string (0.537167ms)

  ✖ should generate weak etag when weak option is true (0.075875ms)
  ✔ should generate etag for Buffer (0.32625ms)
  ✖ should generate consistent etag for same input (0.05225ms)

  ✖ should generate different etag for different input (0.046417ms)

[Killed] ConditionalExpression
packages/etag/src/index.js:36:7
   }
 
   // Handle string
-  if (typeof entity === "string") {
+  if (false) {
     const tag = crypto
       .createHash("sha1")
killedBy: All tests
statusReason: ▶ etag
  ✖ should generate strong etag for string (0.62275ms)

  ✖ should generate weak etag when weak option is true (0.081625ms)
  ✔ should generate etag for Buffer (0.325625ms)

  ✖ should generate consistent etag for same input (0.052375ms)

[Killed] StringLiteral
packages/etag/src/index.js:38:19
   // Handle string
   if (typeof entity === "string") {
     const tag = crypto
-      .createHash("sha1")
+      .createHash("")
       .update(entity, "utf8")
       .digest("base64");
killedBy: All tests
statusReason: ▶ etag
  ✖ should generate strong etag for string (0.619166ms)

  ✖ should generate weak etag when weak option is true (0.071792ms)
  ✔ should generate etag for Buffer (0.178375ms)
  ✖ should generate consistent etag for same input (0.054959ms)

  ✖ should generate different etag for different input (0.049792ms)
