[Killed] BlockStatement
packages/cookie/src/index.js:2:46
 /** Parse a cookie header string into key-value pairs */
-exports.parse = function parse(str, options) {
-  const obj = {};
-  if (!str || typeof str !== "string") return obj;
-  const dec = options?.decode || decodeURIComponent;
-  const pairs = str.split(";");
-  for (const pair of pairs) {
-    const idx = pair.indexOf("=");
-    if (idx < 0) continue;
-    const key = pair.substring(0, idx).trim();
-    let val = pair.substring(idx + 1).trim();
-    if (val[0] === '"') val = val.slice(1, -1);
-    if (obj[key] === undefined) {
-      try {
-        obj[key] = dec(val);
-      } catch {
-        obj[key] = val;
-      }
-    }
-  }
-  return obj;
-};
+exports.parse = function parse(str, options) {};
 
 /** Serialize a cookie name-value pair into a Set-Cookie header string */
killedBy: All tests
statusReason: ✖ parse simple cookies (1.063834ms)
✖ parse encoded values (0.085417ms)
✖ parse empty string (0.05675ms)
✖ parse ignores entries without = (0.053708ms)

✖ parse handles = at position 0 (empty key) (0.050084ms)
✔ serialize basic (0.215959ms)
✔ serialize with options (0.084625ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:4:7
 /** Parse a cookie header string into key-value pairs */
 exports.parse = function parse(str, options) {
   const obj = {};
-  if (!str || typeof str !== "string") return obj;
+  if (false) return obj;
   const dec = options?.decode || decodeURIComponent;
   const pairs = str.split(";");
killedBy: All tests
statusReason: ✔ parse simple cookies (1.097542ms)

✔ parse encoded values (0.093958ms)
✔ parse empty string (0.058792ms)
✔ parse ignores entries without = (0.072ms)
✔ parse handles = at position 0 (empty key) (0.078ms)
✔ serialize basic (0.142875ms)

[Killed] BooleanLiteral
packages/cookie/src/index.js:4:7
 /** Parse a cookie header string into key-value pairs */
 exports.parse = function parse(str, options) {
   const obj = {};
-  if (!str || typeof str !== "string") return obj;
+  if (str || typeof str !== "string") return obj;
   const dec = options?.decode || decodeURIComponent;
   const pairs = str.split(";");
killedBy: All tests
statusReason: ✖ parse simple cookies (1.351042ms)

✖ parse encoded values (0.179167ms)
✔ parse empty string (0.101542ms)
✖ parse ignores entries without = (0.092958ms)

✖ parse handles = at position 0 (empty key) (0.072292ms)
✔ serialize basic (0.127625ms)

[Killed] OptionalChaining
packages/cookie/src/index.js:5:15
 exports.parse = function parse(str, options) {
   const obj = {};
   if (!str || typeof str !== "string") return obj;
-  const dec = options?.decode || decodeURIComponent;
+  const dec = options.decode || decodeURIComponent;
   const pairs = str.split(";");
   for (const pair of pairs) {
killedBy: All tests
statusReason: ✖ parse simple cookies (0.972916ms)

✖ parse encoded values (0.098292ms)
✔ parse empty string (0.099667ms)
✖ parse ignores entries without = (0.084084ms)

✖ parse handles = at position 0 (empty key) (0.080875ms)

[Killed] LogicalOperator
packages/cookie/src/index.js:5:15
 exports.parse = function parse(str, options) {
   const obj = {};
   if (!str || typeof str !== "string") return obj;
-  const dec = options?.decode || decodeURIComponent;
+  const dec = options?.decode && decodeURIComponent;
   const pairs = str.split(";");
   for (const pair of pairs) {
killedBy: All tests
statusReason: ✔ parse simple cookies (1.210625ms)

✖ parse encoded values (0.672541ms)
✔ parse empty string (0.064541ms)

✔ parse ignores entries without = (0.150792ms)
✔ parse handles = at position 0 (empty key) (0.094917ms)
✔ serialize basic (0.117083ms)

[Killed] StringLiteral
packages/cookie/src/index.js:6:27
   const obj = {};
   if (!str || typeof str !== "string") return obj;
   const dec = options?.decode || decodeURIComponent;
-  const pairs = str.split(";");
+  const pairs = str.split("");
   for (const pair of pairs) {
     const idx = pair.indexOf("=");
killedBy: All tests
statusReason: ✖ parse simple cookies (1.685417ms)

✖ parse encoded values (0.298917ms)
✔ parse empty string (0.10425ms)

✖ parse ignores entries without = (0.134083ms)

✖ parse handles = at position 0 (empty key) (0.096708ms)

[Killed] BlockStatement
packages/cookie/src/index.js:7:29
   if (!str || typeof str !== "string") return obj;
   const dec = options?.decode || decodeURIComponent;
   const pairs = str.split(";");
-  for (const pair of pairs) {
-    const idx = pair.indexOf("=");
-    if (idx < 0) continue;
-    const key = pair.substring(0, idx).trim();
-    let val = pair.substring(idx + 1).trim();
-    if (val[0] === '"') val = val.slice(1, -1);
-    if (obj[key] === undefined) {
-      try {
-        obj[key] = dec(val);
-      } catch {
-        obj[key] = val;
-      }
-    }
-  }
+  for (const pair of pairs) {}
   return obj;
 };
killedBy: All tests
statusReason: ✖ parse simple cookies (1.416375ms)

✖ parse encoded values (0.172292ms)
✔ parse empty string (0.0885ms)
✖ parse ignores entries without = (0.087584ms)
✖ parse handles = at position 0 (empty key) (0.082542ms)
✔ serialize basic (0.118625ms)

[Killed] EqualityOperator
packages/cookie/src/index.js:9:9
   const pairs = str.split(";");
   for (const pair of pairs) {
     const idx = pair.indexOf("=");
-    if (idx < 0) continue;
+    if (idx >= 0) continue;
     const key = pair.substring(0, idx).trim();
     let val = pair.substring(idx + 1).trim();
killedBy: All tests
statusReason: ✖ parse simple cookies (1.253417ms)
✖ parse encoded values (0.17525ms)

✔ parse empty string (0.08475ms)
✖ parse ignores entries without = (0.103334ms)
✖ parse handles = at position 0 (empty key) (0.077375ms)

✔ serialize basic (0.1195ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:9:9
   const pairs = str.split(";");
   for (const pair of pairs) {
     const idx = pair.indexOf("=");
-    if (idx < 0) continue;
+    if (true) continue;
     const key = pair.substring(0, idx).trim();
     let val = pair.substring(idx + 1).trim();
killedBy: All tests
statusReason: ✖ parse simple cookies (1.487375ms)
✖ parse encoded values (0.226667ms)

✔ parse empty string (0.096416ms)
✖ parse ignores entries without = (0.102666ms)
✖ parse handles = at position 0 (empty key) (0.092583ms)

✔ serialize basic (0.128ms)

[Killed] MethodExpression
packages/cookie/src/index.js:10:17
   for (const pair of pairs) {
     const idx = pair.indexOf("=");
     if (idx < 0) continue;
-    const key = pair.substring(0, idx).trim();
+    const key = pair.substring(0, idx);
     let val = pair.substring(idx + 1).trim();
     if (val[0] === '"') val = val.slice(1, -1);
killedBy: All tests
statusReason: ✖ parse simple cookies (1.354333ms)
✔ parse encoded values (0.115834ms)

✔ parse empty string (0.055958ms)
✖ parse ignores entries without = (0.162959ms)
✔ parse handles = at position 0 (empty key) (0.06525ms)
✔ serialize basic (0.120375ms)

[Killed] MethodExpression
packages/cookie/src/index.js:10:17
   for (const pair of pairs) {
     const idx = pair.indexOf("=");
     if (idx < 0) continue;
-    const key = pair.substring(0, idx).trim();
+    const key = pair.trim();
     let val = pair.substring(idx + 1).trim();
     if (val[0] === '"') val = val.slice(1, -1);
killedBy: All tests
statusReason: ✖ parse simple cookies (1.36675ms)

✖ parse encoded values (0.200084ms)
✔ parse empty string (0.08825ms)

✖ parse ignores entries without = (0.101583ms)
✖ parse handles = at position 0 (empty key) (0.080958ms)

[Killed] ArithmeticOperator
packages/cookie/src/index.js:11:30
     const idx = pair.indexOf("=");
     if (idx < 0) continue;
     const key = pair.substring(0, idx).trim();
-    let val = pair.substring(idx + 1).trim();
+    let val = pair.substring(idx - 1).trim();
     if (val[0] === '"') val = val.slice(1, -1);
     if (obj[key] === undefined) {
killedBy: All tests
statusReason: ✖ parse simple cookies (1.569ms)
✖ parse encoded values (0.263541ms)
✔ parse empty string (0.085375ms)

✖ parse ignores entries without = (0.100084ms)
✖ parse handles = at position 0 (empty key) (0.085875ms)
✔ serialize basic (0.123917ms)
✔ serialize with options (0.079583ms)

[Killed] MethodExpression
packages/cookie/src/index.js:11:15
     const idx = pair.indexOf("=");
     if (idx < 0) continue;
     const key = pair.substring(0, idx).trim();
-    let val = pair.substring(idx + 1).trim();
+    let val = pair.substring(idx + 1);
     if (val[0] === '"') val = val.slice(1, -1);
     if (obj[key] === undefined) {
killedBy: All tests
statusReason: ✔ parse simple cookies (1.14575ms)

✔ parse encoded values (0.097084ms)
✔ parse empty string (0.059833ms)
✔ parse ignores entries without = (0.067917ms)
✔ parse handles = at position 0 (empty key) (0.099375ms)

✔ serialize basic (0.154083ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:12:9
     if (idx < 0) continue;
     const key = pair.substring(0, idx).trim();
     let val = pair.substring(idx + 1).trim();
-    if (val[0] === '"') val = val.slice(1, -1);
+    if (false) val = val.slice(1, -1);
     if (obj[key] === undefined) {
       try {
killedBy: All tests
statusReason: ✔ parse simple cookies (1.106708ms)

✔ parse encoded values (0.08975ms)
✔ parse empty string (0.07675ms)
✔ parse ignores entries without = (0.13275ms)
✔ parse handles = at position 0 (empty key) (0.081875ms)

✔ serialize basic (0.137833ms)

[Killed] MethodExpression
packages/cookie/src/index.js:12:31
     if (idx < 0) continue;
     const key = pair.substring(0, idx).trim();
     let val = pair.substring(idx + 1).trim();
-    if (val[0] === '"') val = val.slice(1, -1);
+    if (val[0] === '"') val = val;
     if (obj[key] === undefined) {
       try {
killedBy: All tests
statusReason: ✔ parse simple cookies (0.96725ms)

✔ parse encoded values (0.07125ms)
✔ parse empty string (0.051875ms)
✔ parse ignores entries without = (0.061416ms)
✔ parse handles = at position 0 (empty key) (0.058334ms)

✔ serialize basic (0.1185ms)

[Killed] BlockStatement
packages/cookie/src/index.js:13:33
     const key = pair.substring(0, idx).trim();
     let val = pair.substring(idx + 1).trim();
     if (val[0] === '"') val = val.slice(1, -1);
-    if (obj[key] === undefined) {
-      try {
-        obj[key] = dec(val);
-      } catch {
-        obj[key] = val;
-      }
-    }
+    if (obj[key] === undefined) {}
   }
   return obj;
killedBy: All tests
statusReason: ✖ parse simple cookies (1.499833ms)

✖ parse encoded values (0.231375ms)
✔ parse empty string (0.09375ms)
✖ parse ignores entries without = (0.180834ms)

✖ parse handles = at position 0 (empty key) (0.097834ms)
✔ serialize basic (0.13475ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:13:9
     const key = pair.substring(0, idx).trim();
     let val = pair.substring(idx + 1).trim();
     if (val[0] === '"') val = val.slice(1, -1);
-    if (obj[key] === undefined) {
+    if (false) {
       try {
         obj[key] = dec(val);
killedBy: All tests
statusReason: ✖ parse simple cookies (1.4155ms)

✖ parse encoded values (0.202166ms)
✔ parse empty string (0.086125ms)
✖ parse ignores entries without = (0.098875ms)

✖ parse handles = at position 0 (empty key) (0.083667ms)
✔ serialize basic (0.130167ms)

[Killed] BlockStatement
packages/cookie/src/index.js:14:11
     let val = pair.substring(idx + 1).trim();
     if (val[0] === '"') val = val.slice(1, -1);
     if (obj[key] === undefined) {
-      try {
-        obj[key] = dec(val);
-      } catch {
+      try {} catch {
         obj[key] = val;
       }
killedBy: All tests
statusReason: ✖ parse simple cookies (1.524ms)

✖ parse encoded values (0.295458ms)
✔ parse empty string (0.09125ms)
✖ parse ignores entries without = (0.10925ms)

✖ parse handles = at position 0 (empty key) (0.084125ms)
✔ serialize basic (0.1235ms)

[Killed] BlockStatement
packages/cookie/src/index.js:16:15
     if (obj[key] === undefined) {
       try {
         obj[key] = dec(val);
-      } catch {
-        obj[key] = val;
-      }
+      } catch {}
     }
   }
killedBy: All tests
statusReason: ✔ parse simple cookies (1.086333ms)

✔ parse encoded values (0.085125ms)
✔ parse empty string (0.053292ms)
✔ parse ignores entries without = (0.074042ms)
✔ parse handles = at position 0 (empty key) (0.071375ms)
✔ serialize basic (0.138667ms)

[Killed] BlockStatement
packages/cookie/src/index.js:25:60
 };
 
 /** Serialize a cookie name-value pair into a Set-Cookie header string */
-exports.serialize = function serialize(name, val, options) {
-  const opt = options || {};
-  const enc = opt.encode || encodeURIComponent;
-  let str = `${name}=${enc(val)}`;
-  if (opt.maxAge != null) str += `; Max-Age=${Math.floor(opt.maxAge)}`;
-  if (opt.domain) str += `; Domain=${opt.domain}`;
-  if (opt.path) str += `; Path=${opt.path}`;
-  if (opt.expires) str += `; Expires=${opt.expires.toUTCString()}`;
-  if (opt.httpOnly) str += "; HttpOnly";
-  if (opt.secure) str += "; Secure";
-  if (opt.sameSite)
-    str += `; SameSite=${typeof opt.sameSite === "string" ? opt.sameSite : "Strict"}`;
-  if (opt.priority) str += `; Priority=${opt.priority}`;
-  return str;
-};
+exports.serialize = function serialize(name, val, options) {};
 
killedBy: All tests
statusReason: ✔ parse simple cookies (0.982125ms)

✔ parse encoded values (0.082083ms)
✔ parse empty string (0.052791ms)
✔ parse ignores entries without = (0.068709ms)
✔ parse handles = at position 0 (empty key) (0.06625ms)

✖ serialize basic (0.511709ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:26:15
 
 /** Serialize a cookie name-value pair into a Set-Cookie header string */
 exports.serialize = function serialize(name, val, options) {
-  const opt = options || {};
+  const opt = false;
   const enc = opt.encode || encodeURIComponent;
   let str = `${name}=${enc(val)}`;
killedBy: All tests
statusReason: ✔ parse simple cookies (1.023417ms)

✔ parse encoded values (0.083791ms)
✔ parse empty string (0.054708ms)
✔ parse ignores entries without = (0.066708ms)

✔ parse handles = at position 0 (empty key) (0.067708ms)
✔ serialize basic (0.141625ms)

[Killed] LogicalOperator
packages/cookie/src/index.js:26:15
 
 /** Serialize a cookie name-value pair into a Set-Cookie header string */
 exports.serialize = function serialize(name, val, options) {
-  const opt = options || {};
+  const opt = options && {};
   const enc = opt.encode || encodeURIComponent;
   let str = `${name}=${enc(val)}`;
killedBy: All tests
statusReason: ✔ parse simple cookies (1.130583ms)

✔ parse encoded values (0.084333ms)
✔ parse empty string (0.057334ms)
✔ parse ignores entries without = (0.068791ms)
✔ parse handles = at position 0 (empty key) (0.075083ms)

✖ serialize basic (0.191709ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:27:15
 /** Serialize a cookie name-value pair into a Set-Cookie header string */
 exports.serialize = function serialize(name, val, options) {
   const opt = options || {};
-  const enc = opt.encode || encodeURIComponent;
+  const enc = true;
   let str = `${name}=${enc(val)}`;
   if (opt.maxAge != null) str += `; Max-Age=${Math.floor(opt.maxAge)}`;
killedBy: All tests
statusReason: ✔ parse simple cookies (1.043125ms)

✔ parse encoded values (0.08425ms)
✔ parse empty string (0.056084ms)
✔ parse ignores entries without = (0.068125ms)

✔ parse handles = at position 0 (empty key) (0.063583ms)

[Killed] LogicalOperator
packages/cookie/src/index.js:27:15
 /** Serialize a cookie name-value pair into a Set-Cookie header string */
 exports.serialize = function serialize(name, val, options) {
   const opt = options || {};
-  const enc = opt.encode || encodeURIComponent;
+  const enc = opt.encode && encodeURIComponent;
   let str = `${name}=${enc(val)}`;
   if (opt.maxAge != null) str += `; Max-Age=${Math.floor(opt.maxAge)}`;
killedBy: All tests
statusReason: ✔ parse simple cookies (1.682083ms)
✔ parse encoded values (0.094375ms)
✔ parse empty string (0.057625ms)

✔ parse ignores entries without = (0.067792ms)
✔ parse handles = at position 0 (empty key) (0.064291ms)
✖ serialize basic (0.203542ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:29:7
   const opt = options || {};
   const enc = opt.encode || encodeURIComponent;
   let str = `${name}=${enc(val)}`;
-  if (opt.maxAge != null) str += `; Max-Age=${Math.floor(opt.maxAge)}`;
+  if (true) str += `; Max-Age=${Math.floor(opt.maxAge)}`;
   if (opt.domain) str += `; Domain=${opt.domain}`;
   if (opt.path) str += `; Path=${opt.path}`;
killedBy: All tests
statusReason: ✔ parse simple cookies (1.033125ms)

✔ parse encoded values (0.075958ms)
✔ parse empty string (0.060292ms)
✔ parse ignores entries without = (0.064708ms)
✔ parse handles = at position 0 (empty key) (0.067166ms)

✖ serialize basic (0.699541ms)

[Killed] EqualityOperator
packages/cookie/src/index.js:29:7
   const opt = options || {};
   const enc = opt.encode || encodeURIComponent;
   let str = `${name}=${enc(val)}`;
-  if (opt.maxAge != null) str += `; Max-Age=${Math.floor(opt.maxAge)}`;
+  if (opt.maxAge == null) str += `; Max-Age=${Math.floor(opt.maxAge)}`;
   if (opt.domain) str += `; Domain=${opt.domain}`;
   if (opt.path) str += `; Path=${opt.path}`;
killedBy: All tests
statusReason: ✔ parse simple cookies (1.191583ms)

✔ parse encoded values (0.074542ms)
✔ parse empty string (0.052667ms)
✔ parse ignores entries without = (0.063375ms)
✔ parse handles = at position 0 (empty key) (0.068209ms)

✖ serialize basic (0.73025ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:30:7
   const enc = opt.encode || encodeURIComponent;
   let str = `${name}=${enc(val)}`;
   if (opt.maxAge != null) str += `; Max-Age=${Math.floor(opt.maxAge)}`;
-  if (opt.domain) str += `; Domain=${opt.domain}`;
+  if (false) str += `; Domain=${opt.domain}`;
   if (opt.path) str += `; Path=${opt.path}`;
   if (opt.expires) str += `; Expires=${opt.expires.toUTCString()}`;
killedBy: All tests
statusReason: ✔ parse simple cookies (0.955333ms)

✔ parse encoded values (0.066666ms)
✔ parse empty string (0.051084ms)
✔ parse ignores entries without = (0.061667ms)
✔ parse handles = at position 0 (empty key) (0.060041ms)

✔ serialize basic (0.13125ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:30:7
   const enc = opt.encode || encodeURIComponent;
   let str = `${name}=${enc(val)}`;
   if (opt.maxAge != null) str += `; Max-Age=${Math.floor(opt.maxAge)}`;
-  if (opt.domain) str += `; Domain=${opt.domain}`;
+  if (true) str += `; Domain=${opt.domain}`;
   if (opt.path) str += `; Path=${opt.path}`;
   if (opt.expires) str += `; Expires=${opt.expires.toUTCString()}`;
killedBy: All tests
statusReason: ✔ parse simple cookies (1.142459ms)

✔ parse encoded values (0.080709ms)
✔ parse empty string (0.054917ms)
✔ parse ignores entries without = (0.065667ms)
✔ parse handles = at position 0 (empty key) (0.065792ms)

✖ serialize basic (0.683583ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:31:7
   let str = `${name}=${enc(val)}`;
   if (opt.maxAge != null) str += `; Max-Age=${Math.floor(opt.maxAge)}`;
   if (opt.domain) str += `; Domain=${opt.domain}`;
-  if (opt.path) str += `; Path=${opt.path}`;
+  if (true) str += `; Path=${opt.path}`;
   if (opt.expires) str += `; Expires=${opt.expires.toUTCString()}`;
   if (opt.httpOnly) str += "; HttpOnly";
killedBy: All tests
statusReason: ✔ parse simple cookies (1.028792ms)

✔ parse encoded values (0.069625ms)
✔ parse empty string (0.051709ms)
✔ parse ignores entries without = (0.063125ms)
✔ parse handles = at position 0 (empty key) (0.061792ms)

✖ serialize basic (0.6375ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:31:7
   let str = `${name}=${enc(val)}`;
   if (opt.maxAge != null) str += `; Max-Age=${Math.floor(opt.maxAge)}`;
   if (opt.domain) str += `; Domain=${opt.domain}`;
-  if (opt.path) str += `; Path=${opt.path}`;
+  if (false) str += `; Path=${opt.path}`;
   if (opt.expires) str += `; Expires=${opt.expires.toUTCString()}`;
   if (opt.httpOnly) str += "; HttpOnly";
killedBy: All tests
statusReason: ✔ parse simple cookies (1.158791ms)

✔ parse encoded values (0.101459ms)
✔ parse empty string (0.058875ms)
✔ parse ignores entries without = (0.071333ms)
✔ parse handles = at position 0 (empty key) (0.069041ms)
✔ serialize basic (0.138625ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:32:7
   if (opt.maxAge != null) str += `; Max-Age=${Math.floor(opt.maxAge)}`;
   if (opt.domain) str += `; Domain=${opt.domain}`;
   if (opt.path) str += `; Path=${opt.path}`;
-  if (opt.expires) str += `; Expires=${opt.expires.toUTCString()}`;
+  if (true) str += `; Expires=${opt.expires.toUTCString()}`;
   if (opt.httpOnly) str += "; HttpOnly";
   if (opt.secure) str += "; Secure";
killedBy: All tests
statusReason: ✔ parse simple cookies (1.036208ms)

✔ parse encoded values (0.079708ms)
✔ parse empty string (0.05875ms)
✔ parse ignores entries without = (0.071541ms)
✔ parse handles = at position 0 (empty key) (0.13525ms)

✖ serialize basic (0.248125ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:32:7
   if (opt.maxAge != null) str += `; Max-Age=${Math.floor(opt.maxAge)}`;
   if (opt.domain) str += `; Domain=${opt.domain}`;
   if (opt.path) str += `; Path=${opt.path}`;
-  if (opt.expires) str += `; Expires=${opt.expires.toUTCString()}`;
+  if (false) str += `; Expires=${opt.expires.toUTCString()}`;
   if (opt.httpOnly) str += "; HttpOnly";
   if (opt.secure) str += "; Secure";
killedBy: All tests
statusReason: ✔ parse simple cookies (1.040417ms)

✔ parse encoded values (0.073417ms)
✔ parse empty string (0.050792ms)
✔ parse ignores entries without = (0.06325ms)
✔ parse handles = at position 0 (empty key) (0.062ms)

✔ serialize basic (0.125958ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:33:7
   if (opt.domain) str += `; Domain=${opt.domain}`;
   if (opt.path) str += `; Path=${opt.path}`;
   if (opt.expires) str += `; Expires=${opt.expires.toUTCString()}`;
-  if (opt.httpOnly) str += "; HttpOnly";
+  if (false) str += "; HttpOnly";
   if (opt.secure) str += "; Secure";
   if (opt.sameSite)
killedBy: All tests
statusReason: ✔ parse simple cookies (1.045ms)

✔ parse encoded values (0.073875ms)
✔ parse empty string (0.054084ms)
✔ parse ignores entries without = (0.062958ms)
✔ parse handles = at position 0 (empty key) (0.065333ms)

✔ serialize basic (0.130125ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:33:7
   if (opt.domain) str += `; Domain=${opt.domain}`;
   if (opt.path) str += `; Path=${opt.path}`;
   if (opt.expires) str += `; Expires=${opt.expires.toUTCString()}`;
-  if (opt.httpOnly) str += "; HttpOnly";
+  if (true) str += "; HttpOnly";
   if (opt.secure) str += "; Secure";
   if (opt.sameSite)
killedBy: All tests
statusReason: ✔ parse simple cookies (1.091625ms)

✔ parse encoded values (0.096334ms)
✔ parse empty string (0.053083ms)
✔ parse ignores entries without = (0.067167ms)

✔ parse handles = at position 0 (empty key) (0.069333ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:34:7
   if (opt.path) str += `; Path=${opt.path}`;
   if (opt.expires) str += `; Expires=${opt.expires.toUTCString()}`;
   if (opt.httpOnly) str += "; HttpOnly";
-  if (opt.secure) str += "; Secure";
+  if (true) str += "; Secure";
   if (opt.sameSite)
     str += `; SameSite=${typeof opt.sameSite === "string" ? opt.sameSite : "Strict"}`;
killedBy: All tests
statusReason: ✔ parse simple cookies (1.080291ms)

✔ parse encoded values (0.074208ms)
✔ parse empty string (0.052667ms)
✔ parse ignores entries without = (0.063167ms)
✔ parse handles = at position 0 (empty key) (0.065667ms)

✖ serialize basic (0.664958ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:34:7
   if (opt.path) str += `; Path=${opt.path}`;
   if (opt.expires) str += `; Expires=${opt.expires.toUTCString()}`;
   if (opt.httpOnly) str += "; HttpOnly";
-  if (opt.secure) str += "; Secure";
+  if (false) str += "; Secure";
   if (opt.sameSite)
     str += `; SameSite=${typeof opt.sameSite === "string" ? opt.sameSite : "Strict"}`;
killedBy: All tests
statusReason: ✔ parse simple cookies (0.926041ms)

✔ parse encoded values (0.068ms)
✔ parse empty string (0.051458ms)
✔ parse ignores entries without = (0.063209ms)
✔ parse handles = at position 0 (empty key) (0.065292ms)
✔ serialize basic (0.122833ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:35:7
   if (opt.expires) str += `; Expires=${opt.expires.toUTCString()}`;
   if (opt.httpOnly) str += "; HttpOnly";
   if (opt.secure) str += "; Secure";
-  if (opt.sameSite)
+  if (true)
     str += `; SameSite=${typeof opt.sameSite === "string" ? opt.sameSite : "Strict"}`;
   if (opt.priority) str += `; Priority=${opt.priority}`;
killedBy: All tests
statusReason: ✔ parse simple cookies (1.074875ms)

✔ parse encoded values (0.098333ms)
✔ parse empty string (0.05475ms)
✔ parse ignores entries without = (0.072458ms)
✔ parse handles = at position 0 (empty key) (0.067ms)

✖ serialize basic (0.7115ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:35:7
   if (opt.expires) str += `; Expires=${opt.expires.toUTCString()}`;
   if (opt.httpOnly) str += "; HttpOnly";
   if (opt.secure) str += "; Secure";
-  if (opt.sameSite)
+  if (false)
     str += `; SameSite=${typeof opt.sameSite === "string" ? opt.sameSite : "Strict"}`;
   if (opt.priority) str += `; Priority=${opt.priority}`;
killedBy: All tests
statusReason: ✔ parse simple cookies (1.071ms)

✔ parse encoded values (0.087125ms)
✔ parse empty string (0.054333ms)
✔ parse ignores entries without = (0.067291ms)
✔ parse handles = at position 0 (empty key) (0.066875ms)

✔ serialize basic (0.132125ms)

[Killed] EqualityOperator
packages/cookie/src/index.js:36:26
   if (opt.httpOnly) str += "; HttpOnly";
   if (opt.secure) str += "; Secure";
   if (opt.sameSite)
-    str += `; SameSite=${typeof opt.sameSite === "string" ? opt.sameSite : "Strict"}`;
+    str += `; SameSite=${typeof opt.sameSite !== "string" ? opt.sameSite : "Strict"}`;
   if (opt.priority) str += `; Priority=${opt.priority}`;
   return str;
killedBy: All tests
statusReason: ✔ parse simple cookies (1.06375ms)

✔ parse encoded values (0.086167ms)
✔ parse empty string (0.0565ms)
✔ parse ignores entries without = (0.068375ms)
✔ parse handles = at position 0 (empty key) (0.064083ms)

✔ serialize basic (0.1645ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:36:26
   if (opt.httpOnly) str += "; HttpOnly";
   if (opt.secure) str += "; Secure";
   if (opt.sameSite)
-    str += `; SameSite=${typeof opt.sameSite === "string" ? opt.sameSite : "Strict"}`;
+    str += `; SameSite=${false ? opt.sameSite : "Strict"}`;
   if (opt.priority) str += `; Priority=${opt.priority}`;
   return str;
killedBy: All tests
statusReason: ✔ parse simple cookies (1.165666ms)

✔ parse encoded values (0.108333ms)
✔ parse empty string (0.060041ms)
✔ parse ignores entries without = (0.073084ms)
✔ parse handles = at position 0 (empty key) (0.096542ms)
✔ serialize basic (0.161583ms)
✔ serialize with options (0.101834ms)

[Killed] ConditionalExpression
packages/cookie/src/index.js:37:7
   if (opt.secure) str += "; Secure";
   if (opt.sameSite)
     str += `; SameSite=${typeof opt.sameSite === "string" ? opt.sameSite : "Strict"}`;
-  if (opt.priority) str += `; Priority=${opt.priority}`;
+  if (true) str += `; Priority=${opt.priority}`;
   return str;
 };
killedBy: All tests
statusReason: ✔ parse simple cookies (1.060167ms)

✔ parse encoded values (0.086292ms)
✔ parse empty string (0.054709ms)
✔ parse ignores entries without = (0.069458ms)
✔ parse handles = at position 0 (empty key) (0.070583ms)

✖ serialize basic (0.70025ms)

[Survived] ConditionalExpression
packages/cookie/src/index.js:37:7
   if (opt.secure) str += "; Secure";
   if (opt.sameSite)
     str += `; SameSite=${typeof opt.sameSite === "string" ? opt.sameSite : "Strict"}`;
-  if (opt.priority) str += `; Priority=${opt.priority}`;
+  if (false) str += `; Priority=${opt.priority}`;
   return str;
 };
