[Killed] BlockStatement
packages/minimatch/src/index.js:3:44
 const braces = require("../../braces/src/index.js");
 
-function minimatch(path, pattern, options) {
-  return new Minimatch(pattern, options).match(path);
-}
+function minimatch(path, pattern, options) {}
 
 class Minimatch {
killedBy: All tests
statusReason: ✖ basic glob (0.933875ms)

✖ globstar (0.118209ms)

✖ question mark (0.090125ms)

✖ negation (0.770292ms)

[Killed] BlockStatement
packages/minimatch/src/index.js:8:38
 }
 
 class Minimatch {
-  constructor(pattern, options = {}) {
-    this.options = options;
-    this.pattern = pattern;
-    this.negate = false;
-    this.set = [];
-    this.make();
-  }
+  constructor(pattern, options = {}) {}
 
   make() {
killedBy: All tests
statusReason: ✖ basic glob (0.567958ms)

✖ globstar (0.079208ms)

✖ question mark (0.077792ms)

✖ negation (0.085917ms)

[Killed] BooleanLiteral
packages/minimatch/src/index.js:11:19
   constructor(pattern, options = {}) {
     this.options = options;
     this.pattern = pattern;
-    this.negate = false;
+    this.negate = true;
     this.set = [];
     this.make();
killedBy: All tests
statusReason: ✖ basic glob (1.060709ms)

✖ globstar (0.144375ms)
✖ question mark (0.117375ms)

✔ negation (0.276083ms)
✖ brace expansion (0.321875ms)

[Killed] BlockStatement
packages/minimatch/src/index.js:16:10
     this.make();
   }
 
-  make() {
-    let pattern = this.pattern.trim();
-    if (pattern.startsWith("!")) {
-      this.negate = true;
-      pattern = pattern.slice(1);
-    }
-
-    // Expand braces
-    const expanded = pattern.includes("{")
-      ? braces(pattern, { expand: true })
-      : [pattern];
-    this.set = expanded.map((p) => this._makeRe(p));
-  }
+  make() {}
 
   _makeRe(pattern) {
killedBy: All tests
statusReason: ✖ basic glob (0.859042ms)

✖ globstar (0.106709ms)
✖ question mark (0.100708ms)

✖ negation (0.464125ms)

✖ brace expansion (0.125791ms)

[Survived] MethodExpression
packages/minimatch/src/index.js:17:19
   }
 
   make() {
-    let pattern = this.pattern.trim();
+    let pattern = this.pattern;
     if (pattern.startsWith("!")) {
       this.negate = true;

[Killed] ConditionalExpression
packages/minimatch/src/index.js:18:9
 
   make() {
     let pattern = this.pattern.trim();
-    if (pattern.startsWith("!")) {
+    if (true) {
       this.negate = true;
       pattern = pattern.slice(1);
killedBy: All tests
statusReason: ✖ basic glob (1.042ms)
✖ globstar (0.253833ms)
✖ question mark (0.558958ms)

✔ negation (0.15975ms)
✖ brace expansion (0.350375ms)
✔ nocase option (0.076083ms)
✖ Minimatch class (0.086583ms)

[Killed] BlockStatement
packages/minimatch/src/index.js:18:34
 
   make() {
     let pattern = this.pattern.trim();
-    if (pattern.startsWith("!")) {
-      this.negate = true;
-      pattern = pattern.slice(1);
-    }
+    if (pattern.startsWith("!")) {}
 
     // Expand braces
killedBy: All tests
statusReason: ✔ basic glob (0.7355ms)

✔ globstar (0.16875ms)
✔ question mark (0.489791ms)

✖ negation (0.44675ms)
✔ brace expansion (0.348875ms)

[Killed] BooleanLiteral
packages/minimatch/src/index.js:19:21
   make() {
     let pattern = this.pattern.trim();
     if (pattern.startsWith("!")) {
-      this.negate = true;
+      this.negate = false;
       pattern = pattern.slice(1);
     }
killedBy: All tests
statusReason: ✔ basic glob (0.730666ms)

✔ globstar (0.169292ms)
✔ question mark (0.553458ms)

✖ negation (0.497041ms)
✔ brace expansion (0.364833ms)

[Killed] MethodExpression
packages/minimatch/src/index.js:20:17
     let pattern = this.pattern.trim();
     if (pattern.startsWith("!")) {
       this.negate = true;
-      pattern = pattern.slice(1);
+      pattern = pattern;
     }
 
killedBy: All tests
statusReason: ✔ basic glob (0.746459ms)

✔ globstar (0.163792ms)
✔ question mark (0.491209ms)

✖ negation (0.54975ms)
✔ brace expansion (0.363167ms)
✔ nocase option (0.087041ms)

[Killed] BooleanLiteral
packages/minimatch/src/index.js:25:35
 
     // Expand braces
     const expanded = pattern.includes("{")
-      ? braces(pattern, { expand: true })
+      ? braces(pattern, { expand: false })
       : [pattern];
     this.set = expanded.map((p) => this._makeRe(p));
killedBy: All tests
statusReason: ✔ basic glob (0.708834ms)

✔ globstar (0.160208ms)
✔ question mark (0.469084ms)
✔ negation (0.126291ms)

✖ brace expansion (0.566125ms)
✔ nocase option (0.099ms)

[Killed] ArrayDeclaration
packages/minimatch/src/index.js:26:9
     // Expand braces
     const expanded = pattern.includes("{")
       ? braces(pattern, { expand: true })
-      : [pattern];
+      : [];
     this.set = expanded.map((p) => this._makeRe(p));
   }
killedBy: All tests
statusReason: ✖ basic glob (0.868625ms)

✖ globstar (0.107958ms)
✖ question mark (0.085625ms)
✖ negation (0.49475ms)

✔ brace expansion (0.638ms)
✖ nocase option (0.104875ms)

[Killed] ArrowFunction
packages/minimatch/src/index.js:27:29
     const expanded = pattern.includes("{")
       ? braces(pattern, { expand: true })
       : [pattern];
-    this.set = expanded.map((p) => this._makeRe(p));
+    this.set = expanded.map(() => undefined);
   }
 
killedBy: All tests
statusReason: ✖ basic glob (0.579208ms)
✖ globstar (0.0715ms)

✖ question mark (0.057459ms)
✖ negation (0.055292ms)
✖ brace expansion (0.385708ms)
✖ nocase option (0.063625ms)
✖ Minimatch class (0.050416ms)

[Killed] StringLiteral
packages/minimatch/src/index.js:31:41
   }
 
   _makeRe(pattern) {
-    const flags = this.options.nocase ? "i" : "";
+    const flags = this.options.nocase ? "" : "";
     let re = "^";
     let i = 0;
killedBy: All tests
statusReason: ✔ basic glob (0.747458ms)

✔ globstar (0.164375ms)
✔ question mark (0.583875ms)
✔ negation (0.152292ms)
✔ brace expansion (0.387125ms)

✖ nocase option (0.491208ms)

[Killed] StringLiteral
packages/minimatch/src/index.js:31:47
   }
 
   _makeRe(pattern) {
-    const flags = this.options.nocase ? "i" : "";
+    const flags = this.options.nocase ? "i" : "Stryker was here!";
     let re = "^";
     let i = 0;
killedBy: All tests
statusReason: ✖ basic glob (1.011083ms)

✖ globstar (0.148333ms)
✖ question mark (0.117625ms)
✖ negation (0.222667ms)

✖ brace expansion (0.3185ms)

[Killed] ConditionalExpression
packages/minimatch/src/index.js:37:11
 
     while (i < pattern.length) {
       const c = pattern[i];
-      if (c === "*") {
+      if (false) {
         if (pattern[i + 1] === "*") {
           re += ".*";
killedBy: All tests
statusReason: ✖ basic glob (1.053375ms)

✖ globstar (0.154625ms)
✔ question mark (0.50075ms)

✖ negation (0.216125ms)

✖ brace expansion (0.269625ms)

[Killed] ConditionalExpression
packages/minimatch/src/index.js:37:11
 
     while (i < pattern.length) {
       const c = pattern[i];
-      if (c === "*") {
+      if (true) {
         if (pattern[i + 1] === "*") {
           re += ".*";
killedBy: All tests
statusReason: ✖ basic glob (0.9845ms)

✖ globstar (0.167542ms)
✖ question mark (0.494291ms)
✖ negation (0.129833ms)

✖ brace expansion (0.337542ms)
✔ nocase option (0.12425ms)

[Killed] ConditionalExpression
packages/minimatch/src/index.js:38:13
     while (i < pattern.length) {
       const c = pattern[i];
       if (c === "*") {
-        if (pattern[i + 1] === "*") {
+        if (false) {
           re += ".*";
           i += 2;
killedBy: All tests
statusReason: ✔ basic glob (0.727917ms)

✖ globstar (0.488583ms)

✔ question mark (0.505625ms)
✔ negation (0.148458ms)
✔ brace expansion (0.341167ms)

[Survived] ConditionalExpression
packages/minimatch/src/index.js:38:13
     while (i < pattern.length) {
       const c = pattern[i];
       if (c === "*") {
-        if (pattern[i + 1] === "*") {
+        if (true) {
           re += ".*";
           i += 2;

[Killed] StringLiteral
packages/minimatch/src/index.js:39:17
       const c = pattern[i];
       if (c === "*") {
         if (pattern[i + 1] === "*") {
-          re += ".*";
+          re += "";
           i += 2;
           if (pattern[i] === "/") {
killedBy: All tests
statusReason: ✔ basic glob (0.7935ms)

✖ globstar (0.478875ms)

✔ question mark (0.579875ms)
✔ negation (0.193292ms)
✔ brace expansion (0.352041ms)

[Killed] AssignmentOperator
packages/minimatch/src/index.js:40:11
       if (c === "*") {
         if (pattern[i + 1] === "*") {
           re += ".*";
-          i += 2;
+          i -= 2;
           if (pattern[i] === "/") {
             i++;
killedBy: All tests
statusReason: ✔ basic glob (0.749375ms)

✖ globstar (0.188625ms)

✔ question mark (0.133042ms)
✔ negation (0.486667ms)
✔ brace expansion (0.346334ms)

[Survived] BlockStatement
packages/minimatch/src/index.js:41:35
         if (pattern[i + 1] === "*") {
           re += ".*";
           i += 2;
-          if (pattern[i] === "/") {
-            i++;
-          }
+          if (pattern[i] === "/") {}
         } else {
           re += "[^/]*";

[Survived] EqualityOperator
packages/minimatch/src/index.js:41:15
         if (pattern[i + 1] === "*") {
           re += ".*";
           i += 2;
-          if (pattern[i] === "/") {
+          if (pattern[i] !== "/") {
             i++;
           }

[Survived] UpdateOperator
packages/minimatch/src/index.js:42:13
           re += ".*";
           i += 2;
           if (pattern[i] === "/") {
-            i++;
+            i--;
           }
         } else {

[Timeout] BlockStatement
packages/minimatch/src/index.js:44:16
           if (pattern[i] === "/") {
             i++;
           }
-        } else {
-          re += "[^/]*";
-          i++;
-        }
+        } else {}
       } else if (c === "?") {
         re += "[^/]";

[Timeout] UpdateOperator
packages/minimatch/src/index.js:46:11
           }
         } else {
           re += "[^/]*";
-          i++;
+          i--;
         }
       } else if (c === "?") {

[Killed] ConditionalExpression
packages/minimatch/src/index.js:48:18
           re += "[^/]*";
           i++;
         }
-      } else if (c === "?") {
+      } else if (false) {
         re += "[^/]";
         i++;
killedBy: All tests
statusReason: ✔ basic glob (0.799708ms)

✔ globstar (0.149083ms)
✖ question mark (0.860708ms)

✔ negation (0.105458ms)
✔ brace expansion (0.3165ms)
✔ nocase option (0.091125ms)

[Killed] ConditionalExpression
packages/minimatch/src/index.js:48:18
           re += "[^/]*";
           i++;
         }
-      } else if (c === "?") {
+      } else if (true) {
         re += "[^/]";
         i++;
killedBy: All tests
statusReason: ✖ basic glob (1.168ms)

✖ globstar (0.20475ms)
✔ question mark (0.618916ms)
✖ negation (0.19775ms)

✖ brace expansion (0.39325ms)

[Killed] StringLiteral
packages/minimatch/src/index.js:49:15
           i++;
         }
       } else if (c === "?") {
-        re += "[^/]";
+        re += "";
         i++;
       } else if (c === "[") {
killedBy: All tests
statusReason: ✔ basic glob (0.749292ms)

✔ globstar (0.16725ms)

✖ question mark (1.050833ms)
✔ negation (0.193291ms)
✔ brace expansion (0.371708ms)
✔ nocase option (0.105042ms)

[Killed] UpdateOperator
packages/minimatch/src/index.js:50:9
         }
       } else if (c === "?") {
         re += "[^/]";
-        i++;
+        i--;
       } else if (c === "[") {
         const end = pattern.indexOf("]", i + 1);
killedBy: All tests
statusReason: ✔ basic glob (0.746459ms)

✔ globstar (0.178417ms)

✖ question mark (0.213333ms)
✔ negation (0.109959ms)

✔ brace expansion (0.304042ms)

[Killed] EqualityOperator
packages/minimatch/src/index.js:51:18
       } else if (c === "?") {
         re += "[^/]";
         i++;
-      } else if (c === "[") {
+      } else if (c !== "[") {
         const end = pattern.indexOf("]", i + 1);
         if (end === -1) {
killedBy: All tests
statusReason: ✖ basic glob (0.984166ms)

✖ globstar (0.140792ms)
✖ question mark (0.108125ms)
✖ negation (0.197875ms)

✖ brace expansion (0.284875ms)

[Killed] ConditionalExpression
packages/minimatch/src/index.js:51:18
       } else if (c === "?") {
         re += "[^/]";
         i++;
-      } else if (c === "[") {
+      } else if (false) {
         const end = pattern.indexOf("]", i + 1);
         if (end === -1) {
killedBy: All tests
statusReason: ✔ basic glob (0.750875ms)

✔ globstar (0.2355ms)
✔ question mark (0.508625ms)
✔ negation (0.173875ms)
✔ brace expansion (0.333375ms)

✔ nocase option (0.087ms)

[Survived] ArithmeticOperator
packages/minimatch/src/index.js:52:42
         re += "[^/]";
         i++;
       } else if (c === "[") {
-        const end = pattern.indexOf("]", i + 1);
+        const end = pattern.indexOf("]", i - 1);
         if (end === -1) {
           re += "\\[";

[Killed] ConditionalExpression
packages/minimatch/src/index.js:53:13
         i++;
       } else if (c === "[") {
         const end = pattern.indexOf("]", i + 1);
-        if (end === -1) {
+        if (true) {
           re += "\\[";
           i++;
killedBy: All tests
statusReason: ✔ basic glob (0.702083ms)

✔ globstar (0.16675ms)
✔ question mark (0.45525ms)
✔ negation (0.094375ms)
✔ brace expansion (0.287209ms)

✔ nocase option (0.074625ms)

[Killed] EqualityOperator
packages/minimatch/src/index.js:53:13
         i++;
       } else if (c === "[") {
         const end = pattern.indexOf("]", i + 1);
-        if (end === -1) {
+        if (end !== -1) {
           re += "\\[";
           i++;
killedBy: All tests
statusReason: ✔ basic glob (0.816667ms)

✔ globstar (0.178042ms)
✔ question mark (0.490375ms)
✔ negation (0.123458ms)
✔ brace expansion (0.344291ms)

✔ nocase option (0.084334ms)

[Survived] StringLiteral
packages/minimatch/src/index.js:54:17
       } else if (c === "[") {
         const end = pattern.indexOf("]", i + 1);
         if (end === -1) {
-          re += "\\[";
+          re += "";
           i++;
         } else {

[Survived] UpdateOperator
packages/minimatch/src/index.js:55:11
         const end = pattern.indexOf("]", i + 1);
         if (end === -1) {
           re += "\\[";
-          i++;
+          i--;
         } else {
           re += pattern.slice(i, end + 1);

[Timeout] BlockStatement
packages/minimatch/src/index.js:56:16
         if (end === -1) {
           re += "\\[";
           i++;
-        } else {
-          re += pattern.slice(i, end + 1);
-          i = end + 1;
-        }
+        } else {}
       } else if (c === "/") {
         re += "\\/";

[Killed] MethodExpression
packages/minimatch/src/index.js:57:17
           re += "\\[";
           i++;
         } else {
-          re += pattern.slice(i, end + 1);
+          re += pattern;
           i = end + 1;
         }
killedBy: All tests
statusReason: ✔ basic glob (0.756291ms)

✔ globstar (0.164667ms)
✔ question mark (0.576709ms)
✔ negation (0.175375ms)

✔ brace expansion (0.355958ms)
✔ nocase option (0.0895ms)

[Killed] ArithmeticOperator
packages/minimatch/src/index.js:57:34
           re += "\\[";
           i++;
         } else {
-          re += pattern.slice(i, end + 1);
+          re += pattern.slice(i, end - 1);
           i = end + 1;
         }
killedBy: All tests
statusReason: ✔ basic glob (0.747334ms)

✔ globstar (0.161166ms)
✔ question mark (0.536458ms)
✔ negation (0.094292ms)
✔ brace expansion (0.320625ms)

✔ nocase option (0.088792ms)

[Killed] ArithmeticOperator
packages/minimatch/src/index.js:58:15
           i++;
         } else {
           re += pattern.slice(i, end + 1);
-          i = end + 1;
+          i = end - 1;
         }
       } else if (c === "/") {
killedBy: All tests
statusReason: ✔ basic glob (0.749291ms)

✔ globstar (0.160208ms)
✔ question mark (0.647ms)
✔ negation (0.227125ms)
✔ brace expansion (0.426458ms)
✔ nocase option (0.102208ms)
✔ Minimatch class (0.063209ms)

[Killed] ConditionalExpression
packages/minimatch/src/index.js:60:18
           re += pattern.slice(i, end + 1);
           i = end + 1;
         }
-      } else if (c === "/") {
+      } else if (true) {
         re += "\\/";
         i++;
killedBy: All tests
statusReason: ✖ basic glob (0.95925ms)

✖ globstar (0.13725ms)
✖ question mark (0.108458ms)

✖ negation (0.460792ms)

✖ brace expansion (0.235667ms)

[Killed] EqualityOperator
packages/minimatch/src/index.js:60:18
           re += pattern.slice(i, end + 1);
           i = end + 1;
         }
-      } else if (c === "/") {
+      } else if (c !== "/") {
         re += "\\/";
         i++;
killedBy: All tests
statusReason: ✖ basic glob (1.136ms)

✖ globstar (0.170375ms)
✖ question mark (0.1135ms)

✖ negation (0.584333ms)

✖ brace expansion (0.296875ms)

[Killed] StringLiteral
packages/minimatch/src/index.js:61:15
           i = end + 1;
         }
       } else if (c === "/") {
-        re += "\\/";
+        re += "";
         i++;
       } else {
killedBy: All tests
statusReason: ✔ basic glob (0.834334ms)

✔ globstar (0.171708ms)
✔ question mark (0.569833ms)
✔ negation (0.164458ms)
✔ brace expansion (0.35725ms)
✔ nocase option (0.087167ms)

[Timeout] UpdateOperator
packages/minimatch/src/index.js:62:9
         }
       } else if (c === "/") {
         re += "\\/";
-        i++;
+        i--;
       } else {
         re += c.replace(/[.*+?^${}()|[\]\\]/g, "\\$&");

[Timeout] BlockStatement
packages/minimatch/src/index.js:63:14
       } else if (c === "/") {
         re += "\\/";
         i++;
-      } else {
-        re += c.replace(/[.*+?^${}()|[\]\\]/g, "\\$&");
-        i++;
-      }
+      } else {}
     }
 

[Killed] AssignmentOperator
packages/minimatch/src/index.js:64:9
         re += "\\/";
         i++;
       } else {
-        re += c.replace(/[.*+?^${}()|[\]\\]/g, "\\$&");
+        re -= c.replace(/[.*+?^${}()|[\]\\]/g, "\\$&");
         i++;
       }
killedBy: All tests
statusReason: ✖ basic glob (1.106042ms)
✖ globstar (0.161333ms)
✖ question mark (0.272167ms)
✖ negation (0.199375ms)
✖ brace expansion (0.304792ms)

✖ nocase option (0.102125ms)
✖ Minimatch class (0.087167ms)

[Timeout] UpdateOperator
packages/minimatch/src/index.js:65:9
         i++;
       } else {
         re += c.replace(/[.*+?^${}()|[\]\\]/g, "\\$&");
-        i++;
+        i--;
       }
     }

[Killed] BlockStatement
packages/minimatch/src/index.js:70:9
     }
 
     re += "$";
-    try {
-      return new RegExp(re, flags);
-    } catch {
+    try {} catch {
       return /(?!)/;
     }
killedBy: All tests
statusReason: ✖ basic glob (0.727459ms)
✖ globstar (0.0915ms)
✖ question mark (0.0865ms)
✖ negation (0.067834ms)
✖ brace expansion (0.394791ms)
✖ nocase option (0.101875ms)
✖ Minimatch class (0.066042ms)
✖ filter (0.067417ms)

[Survived] BlockStatement
packages/minimatch/src/index.js:72:13
     re += "$";
     try {
       return new RegExp(re, flags);
-    } catch {
-      return /(?!)/;
-    }
+    } catch {}
   }
 

[Killed] BlockStatement
packages/minimatch/src/index.js:77:15
     }
   }
 
-  match(path) {
-    const hit = this.set.some((re) => re.test(path));
-    return this.negate ? !hit : hit;
-  }
+  match(path) {}
 }
 
killedBy: All tests
statusReason: ✖ basic glob (1.003208ms)

✖ globstar (0.12775ms)
✖ question mark (0.105292ms)

✖ negation (0.225875ms)
✖ brace expansion (0.378042ms)

[Killed] MethodExpression
packages/minimatch/src/index.js:78:17
   }
 
   match(path) {
-    const hit = this.set.some((re) => re.test(path));
+    const hit = this.set.every(re => re.test(path));
     return this.negate ? !hit : hit;
   }
killedBy: All tests
statusReason: ✔ basic glob (0.77175ms)
✔ globstar (0.158375ms)

✔ question mark (0.770667ms)
✔ negation (0.182916ms)

✖ brace expansion (0.717458ms)
✔ nocase option (0.110459ms)

[Killed] ArrowFunction
packages/minimatch/src/index.js:78:31
   }
 
   match(path) {
-    const hit = this.set.some((re) => re.test(path));
+    const hit = this.set.some(() => undefined);
     return this.negate ? !hit : hit;
   }
killedBy: All tests
statusReason: ✖ basic glob (1.035833ms)

✖ globstar (0.136625ms)
✖ question mark (0.115292ms)

✖ negation (0.151041ms)

✖ brace expansion (0.277167ms)

[Killed] BooleanLiteral
packages/minimatch/src/index.js:79:26
 
   match(path) {
     const hit = this.set.some((re) => re.test(path));
-    return this.negate ? !hit : hit;
+    return this.negate ? hit : hit;
   }
 }
killedBy: All tests
statusReason: ✔ basic glob (0.711958ms)

✔ globstar (0.161125ms)
✔ question mark (0.509916ms)

✖ negation (0.5125ms)
✔ brace expansion (0.361833ms)
✔ nocase option (0.088417ms)

[Killed] ArrowFunction
packages/minimatch/src/index.js:84:20
 }
 
 minimatch.Minimatch = Minimatch;
-minimatch.filter = (pattern, options) => (path) =>
-  minimatch(path, pattern, options);
+minimatch.filter = () => undefined;
 minimatch.match = (list, pattern, options) =>
   list.filter((p) => minimatch(p, pattern, options));
killedBy: All tests
statusReason: ✔ basic glob (0.708708ms)

✔ globstar (0.157ms)
✔ question mark (0.434833ms)
✔ negation (0.093416ms)

✔ brace expansion (0.293583ms)

[Killed] ArrowFunction
packages/minimatch/src/index.js:84:42
 }
 
 minimatch.Minimatch = Minimatch;
-minimatch.filter = (pattern, options) => (path) =>
-  minimatch(path, pattern, options);
+minimatch.filter = (pattern, options) => () => undefined;
 minimatch.match = (list, pattern, options) =>
   list.filter((p) => minimatch(p, pattern, options));
killedBy: All tests
statusReason: ✔ basic glob (0.739625ms)

✔ globstar (0.160541ms)
✔ question mark (0.552917ms)
✔ negation (0.121417ms)

✔ brace expansion (0.330958ms)
✔ nocase option (0.086959ms)

[Killed] ArrowFunction
packages/minimatch/src/index.js:86:19
 minimatch.Minimatch = Minimatch;
 minimatch.filter = (pattern, options) => (path) =>
   minimatch(path, pattern, options);
-minimatch.match = (list, pattern, options) =>
-  list.filter((p) => minimatch(p, pattern, options));
+minimatch.match = () => undefined;
 minimatch.makeRe = (pattern, options) =>
   new Minimatch(pattern, options).set[0] || /(?!)/;
killedBy: All tests
statusReason: ✔ basic glob (0.7685ms)

✔ globstar (0.174167ms)
✔ question mark (0.782375ms)
✔ negation (0.235167ms)
✔ brace expansion (0.5305ms)

✔ nocase option (0.107125ms)

[Killed] MethodExpression
packages/minimatch/src/index.js:87:3
 minimatch.filter = (pattern, options) => (path) =>
   minimatch(path, pattern, options);
 minimatch.match = (list, pattern, options) =>
-  list.filter((p) => minimatch(p, pattern, options));
+  list;
 minimatch.makeRe = (pattern, options) =>
   new Minimatch(pattern, options).set[0] || /(?!)/;
killedBy: All tests
statusReason: ✔ basic glob (0.77ms)

✔ globstar (0.159ms)
✔ question mark (0.563542ms)
✔ negation (0.177167ms)
✔ brace expansion (0.36225ms)

✔ nocase option (0.097792ms)

[Killed] ArrowFunction
packages/minimatch/src/index.js:87:15
 minimatch.filter = (pattern, options) => (path) =>
   minimatch(path, pattern, options);
 minimatch.match = (list, pattern, options) =>
-  list.filter((p) => minimatch(p, pattern, options));
+  list.filter(() => undefined);
 minimatch.makeRe = (pattern, options) =>
   new Minimatch(pattern, options).set[0] || /(?!)/;
killedBy: All tests
statusReason: ✔ basic glob (0.722417ms)

✔ globstar (0.156875ms)
✔ question mark (0.477666ms)
✔ negation (0.129334ms)
✔ brace expansion (0.346041ms)

✔ nocase option (0.084292ms)

[Killed] ArrowFunction
packages/minimatch/src/index.js:88:20
   minimatch(path, pattern, options);
 minimatch.match = (list, pattern, options) =>
   list.filter((p) => minimatch(p, pattern, options));
-minimatch.makeRe = (pattern, options) =>
-  new Minimatch(pattern, options).set[0] || /(?!)/;
+minimatch.makeRe = () => undefined;
 
 module.exports = minimatch;
killedBy: All tests
statusReason: ✔ basic glob (0.903416ms)

✔ globstar (0.217625ms)
✔ question mark (0.533458ms)
✔ negation (0.134708ms)
✔ brace expansion (0.332042ms)

✔ nocase option (0.08325ms)

[Killed] LogicalOperator
packages/minimatch/src/index.js:89:3
 minimatch.match = (list, pattern, options) =>
   list.filter((p) => minimatch(p, pattern, options));
 minimatch.makeRe = (pattern, options) =>
-  new Minimatch(pattern, options).set[0] || /(?!)/;
+  new Minimatch(pattern, options).set[0] && /(?!)/;
 
 module.exports = minimatch;
killedBy: All tests
statusReason: ✔ basic glob (0.764791ms)

✔ globstar (0.171209ms)
✔ question mark (0.604917ms)
✔ negation (0.198791ms)
✔ brace expansion (0.404917ms)

✔ nocase option (0.096958ms)

[Killed] ConditionalExpression
packages/minimatch/src/index.js:89:3
 minimatch.match = (list, pattern, options) =>
   list.filter((p) => minimatch(p, pattern, options));
 minimatch.makeRe = (pattern, options) =>
-  new Minimatch(pattern, options).set[0] || /(?!)/;
+  true;
 
 module.exports = minimatch;
killedBy: All tests
statusReason: ✔ basic glob (0.69475ms)

✔ globstar (0.15325ms)
✔ question mark (0.553125ms)
✔ negation (0.153209ms)
✔ brace expansion (0.373833ms)

✔ nocase option (0.106ms)
