[Killed] Regex
packages/ms/src/index.js:16:3
 // Regex matching time strings like "2 days", "1h", "500ms"
 // Safe: input length capped at 100 chars to prevent ReDoS
 const PARSE_RE =
-  /^(-?(?:\d+)?\.?\d+)\s*(ms|milliseconds?|s|sec|seconds?|m|min|minutes?|h|hrs?|hours?|d|days?|w|weeks?|y|years?)?$/i;
+  /^(-?(?:\d+)?\.?\d+)\s*(ms|milliseconds?|s|sec|seconds?|m|min|minutes?|h|hrs?|hours?|d|days?|w|weeks?|y|years?)$/i;
 
 /** @param {string|number} val @param {{ long?: boolean }} [options] @returns {string|number|undefined} */
killedBy: All tests
statusReason: ✖ parse: milliseconds (1.148125ms)
✔ parse: seconds (0.107791ms)

✔ parse: minutes (0.064458ms)
✔ parse: hours (0.482625ms)
✔ parse: days (0.122416ms)
✔ parse: weeks (0.071125ms)
✔ parse: negative (0.051625ms)

[Killed] EqualityOperator
packages/ms/src/index.js:23:7
 module.exports = function ms(val, options) {
   const type = typeof val;
   if (type === "string" && val.length > 0) return parse(val);
-  if (type === "number" && Number.isFinite(val))
+  if (type !== "number" && Number.isFinite(val))
     return options?.long ? fmtLong(val) : fmtShort(val);
   throw new Error(
killedBy: All tests
statusReason: ✔ parse: milliseconds (0.754125ms)

✔ parse: seconds (0.08125ms)
✔ parse: minutes (0.070542ms)
✔ parse: hours (0.462166ms)
✔ parse: days (0.212125ms)
✔ parse: weeks (0.074167ms)

[Killed] BooleanLiteral
packages/ms/src/index.js:36:7
   const s = str.trim();
   if (s.length > 100) return undefined;
   const match = PARSE_RE.exec(s);
-  if (!match) return undefined;
+  if (match) return undefined;
   const n = Number.parseFloat(match[1]);
   const unit = (match[2] || "ms").toLowerCase();
killedBy: All tests
statusReason: ✖ parse: milliseconds (0.973166ms)

✖ parse: seconds (0.2205ms)
✖ parse: minutes (0.088375ms)

✖ parse: hours (0.079709ms)
✖ parse: days (0.092ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:41:7
   const unit = (match[2] || "ms").toLowerCase();
   if (unit === "ms" || unit.startsWith("millisecond")) return n;
   if (unit === "s" || unit.startsWith("sec")) return n * S;
-  if (unit === "m" || unit.startsWith("min")) return n * M;
+  if (false || unit.startsWith("min")) return n * M;
   if (unit === "h" || unit.startsWith("hr") || unit.startsWith("hour"))
     return n * H;
killedBy: All tests
statusReason: ✔ parse: milliseconds (0.7905ms)

✔ parse: seconds (0.07675ms)

✖ parse: minutes (0.427041ms)
✔ parse: hours (0.491625ms)

✔ parse: days (0.137208ms)

[Killed] EqualityOperator
packages/ms/src/index.js:45:7
   if (unit === "h" || unit.startsWith("hr") || unit.startsWith("hour"))
     return n * H;
   if (unit === "d" || unit.startsWith("day")) return n * D;
-  if (unit === "w" || unit.startsWith("week")) return n * W;
+  if (unit !== "w" || unit.startsWith("week")) return n * W;
   if (unit === "y" || unit.startsWith("year")) return n * Y;
   return undefined;
killedBy: All tests
statusReason: ✔ parse: milliseconds (0.737ms)

✔ parse: seconds (0.078208ms)
✔ parse: minutes (0.066791ms)
✔ parse: hours (0.405291ms)

✔ parse: days (0.112667ms)

[Killed] EqualityOperator
packages/ms/src/index.js:66:7
 function fmtLong(ms) {
   const abs = Math.abs(ms);
   if (abs >= D) return plural(ms, abs, D, "day");
-  if (abs >= H) return plural(ms, abs, H, "hour");
+  if (abs < H) return plural(ms, abs, H, "hour");
   if (abs >= M) return plural(ms, abs, M, "minute");
   if (abs >= S) return plural(ms, abs, S, "second");
killedBy: All tests
statusReason: ✔ parse: milliseconds (0.853125ms)

✔ parse: seconds (0.087083ms)
✔ parse: minutes (0.073708ms)
✔ parse: hours (0.411417ms)
✔ parse: days (0.087208ms)

✔ parse: weeks (0.069625ms)

[Killed] ConditionalExpression
packages/ms/src/index.js:67:7
   const abs = Math.abs(ms);
   if (abs >= D) return plural(ms, abs, D, "day");
   if (abs >= H) return plural(ms, abs, H, "hour");
-  if (abs >= M) return plural(ms, abs, M, "minute");
+  if (true) return plural(ms, abs, M, "minute");
   if (abs >= S) return plural(ms, abs, S, "second");
   return `${ms} ms`;
killedBy: All tests
statusReason: ✔ parse: milliseconds (0.838333ms)

✔ parse: seconds (0.088417ms)
✔ parse: minutes (0.067375ms)
✔ parse: hours (0.410458ms)
✔ parse: days (0.133541ms)

✔ parse: weeks (0.088667ms)

[Killed] EqualityOperator
packages/ms/src/index.js:68:7
   if (abs >= D) return plural(ms, abs, D, "day");
   if (abs >= H) return plural(ms, abs, H, "hour");
   if (abs >= M) return plural(ms, abs, M, "minute");
-  if (abs >= S) return plural(ms, abs, S, "second");
+  if (abs > S) return plural(ms, abs, S, "second");
   return `${ms} ms`;
 }
killedBy: All tests
statusReason: ✔ parse: milliseconds (0.811167ms)

✔ parse: seconds (0.085958ms)
✔ parse: minutes (0.069459ms)
✔ parse: hours (0.461208ms)

✔ parse: days (0.130791ms)
✔ parse: weeks (0.092791ms)

[Killed] ArithmeticOperator
packages/ms/src/index.js:73:27
 }
 
 function plural(ms, abs, unit, name) {
-  const isPlural = abs >= unit * 1.5;
+  const isPlural = abs >= unit / 1.5;
   return `${Math.round(ms / unit)} ${name}${isPlural ? "s" : ""}`;
 }
killedBy: All tests
statusReason: ✔ parse: milliseconds (0.815333ms)

✔ parse: seconds (0.082ms)
✔ parse: minutes (0.064875ms)
✔ parse: hours (0.4295ms)

✔ parse: days (0.088791ms)
✔ parse: weeks (0.079ms)
