[Killed] BlockStatement
packages/debug/src/index.js:5:27
  * @flupkejs/debug — debug
  * @see https://www.npmjs.com/package/debug
  */
-function debug(namespace) {
-  const fn = (...args) => {
-    if (!debug.enabled(namespace)) return;
-    const msg = typeof args[0] === "string" ? args.shift() : "";
-    process.stderr.write(`${namespace} ${msg}\n`);
-  };
-  fn.namespace = namespace;
-  fn.enabled = debug.enabled(namespace);
-  return fn;
-}
+function debug(namespace) {}
 debug.enabled = (ns) => {
   const e = process.env.DEBUG || "";
killedBy: All tests
statusReason: ✖ returns function (1.492583ms)

✖ has namespace property (0.088708ms)
✖ has enabled property (0.055334ms)
✔ enabled returns false when DEBUG is empty (0.186625ms)
✔ enabled returns true for exact match (0.113333ms)

✔ enabled returns true for wildcard * (0.055084ms)

[Killed] BlockStatement
packages/debug/src/index.js:6:27
  * @see https://www.npmjs.com/package/debug
  */
 function debug(namespace) {
-  const fn = (...args) => {
-    if (!debug.enabled(namespace)) return;
-    const msg = typeof args[0] === "string" ? args.shift() : "";
-    process.stderr.write(`${namespace} ${msg}\n`);
-  };
+  const fn = (...args) => {};
   fn.namespace = namespace;
   fn.enabled = debug.enabled(namespace);
killedBy: All tests
statusReason: ✔ returns function (1.217958ms)
✔ has namespace property (0.090666ms)
✔ has enabled property (0.125333ms)
✔ enabled returns false when DEBUG is empty (0.092875ms)
✔ enabled returns true for exact match (0.142458ms)
✔ enabled returns true for wildcard * (0.079667ms)
✔ enabled supports trailing glob (0.132333ms)
✔ enabled supports prefix glob (0.100208ms)

[Killed] ConditionalExpression
packages/debug/src/index.js:7:9
  */
 function debug(namespace) {
   const fn = (...args) => {
-    if (!debug.enabled(namespace)) return;
+    if (true) return;
     const msg = typeof args[0] === "string" ? args.shift() : "";
     process.stderr.write(`${namespace} ${msg}\n`);
killedBy: All tests
statusReason: ✔ returns function (1.619459ms)

✔ has namespace property (0.081292ms)
✔ has enabled property (0.116292ms)

✔ enabled returns false when DEBUG is empty (0.061083ms)

✔ enabled returns true for exact match (0.091833ms)

[Killed] BooleanLiteral
packages/debug/src/index.js:7:9
  */
 function debug(namespace) {
   const fn = (...args) => {
-    if (!debug.enabled(namespace)) return;
+    if (debug.enabled(namespace)) return;
     const msg = typeof args[0] === "string" ? args.shift() : "";
     process.stderr.write(`${namespace} ${msg}\n`);
killedBy: All tests
statusReason: ✔ returns function (1.277541ms)

✔ has namespace property (0.0725ms)
✔ has enabled property (0.11475ms)
✔ enabled returns false when DEBUG is empty (0.056333ms)
✔ enabled returns true for exact match (0.083125ms)
✔ enabled returns true for wildcard * (0.059875ms)
✔ enabled supports trailing glob (0.08975ms)

[Killed] ConditionalExpression
packages/debug/src/index.js:8:17
 function debug(namespace) {
   const fn = (...args) => {
     if (!debug.enabled(namespace)) return;
-    const msg = typeof args[0] === "string" ? args.shift() : "";
+    const msg = false ? args.shift() : "";
     process.stderr.write(`${namespace} ${msg}\n`);
   };
killedBy: All tests
statusReason: ✔ returns function (1.057167ms)

✔ has namespace property (0.079042ms)
✔ has enabled property (0.119667ms)
✔ enabled returns false when DEBUG is empty (0.059792ms)
✔ enabled returns true for exact match (0.080333ms)
✔ enabled returns true for wildcard * (0.060458ms)

[Killed] EqualityOperator
packages/debug/src/index.js:8:17
 function debug(namespace) {
   const fn = (...args) => {
     if (!debug.enabled(namespace)) return;
-    const msg = typeof args[0] === "string" ? args.shift() : "";
+    const msg = typeof args[0] !== "string" ? args.shift() : "";
     process.stderr.write(`${namespace} ${msg}\n`);
   };
killedBy: All tests
statusReason: ✔ returns function (1.125875ms)

✔ has namespace property (0.102167ms)
✔ has enabled property (0.124667ms)
✔ enabled returns false when DEBUG is empty (0.064709ms)
✔ enabled returns true for exact match (0.090208ms)

✔ enabled returns true for wildcard * (0.05775ms)

[Killed] StringLiteral
packages/debug/src/index.js:9:26
   const fn = (...args) => {
     if (!debug.enabled(namespace)) return;
     const msg = typeof args[0] === "string" ? args.shift() : "";
-    process.stderr.write(`${namespace} ${msg}\n`);
+    process.stderr.write(``);
   };
   fn.namespace = namespace;
killedBy: All tests
statusReason: ✔ returns function (1.034625ms)

✔ has namespace property (0.073083ms)
✔ has enabled property (0.122917ms)
✔ enabled returns false when DEBUG is empty (0.059958ms)
✔ enabled returns true for exact match (0.081209ms)

✔ enabled returns true for wildcard * (0.0655ms)

[Killed] BlockStatement
packages/debug/src/index.js:15:25
   fn.enabled = debug.enabled(namespace);
   return fn;
 }
-debug.enabled = (ns) => {
-  const e = process.env.DEBUG || "";
-  if (!e) return false;
-  if (e === "*") return true;
-  return e.split(",").some((p) => {
-    p = p.trim();
-    if (p === ns) return true;
-    // Simple glob: only support trailing * (e.g. "app:*")
-    if (p.endsWith("*") && ns.startsWith(p.slice(0, -1))) return true;
-    // Support prefix* matching (e.g. "http*")
-    const parts = p.split("*");
-    if (parts.length === 2)
-      return ns.startsWith(parts[0]) && ns.endsWith(parts[1]);
-    return false;
-  });
-};
+debug.enabled = (ns) => {};
 module.exports = debug;
 
killedBy: All tests
statusReason: ✔ returns function (1.002958ms)

✔ has namespace property (0.089167ms)

✖ has enabled property (0.459ms)

✖ enabled returns false when DEBUG is empty (0.09675ms)

[Killed] ConditionalExpression
packages/debug/src/index.js:16:13
   return fn;
 }
 debug.enabled = (ns) => {
-  const e = process.env.DEBUG || "";
+  const e = false;
   if (!e) return false;
   if (e === "*") return true;
killedBy: All tests
statusReason: ✔ returns function (0.978292ms)

✔ has namespace property (0.074834ms)

✖ has enabled property (0.419417ms)
✔ enabled returns false when DEBUG is empty (0.066125ms)

✖ enabled returns true for exact match (0.092458ms)

[Killed] ConditionalExpression
packages/debug/src/index.js:16:13
   return fn;
 }
 debug.enabled = (ns) => {
-  const e = process.env.DEBUG || "";
+  const e = true;
   if (!e) return false;
   if (e === "*") return true;
killedBy: All tests
statusReason: ✖ returns function (1.137042ms)

✖ has namespace property (0.109833ms)
✖ has enabled property (0.090333ms)
✖ enabled returns false when DEBUG is empty (0.086334ms)

✖ enabled returns true for exact match (0.100125ms)

[Killed] BooleanLiteral
packages/debug/src/index.js:17:18
 }
 debug.enabled = (ns) => {
   const e = process.env.DEBUG || "";
-  if (!e) return false;
+  if (!e) return true;
   if (e === "*") return true;
   return e.split(",").some((p) => {
killedBy: All tests
statusReason: ✔ returns function (1.154ms)

✔ has namespace property (0.092459ms)
✔ has enabled property (0.120958ms)

✖ enabled returns false when DEBUG is empty (0.440583ms)

✔ enabled returns true for exact match (0.082125ms)

[Killed] ConditionalExpression
packages/debug/src/index.js:17:7
 }
 debug.enabled = (ns) => {
   const e = process.env.DEBUG || "";
-  if (!e) return false;
+  if (true) return false;
   if (e === "*") return true;
   return e.split(",").some((p) => {
killedBy: All tests
statusReason: ✔ returns function (0.893875ms)

✔ has namespace property (0.062875ms)

✖ has enabled property (0.394583ms)
✔ enabled returns false when DEBUG is empty (0.067208ms)

✖ enabled returns true for exact match (0.104334ms)

[Killed] ConditionalExpression
packages/debug/src/index.js:18:7
 debug.enabled = (ns) => {
   const e = process.env.DEBUG || "";
   if (!e) return false;
-  if (e === "*") return true;
+  if (true) return true;
   return e.split(",").some((p) => {
     p = p.trim();
killedBy: All tests
statusReason: ✔ returns function (0.985292ms)

✔ has namespace property (0.073209ms)
✔ has enabled property (0.061625ms)
✔ enabled returns false when DEBUG is empty (0.056792ms)

✖ enabled returns true for exact match (0.436458ms)
✔ enabled returns true for wildcard * (0.071667ms)

[Killed] EqualityOperator
packages/debug/src/index.js:18:7
 debug.enabled = (ns) => {
   const e = process.env.DEBUG || "";
   if (!e) return false;
-  if (e === "*") return true;
+  if (e !== "*") return true;
   return e.split(",").some((p) => {
     p = p.trim();
killedBy: All tests
statusReason: ✔ returns function (1.033959ms)

✔ has namespace property (0.064708ms)
✔ has enabled property (0.059375ms)
✔ enabled returns false when DEBUG is empty (0.057375ms)

✖ enabled returns true for exact match (0.42475ms)
✔ enabled returns true for wildcard * (0.127375ms)

[Killed] BlockStatement
packages/debug/src/index.js:19:35
   const e = process.env.DEBUG || "";
   if (!e) return false;
   if (e === "*") return true;
-  return e.split(",").some((p) => {
-    p = p.trim();
-    if (p === ns) return true;
-    // Simple glob: only support trailing * (e.g. "app:*")
-    if (p.endsWith("*") && ns.startsWith(p.slice(0, -1))) return true;
-    // Support prefix* matching (e.g. "http*")
-    const parts = p.split("*");
-    if (parts.length === 2)
-      return ns.startsWith(parts[0]) && ns.endsWith(parts[1]);
-    return false;
-  });
+  return e.split(",").some((p) => {});
 };
 module.exports = debug;
killedBy: All tests
statusReason: ✔ returns function (1.056625ms)

✔ has namespace property (0.071667ms)

✖ has enabled property (0.468958ms)

✔ enabled returns false when DEBUG is empty (0.064375ms)

[Killed] MethodExpression
packages/debug/src/index.js:19:10
   const e = process.env.DEBUG || "";
   if (!e) return false;
   if (e === "*") return true;
-  return e.split(",").some((p) => {
-    p = p.trim();
-    if (p === ns) return true;
-    // Simple glob: only support trailing * (e.g. "app:*")
-    if (p.endsWith("*") && ns.startsWith(p.slice(0, -1))) return true;
-    // Support prefix* matching (e.g. "http*")
-    const parts = p.split("*");
-    if (parts.length === 2)
-      return ns.startsWith(parts[0]) && ns.endsWith(parts[1]);
-    return false;
-  });
+  return e.split(",").every(p => {
+  p = p.trim();
+  if (p === ns) return true;
+  // Simple glob: only support trailing * (e.g. "app:*")
+  if (p.endsWith("*") && ns.startsWith(p.slice(0, -1))) return true;
+  // Support prefix* matching (e.g. "http*")
+  const parts = p.split("*");
+  if (parts.length === 2) return ns.startsWith(parts[0]) && ns.endsWith(parts[1]);
+  return false;
+});
 };
 module.exports = debug;
killedBy: All tests
statusReason: ✔ returns function (1.15525ms)

✔ has namespace property (0.074958ms)
✔ has enabled property (0.082416ms)
✔ enabled returns false when DEBUG is empty (0.05925ms)
✔ enabled returns true for exact match (0.079584ms)

✔ enabled returns true for wildcard * (0.065209ms)

[Killed] MethodExpression
packages/debug/src/index.js:20:9
   if (!e) return false;
   if (e === "*") return true;
   return e.split(",").some((p) => {
-    p = p.trim();
+    p = p;
     if (p === ns) return true;
     // Simple glob: only support trailing * (e.g. "app:*")
killedBy: All tests
statusReason: ✔ returns function (0.880125ms)

✔ has namespace property (0.063125ms)
✔ has enabled property (0.108875ms)
✔ enabled returns false when DEBUG is empty (0.05525ms)
✔ enabled returns true for exact match (0.0795ms)

✔ enabled returns true for wildcard * (0.062208ms)

[Killed] ConditionalExpression
packages/debug/src/index.js:21:9
   if (e === "*") return true;
   return e.split(",").some((p) => {
     p = p.trim();
-    if (p === ns) return true;
+    if (true) return true;
     // Simple glob: only support trailing * (e.g. "app:*")
     if (p.endsWith("*") && ns.startsWith(p.slice(0, -1))) return true;
killedBy: All tests
statusReason: ✔ returns function (1.062375ms)

✔ has namespace property (0.083417ms)
✔ has enabled property (0.121916ms)
✔ enabled returns false when DEBUG is empty (0.062542ms)

✖ enabled returns true for exact match (0.473375ms)
✔ enabled returns true for wildcard * (0.073708ms)

[Killed] BooleanLiteral
packages/debug/src/index.js:21:26
   if (e === "*") return true;
   return e.split(",").some((p) => {
     p = p.trim();
-    if (p === ns) return true;
+    if (p === ns) return false;
     // Simple glob: only support trailing * (e.g. "app:*")
     if (p.endsWith("*") && ns.startsWith(p.slice(0, -1))) return true;
killedBy: All tests
statusReason: ✔ returns function (1.192541ms)

✔ has namespace property (0.090583ms)
✖ has enabled property (0.519125ms)

✔ enabled returns false when DEBUG is empty (0.073792ms)
✖ enabled returns true for exact match (0.105834ms)
✔ enabled returns true for wildcard * (0.069375ms)

[Killed] MethodExpression
packages/debug/src/index.js:23:28
     p = p.trim();
     if (p === ns) return true;
     // Simple glob: only support trailing * (e.g. "app:*")
-    if (p.endsWith("*") && ns.startsWith(p.slice(0, -1))) return true;
+    if (p.endsWith("*") && ns.endsWith(p.slice(0, -1))) return true;
     // Support prefix* matching (e.g. "http*")
     const parts = p.split("*");
killedBy: All tests
statusReason: ✔ returns function (0.976792ms)

✔ has namespace property (0.071041ms)
✔ has enabled property (0.121792ms)
✔ enabled returns false when DEBUG is empty (0.059084ms)
✔ enabled returns true for exact match (0.081458ms)

✔ enabled returns true for wildcard * (0.052708ms)

[Killed] LogicalOperator
packages/debug/src/index.js:23:9
     p = p.trim();
     if (p === ns) return true;
     // Simple glob: only support trailing * (e.g. "app:*")
-    if (p.endsWith("*") && ns.startsWith(p.slice(0, -1))) return true;
+    if (p.endsWith("*") || ns.startsWith(p.slice(0, -1))) return true;
     // Support prefix* matching (e.g. "http*")
     const parts = p.split("*");
killedBy: All tests
statusReason: ✔ returns function (1.083666ms)

✔ has namespace property (0.069041ms)
✔ has enabled property (0.113083ms)
✔ enabled returns false when DEBUG is empty (0.059084ms)
✔ enabled returns true for exact match (0.098791ms)

✔ enabled returns true for wildcard * (0.064291ms)

[Killed] StringLiteral
packages/debug/src/index.js:25:27
     // Simple glob: only support trailing * (e.g. "app:*")
     if (p.endsWith("*") && ns.startsWith(p.slice(0, -1))) return true;
     // Support prefix* matching (e.g. "http*")
-    const parts = p.split("*");
+    const parts = p.split("");
     if (parts.length === 2)
       return ns.startsWith(parts[0]) && ns.endsWith(parts[1]);
killedBy: All tests
statusReason: ✔ returns function (1.089375ms)

✔ has namespace property (0.083584ms)
✔ has enabled property (0.120125ms)
✔ enabled returns false when DEBUG is empty (0.06ms)
✔ enabled returns true for exact match (0.097166ms)
✔ enabled returns true for wildcard * (0.060625ms)

[Killed] ConditionalExpression
packages/debug/src/index.js:26:9
     if (p.endsWith("*") && ns.startsWith(p.slice(0, -1))) return true;
     // Support prefix* matching (e.g. "http*")
     const parts = p.split("*");
-    if (parts.length === 2)
+    if (false)
       return ns.startsWith(parts[0]) && ns.endsWith(parts[1]);
     return false;
killedBy: All tests
statusReason: ✔ returns function (1.050458ms)

✔ has namespace property (0.069708ms)
✔ has enabled property (0.11775ms)
✔ enabled returns false when DEBUG is empty (0.058042ms)
✔ enabled returns true for exact match (0.090416ms)

✔ enabled returns true for wildcard * (0.061625ms)

[Killed] EqualityOperator
packages/debug/src/index.js:26:9
     if (p.endsWith("*") && ns.startsWith(p.slice(0, -1))) return true;
     // Support prefix* matching (e.g. "http*")
     const parts = p.split("*");
-    if (parts.length === 2)
+    if (parts.length !== 2)
       return ns.startsWith(parts[0]) && ns.endsWith(parts[1]);
     return false;
killedBy: All tests
statusReason: ✔ returns function (1.044625ms)

✔ has namespace property (0.072ms)
✔ has enabled property (0.112ms)
✔ enabled returns false when DEBUG is empty (0.057875ms)
✔ enabled returns true for exact match (0.0855ms)
✔ enabled returns true for wildcard * (0.061458ms)

[Killed] MethodExpression
packages/debug/src/index.js:27:14
     // Support prefix* matching (e.g. "http*")
     const parts = p.split("*");
     if (parts.length === 2)
-      return ns.startsWith(parts[0]) && ns.endsWith(parts[1]);
+      return ns.endsWith(parts[0]) && ns.endsWith(parts[1]);
     return false;
   });
killedBy: All tests
statusReason: ✔ returns function (0.928084ms)

✔ has namespace property (0.066125ms)
✔ has enabled property (0.1065ms)
✔ enabled returns false when DEBUG is empty (0.056167ms)
✔ enabled returns true for exact match (0.077833ms)

✔ enabled returns true for wildcard * (0.0565ms)

[Killed] LogicalOperator
packages/debug/src/index.js:27:14
     // Support prefix* matching (e.g. "http*")
     const parts = p.split("*");
     if (parts.length === 2)
-      return ns.startsWith(parts[0]) && ns.endsWith(parts[1]);
+      return ns.startsWith(parts[0]) || ns.endsWith(parts[1]);
     return false;
   });
killedBy: All tests
statusReason: ✔ returns function (0.993042ms)

✔ has namespace property (0.07525ms)
✔ has enabled property (0.113417ms)
✔ enabled returns false when DEBUG is empty (0.060542ms)
✔ enabled returns true for exact match (0.091584ms)
✔ enabled returns true for wildcard * (0.058291ms)

[Killed] BooleanLiteral
packages/debug/src/index.js:28:12
     const parts = p.split("*");
     if (parts.length === 2)
       return ns.startsWith(parts[0]) && ns.endsWith(parts[1]);
-    return false;
+    return true;
   });
 };
killedBy: All tests
statusReason: ✔ returns function (1.154083ms)

✔ has namespace property (0.089125ms)
✔ has enabled property (0.126666ms)
✔ enabled returns false when DEBUG is empty (0.065375ms)

✖ enabled returns true for exact match (0.48125ms)
